[
  {
    "ticker": "ATAI",
    "title": "Aegle Therapeutics Names Industry Veteran Scott Braunstein, M.D. as Chairman of the Board",
    "link": "https://www.globenewswire.com/news-release/2025/07/15/3115771/0/en/Aegle-Therapeutics-Names-Industry-Veteran-Scott-Braunstein-M-D-as-Chairman-of-the-Board.html",
    "date": "July 15, 2025 10:00 ET",
    "text": "Aegle Therapeutics Names Industry Veteran Scott Braunstein, M.D. as Chairman of the Board\nJuly 15, 2025 10:00 ET\n| Source:\nAegle Therapeutics\nFollow\nAegle Therapeutics\nShare\nBOSTON, July  15, 2025  (GLOBE NEWSWIRE) -- Aegle Therapeutics, a clinical-stage dermatology-focused biopharmaceutical company developing novel therapies for those living with rare and severe skin diseases, today announced the appointment of Scott Braunstein, M.D., as Chairman of the Board. The company’s lead product candidate AGLE-102, a composite of mesenchymal stem cell derived extracellular vesicles (MSC-EVs), is currently being evaluated in a Phase 1/2a trial for the treatment of recessive dystrophic epidermolysis bullosa (RDEB), a rare pediatric skin blistering disorder.\n“We are excited to welcome Dr. Braunstein as Chairman and look forward to his guidance as we advance the development of AGLE-102 as a novel therapeutic platform for rare and severe dermatological disorders,” said Shelley Hartman, CEO of Aegle. “Dr. Braunstein’s extensive industry experience will be a valuable addition to our leadership team as we continue to develop AGLE-102 for RDEB and other subtypes of epidermolysis bullosa.”\nDr. Braunstein commented, “Aegle is at the forefront of advancing extracellular vesicle-based therapies which have exciting potential across a broad spectrum of refractory dermatological disorders. I look forward to working with Shelley and the management team to advance their current mission of offering patients and their families a novel and simple biological solution for the treatment of EB.”\nScott Braunstein, M.D.\nScott Braunstein, M.D., brings over 30 years of knowledge and experience from diverse biotechnology and pharmaceutical industry vantage points. Dr. Braunstein served as President and Chief Executive Officer of Marinus Pharmaceuticals, Inc., a company focused on rare forms of epilepsy, until acquired by Immedica Pharma AB. Prior to that, he served as Senior Vice President, Strategy and Chief Operating Officer at Pacira Pharmaceuticals, Inc., a specialty pharmaceutical company. Prior to Pacira, Dr. Braunstein spent 12 years with J.P. Morgan Asset Management as a Managing Director, Healthcare Analyst and the Portfolio Manager of the JP Morgan Global Healthcare Fund.\nDr. Braunstein has been an operating partner at Aisling Capital since 2015. He currently serves on the board of directors for atai Life Sciences N.V., Caribou Biosciences, Inc., RAPT Therapeutics and Site One Therapeutics, a clinical-stage neurology company that is being acquired by Eli Lilly. Dr. Braunstein previously served on the board of directors of Trevena Inc., Esperion Therapeutics, Inc., Ziopharm Oncology Inc., Protara Therapeutics, Inc. (previously known as ArTara Therapeutics, Inc.) and Constellation Pharmaceuticals, Inc.\nDr. Braunstein began his career as a practicing physician at the Summit Medical Group and as an Assistant Clinical Professor at Albert Einstein College of Medicine and Columbia University Medical Center. Dr. Braunstein received an M.D. from the Albert Einstein College of Medicine and a BASc in biology from Cornell University.\nAbout AGLE-102™\nAGLE-102 is a composite of extracellular vesicles isolated from allogeneic mesenchymal stem cells using Aegle's proprietary methods. The product is a composite of native EVs and their associated complex assemblies of biologic molecules such as proteins, peptides, ligands and nucleic acids that induce a wide variety of biological effects in recipient cells, including reducing inflammation, modulating the immune system and promoting regenerative healing.\nAbout Aegle Therapeutics Corporation\nAegle Therapeutics is a clinical-stage dermatology-focused biopharmaceutical company developing novel EV therapies to treat rare and severe dermatological disorders with significant unmet medical need.  The company’s lead product candidate, AGLE-102, is currently in a phase 1/2a study for the treatment of recessive dystrophic epidermolysis bullosa and has successfully completed a proof-of-concept study in severe burns. AGLE-102 has the potential to treat all subtypes of epidermolysis bullosa as well as a broad range of other dermatological indications characterized by inflammation resulting from an underlying immune imbalance. For more information about Aegle Therapeutics, please visit\nwww.aegletherapeutics.com\n.\nFor More Information Contact:\ninfo@aegletherapeutics.com\nTags\nbiotechnology\nepidermolysis bullosa\nRelated Links\nhttps://aegletherapeutics.com/"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces $50 Million Private Placement Financing",
    "link": "https://www.globenewswire.com/news-release/2025/07/01/3108170/0/en/atai-Life-Sciences-Announces-50-Million-Private-Placement-Financing.html",
    "date": "July 01, 2025 06:05 ET",
    "text": "atai Life Sciences Announces $50 Million Private Placement Financing\nFinancing co-led by Ferring Ventures S.A. and Apeiron Investment Ltd. with participation from new and existing healthcare-focused institutional investors, including Ally Bridge Group and ADAR1\nJuly 01, 2025 06:05 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nNEW YORK and AMSTERDAM, July  01, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, today announced it had entered into subscription agreements relating to the purchase of 18,264,840 ordinary shares of atai with a nominal value of €0.10 per share (“Common Shares”) and pre-funded warrant to purchase 4,566,210 Common Shares (the “Pre-Funded Warrant”). The financing is expected to result in gross proceeds of approximately $50 million, before deducting placement agents’ fees and other expenses. The net proceeds from the financing are expected to be used by atai for general corporate purposes, including for working capital and to advance the clinical development of the Company’s product candidates and programs. The private placement is subject to certain closing conditions, including the expiration of the waiting period pursuant to the Hart-Scott-Rodino Antitrust Improvements Act of 1976 (the “HSR Act”) related to the filing expected to be made by Christian Angermayer in connection with Apeiron’s investment in this financing. The financing is expected to close in the third quarter of 2025.\nThe financing was co-led by Ferring Ventures S.A. and Apeiron Investment Group, the family office of atai Founder and Chairman Christian Angermayer, with participation from new and existing healthcare-focused institutional investors, including Ally Bridge Group and ADAR1.\nMr. Angermayer commented:\n“With this financing, atai is well-positioned to accelerate its efforts and achieve its goal of delivering new therapeutic options for individuals facing serious mental health challenges. We are confident that these trial results will support a robust discussion with the FDA and allow us have a clear Phase 3 plan early in 2026. I am especially grateful for the repeated support of Ferring Ventures. Their deep understanding of commercialization, market dynamics, and how to build and run effective sales teams is invaluable for atai as it prepares to transform from a clinical-stage biotech into a fully integrated commercial company over time”.\nJean-Frederic Paulsen, Chairman, Ferring Ventures S.A., added\n: “Psychedelics have demonstrated remarkable potential as a transformative class of treatments for a range of mental health conditions. atai has consistently led innovation and progress in this space, and I am pleased to expand our investment to support atai in pioneering the next generation of mental health treatments.”\nTD Cowen, Leerink Partners, Guggenheim Securities and Berenberg are acting as joint-lead placement agents for the private placement.\nThe securities being issued and sold in the private placement have not been registered under the Securities Act of 1933, as amended (the “Securities Act”), or any state’s securities laws, and will be issued and sold in a private placement in reliance on Section 4(a)(2) of the Securities Act. The securities may not be offered or sold in the United States, except pursuant to an effective registration statement or an applicable exemption from the registration requirements of the Securities Act. atai granted registration rights to the purchasers in the private placement, and has agreed to file a registration statement with the Securities and Exchange Commission (the “SEC”) registering the resale of the common shares issued in the private placement and the Common Shares issuable upon exercise of the Pre-Funded Warrants issued in the private placement. The offer and sale of the Common Shares underlying the Pre-Funded Warrant have not been registered under the Securities Act.\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy any securities described herein, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. atai’s pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. It is also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychiatry therapies that can integrate seamlessly into healthcare systems.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “anticipate,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. Forward-looking statements include express or implied statements relating to, among other things, expectations regarding the closing of the private placement financing including satisfaction and timing of closing conditions, including the closing conditions relating to the HSR Act filing, and expectations regarding the use of proceeds from the proposed financing. Forward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including important factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the SEC, as such factors may be updated from time to time in atai’s other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.com\natai Media Contact:\nPR@atai.com"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences and Beckley Psytech Announce Positive Topline Results from the Phase 2b Study of BPL-003 in Patients with Treatment-Resistant Depression",
    "link": "https://www.globenewswire.com/news-release/2025/07/01/3108164/0/en/atai-Life-Sciences-and-Beckley-Psytech-Announce-Positive-Topline-Results-from-the-Phase-2b-Study-of-BPL-003-in-Patients-with-Treatment-Resistant-Depression.html",
    "date": "July 01, 2025 06:00 ET",
    "text": "atai Life Sciences and Beckley Psytech Announce Positive Topline Results from the Phase 2b Study of BPL-003 in Patients with Treatment-Resistant Depression\nJuly 01, 2025 06:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nStudy met its primary and all key secondary endpoints, and BPL-003 demonstrated rapid, robust and durable antidepressant effects with a single dose\nBoth 8 mg and 12 mg single doses of BPL-003 showed statistically significant and clinically meaningful reductions in depressive symptoms at all time points of the study compared to a 0.3 mg low-dose active control out to Week 8\nBPL-003 was generally well-tolerated at all doses, with 99% of treatment-emergent adverse events being mild or moderate, and no drug-related serious adverse events or suicide-related safety signals\nMajority of patients deemed ready for discharge at the 90 minutes post-dose assessment, which suggests BPL-003 could fit within the existing 2-hour in-clinic interventional psychiatry treatment paradigm established by Spravato\n®\nThe Phase 2b study is the largest ever controlled study of mebufotenin (n=193) and the only blinded Phase 2 study of mebufotenin to include the United States\nSafety and efficacy data support the selection of the 8 mg dose to advance into Phase 3 clinical development, pending consultation with regulatory authorities\nStrategic combination between atai Life Sciences and Beckley Psytech to create a global leader in short time in-clinic psychedelic-based mental health therapies is expected to progress to shareholder approval stage\nConference call scheduled for 8:00am EDT today, July 1, 2025\nNEW YORK, and AMSTERDAM and OXFORD, United Kingdom, July  01, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, and\nBeckley Psytech Limited\n(“Beckley Psytech”), a private clinical-stage biopharmaceutical company pioneering the next generation of mental health treatments, today jointly announced positive topline results from the eight-week, quadruple-masked, dose-finding, core stage of the Phase 2b clinical trial evaluating the efficacy and safety of a single dose of BPL-003 (intranasal mebufotenin (5-MeO-DMT) benzoate) in patients with treatment-resistant depression (TRD). The study achieved its primary endpoint as well as all key secondary endpoints. At Day 29, a single 12 mg dose of BPL-003 demonstrated a statistically significant reduction in depressive symptoms, as measured by the Montgomery-Åsberg Depression Rating Scale (MADRS), with a mean decrease of 11.1 points from baseline compared to a 5.8 point reduction in the 0.3 mg comparator group (p = 0.0038). For the key secondary efficacy endpoints, a single 8 mg dose of BPL-003 also showed significant improvement at Day 29, with a mean MADRS score reduction of 12.1 points (p=0.0025 for change vs. 0.3 mg control). Notably, both the 8mg and 12mg doses of BPL-003 showed statistically significant improvements in MADRS scores as early as one day after dosing, with effects generally maintained out to Week 8.\nSafety and efficacy results from this study support the selection of the 8 mg dose of BPL-003 for advancement into Phase 3 clinical studies. atai and Beckley Psytech plan to engage with the U.S. Food and Drug Administration (FDA) and other applicable agencies regarding the Phase 3 trial design for patients with treatment-resistant depression in the coming months.\nWith these positive Phase 2b results, the pre-agreed success criteria for the proposed strategic combination between atai and Beckley Psytech, which was\nannounced in June 2025,\nhas been achieved and the strategic combination is now expected to progress to atai shareholder approval stage. The atai Beckley combination is expected to create a global leader in short time in-clinic psychedelic-based mental health therapies.\nCosmo Feilding Mellen, Chief Executive Officer and Co-Founder of Beckley Psytech, said\n:\n“The achievement of our primary and secondary endpoints in this study represents an important milestone in the development of BPL-003 and reinforces its potential to be a viable treatment option for patients and healthcare systems. We are particularly encouraged that a single 8 mg or 12 mg dose of BPL-003 showed rapid and durable efficacy results, favourable tolerability and a short time in-clinic, giving us important flexibility in optimising the design of future trials. Thank you to all of the patients and study partners who participated in this study - we now look forward to preparing for end-of-Phase 2 meetings with regulators and moving forward with our strategic combination with atai Life Sciences to form atai Beckley, a global leader in psychedelic-based mental health treatments.”\nThe Phase 2b clinical study was conducted at 38 sites across six countries and enrolled a total of 193 patients with moderate-to-severe TRD (defined as non-response to two or more prior treatments in the current depressive episode) (\nNCT05870540\n). It is the largest controlled clinical study to investigate mebufotenin and the only blinded Phase 2b study of mebufotenin to include the United States. Patients were randomized to receive a single 12 mg (n=73), 8 mg (n=46), or 0.3 mg comparator (n=74) dose of BPL-003 and were followed for eight weeks with efficacy assessments conducted by centralised, blinded raters using the MADRS at Day 2, Day 8, Day 29 and Day 57.\nKey efficacy findings:\nA single 12 mg dose of BPL-003 led to a mean reduction in MADRS score from baseline of 11.1 points compared with 5.8 points in the 0.3 mg comparator arm (p=0.0038) at Day 29, with the 8 mg dose arm showing a mean MADRS reduction from baseline of 12.1 points versus the 0.3mg comparator arm (p=0.0025) at that same timepoint.\nThe 8 mg and 12 mg doses of BPL-003 demonstrated equivalent efficacy suggesting the 8 mg dose may be sufficient to achieve therapeutic benefit from a single dose.\nThe difference in MADRS scores between the 8 mg and 12 mg doses versus the 0.3 mg dose were statistically significant in both active arms from as early as Day 2, with mean MADRS reductions from baseline of 8.8 points in the 8 mg group and 8.9 points in the 12 mg group observed at that timepoint, compared to a reduction from baseline of 3.9 points in the 0.3 mg group. These mean reductions from baseline increased to 11.1 points in the 8 mg group and 10.8 points in the 12 mg group at Day 8.\nA durable effect was also observed for both higher doses, with the 8 mg group showing a mean reduction of 10.8 points from baseline at Day 57 and the 12 mg group showing a mean reduction of 10.2 points from baseline compared with the 0.3 mg group (5.2 point reduction). These findings highlight the potential of BPL-003 to be a durable treatment for patients with TRD.\nKey safety findings:\nBPL-003 was generally well-tolerated at all doses. More than 99% of treatment-emergent adverse events (TEAEs) were mild or moderate and there were no drug-related serious adverse events (SAEs).\nDose related increases in administration site discomfort, nausea, headache, blood pressure and anxiety suggest the 8mg dose was better tolerated than the 12mg dose.\nNo participants in the 8 mg nor 12 mg arms had any instance of treatment-emergent suicidal intent or behaviour, indicating no suicide-related safety signal observed to date.\nThe average time to meet readiness for discharge criteria across all arms was within two hours of dosing, with the majority of patients deemed ready for discharge at the 90 minutes post-dose assessment. This, alongside the administration of BPL-003 via a previously approved nasal spray device, supports the potential of BPL-003 to fit within the existing interventional psychiatry treatment paradigm that has been successfully established by Spravato\n®\n.\nThe study had a low drop-out rate with 90% of patients completing the core study.\nThese findings suggest a favourable tolerability profile which are consistent with earlier Phase 1 and Phase 2a studies of BPL-003, as well as other psychedelic studies within the class.\nAdditional data from the core study is expected to be shared through publications and medical meetings in the future.\nDr David Feifel,\nProfessor Emeritus of Psychiatry at the University of California, San Diego and Director of the Kadima Neuropsychiatry Institute\nsaid:\n“\nWhat stands out in these results is that a single administration of BPL-003 in patients with treatment-resistant depression was generally well tolerated and produced a robust antidepressant effect that emerged rapidly and was solidly sustained for at least two months. Notably, the acute psychedelic effects were shorter than with most other psychedelics studied clinically, suggesting potential for a quicker functional recovery for patients and a reduced need for prolonged monitoring. If a treatment with this profile were available today, it would immediately become my treatment of choice for TRD.”\nFollow-up in the eight-week open-label extension (OLE) stage of the study is ongoing. The OLE study is designed to evaluate the safety and efficacy of a second 12 mg dose of BPL-003 administered to patients eight weeks after dosing in the core study. 85% of eligible subjects from the core stage of the study have enrolled into the OLE. Data from the OLE study is expected in the third quarter of 2025 and will provide additional insights into the safety and tolerability of repeat dosing, as well as the durability of BPL-003’s antidepressant effect.\nCommenting on the news, Srinivas Rao, Chief Executive Officer and Co-Founder of atai, said:\n“These findings strengthen our confidence in the potential of BPL-003 to be a transformative psychedelic therapy, offering rapid and durable antidepressive effects with minimal in-clinic time for patients with treatment-resistant depression. We look forward to engaging with the regulators later this year to advance this innovative treatment into Phase 3 clinical development.”\nConference Call\natai and Beckley Psytech will host a conference call and live webcast today Tuesday, July 1, 2025, 2025 at 8:00 a.m. EDT. The conference call can be accessed by dialling 1-800-715-9871 for participants in the U.S. and 1-646-307-1963 for international callers, with the Conference ID: 1459387. The webcast can be accessed on the Investors section of atai’s corporate website under\nEvents\n. The presentation and an archived replay of the webcast will be available in the same section of the website for a minimum of 30 days following the event.\nAbout BPL-003\nBPL-003 is Beckley Psytech’s patent-protected, proprietary intranasal formulation of mebufotenin benzoate, administered via a nasal spray device used in a previously approved drug product. BPL-003 is designed to deliver rapid and durable effects from a single dose, with a short time in the clinic, and is being investigated as a potential therapy for treatment-resistant depression (TRD) and for alcohol use disorder (AUD). BPL-003 is covered by granted US, UK and European composition-of-matter patents, with multiple further claims pending in various jurisdictions.\nAbout treatment-resistant depression\nDepression is a debilitating and life-changing condition affecting nearly\n300 million people\nacross the globe, with around\n52 million people\naffected by the condition in Europe and the US combined. Treatment-resistant depression occurs when an individual does not respond to two or more courses of antidepressants and some studies show that it may affect up to\n50% of those living with depression\n, meaning there is a significant unmet need for more effective treatments.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. atai’s pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. It is also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychiatry therapies that can integrate seamlessly into healthcare systems. For the latest updates and to learn more about atai’s mission, visit\nwww.atai.com\nor follow the Company on\nLinkedIn\nand on\nX\n.\nAbout Beckley Psytech\nBeckley Psytech Ltd is a private biopharmaceutical company dedicated to improving the lives of people living with neuropsychiatric disorders by developing rapid-acting psychedelic medicines. Founded in 2019, and underpinned by more than two decades of pioneering scientific research from the Beckley Foundation, Beckley Psytech combines world-leading psychedelic science with extensive drug development expertise in order to optimise patient outcomes, improve treatment opportunities and ease the burden neuropsychiatric conditions have on individuals, healthcare systems and society. For more information about Beckley Psytech, visit\nwww.beckleypsytech.com\nor follow the Company on\nLinkedIn\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “anticipate,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. Forward-looking statements include express or implied statements relating to, among other things: expectations regarding the closing of the acquisition of Beckley Psytech Limited (the “Proposed Transaction”), including timing and approvals; expectations regarding operations of the combined company, including strategic value of the clinical development programs for patients and shareholders as well as expectations regarding financial synergies; timing and results of Beckley Psytech’s BPL-003 Phase 2b trial and related data readouts; expectations regarding Beckley Psytech’s other clinical assets, including ELE-101; our business strategy and plans; and the potential, success, cost and timing of development of our product candidates, and the product candidates of those companies we invest in.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, (i) the Proposed Transaction may not be completed in a timely manner or at all, including the risk that any required shareholder approvals are not obtained; (ii) the failure to realize the anticipated benefits of the Proposed Transaction; (iii) the possibility that any or all of the various conditions to the consummation of the Proposed Transaction may not be satisfied or waived; (iv) the occurrence of any event, change or other circumstance that could give rise to the termination of the share purchase agreement; and (v) the effect of the announcement or pendency of the Proposed Transaction on atai’s ability to retain and hire key personnel, or its operating results and business generally and other important factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (the “SEC”), as such factors may be updated from time to time in atai’s other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nAdditional Information and Where to Find It\nThis press release is being made in respect of the Proposed Transaction. In connection with the Proposed Transaction, a registration statement on Form S-4 will be filed (the “Registration Statement”) which will include a proxy statement of the Company (the “Proxy Statement”), as well as other relevant documents regarding the Proposed Transaction. This press release is not a substitute for the Registration Statement, the Proxy Statement or any other document which the Company may file with the SEC. INVESTORS ARE URGED TO READ IN THEIR ENTIRETY THE REGISTRATION STATEMENT, INCLUDING THE PROXY STATEMENT REGARDING THE PROPOSED TRANSACTION, WHEN IT BECOMES AVAILABLE AND ANY OTHER RELEVANT DOCUMENTS FILED WITH THE SEC, AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THOSE DOCUMENTS, BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION.\nA free copy of the Registration Statement, including the Proxy Statement, as well as other filings containing information about the Company, when such documents become available, may be obtained at the SEC’s website (\nhttp://www.sec.gov\n).\nParticipants in the Solicitation\nThe Company and its directors and executive officers may be deemed to be participants in the solicitation of proxies from its shareholders in respect of the proposed transactions contemplated by the Registration Statement, including the Proxy Statement. Information regarding the persons who are, under the rules of the SEC, participants in the solicitation of the shareholders of the Company in connection with the proposed transactions, including a description of their direct or indirect interests, by security holdings or otherwise, will be set forth in the Registration Statement, including the Proxy Statement, when it is filed with the SEC. Information regarding the Company’s directors and executive officers is contained in its Annual Report on Form 10-K for the year ended December 31, 2024 and its proxy statement on Schedule 14A, dated April 21, 2025, which are filed with the SEC.\nContact Information\nInvestor Contact:\nIR@atai.com\natai Media Contact:\nPR@atai.com\nBeckley Psytech Media Contact:\ncharlotte.chorley@beckleypsytech.com"
  },
  {
    "ticker": "ATAI",
    "title": "RAPT Therapeutics Names Two Industry Veterans to its Board of Directors",
    "link": "https://www.globenewswire.com/news-release/2025/06/23/3103308/0/en/RAPT-Therapeutics-Names-Two-Industry-Veterans-to-its-Board-of-Directors.html",
    "date": "June 23, 2025 08:00 ET",
    "text": "RAPT Therapeutics Names Two Industry Veterans to its Board of Directors\nJune 23, 2025 08:00 ET\n| Source:\nRAPT Therapeutics, Inc.\nFollow\nRAPT Therapeutics, Inc.\nShare\nSOUTH SAN FRANCISCO, Calif., June  23, 2025  (GLOBE NEWSWIRE) -- RAPT Therapeutics, Inc. (Nasdaq: RAPT), a clinical-stage immunology-based biopharmaceutical company focused on discovering, developing and commercializing novel therapies for patients living with inflammatory and immunological diseases, today announced the appointment of Scott Braunstein, M.D., and Ashley Dombkowski, Ph.D., to its board of directors. Dr. Braunstein was appointed as a member of the Audit Committee of the Board and Dr. Dombkowski was appointed as a member of the Nominating and Corporate Governance Committee of the Board. The company’s lead product candidate RPT904, is a novel, half-life extended monoclonal antibody designed to bind free human immunoglobin E (“IgE”), a key driver of several allergic diseases. RPT904 is currently completing Phase 2 trials in chronic spontaneous urticaria and asthma, and RAPT plans to initiate a Phase 2 clinical trial for food allergy later this year.\n“We are excited to welcome Dr. Braunstein and Dr. Dombkowski to our board of directors at this pivotal time and look forward to their guidance as we pursue innovative products for patients with inflammatory and immunologic diseases,” said Brian Wong, M.D., Ph.D., President and CEO of RAPT. “Both have extensive industry experience and knowledge that will support our organization as we advance clinical development of RPT904 in food allergy, CSU and potentially other allergic diseases, while also preparing for commercialization in these large, underserved markets.”\nDr. Braunstein commented, “RAPT is at a critical point with an attractive product candidate entering late-stage development. I look forward to helping Brian and the management team capitalize on the tremendous opportunities to bring RPT904 to patients and to grow their I&I pipeline.”\n“I was particularly intrigued by the pipeline-in-a-product potential of RPT904,” added Dr. Dombkowski. “Food allergy is a large, underserved market with unmet need, and RPT904 has real potential to provide an innovative treatment to meet this need. RAPT will have opportunities to also develop RPT904 in CSU and potentially other allergic diseases, and I am excited to help build this company.”\nScott Braunstein, M.D.\nScott Braunstein, M.D., brings over 30 years of knowledge and experience from diverse biotechnology and pharmaceutical industry vantage points. He has been an operating partner at Aisling Capital since 2015. Until March 2025, Dr. Braunstein served as President and Chief Executive Officer as well as board member of Marinus Pharmaceuticals, Inc., a neurology therapeutics company acquired by Immedica Pharma AB. Prior to that, he served as Senior Vice President, Strategy and Chief Operating Officer at Pacira Pharmaceuticals, Inc., a specialty pharmaceutical company. Prior to Pacira, Dr. Braunstein spent 12 years with J.P. Morgan Asset Management as a Healthcare Analyst and Managing Director and as Portfolio Manager of the JP Morgan Global Healthcare Fund. He currently serves on the board of directors for atai Life Sciences N.V., a clinical-stage biopharmaceutical company, Caribou Biosciences, Inc., a clinical-stage CRISPR genome-editing biopharmaceutical company, and Site One Therapeutics, a clinical-stage neurology company that is being acquired by Eli Lilly. Dr. Braunstein previously served on the board of directors of Trevena Inc., Esperion Therapeutics, Inc., Ziopharm Oncology Inc., Protara Therapeutics, Inc. (previously known as ArTara Therapeutics, Inc.) and Constellation Pharmaceuticals, Inc. Dr. Braunstein began his career as a practicing physician at the Summit Medical Group and as an Assistant Clinical Professor at Albert Einstein College of Medicine and Columbia University Medical Center. Dr. Braunstein received an M.D. from the Albert Einstein College of Medicine and a BASc in biology from Cornell University.\nAshley Dombkowski, Ph.D.\nAshley Dombkowski, Ph.D., has more than 20 years of experience as an operating executive, entrepreneur and investor. She is currently CEO and President of Cellics Therapeutics, a biotechnology company developing novel biologics to address significant unmet medical needs in inflammation and immunology. Prior to Cellics, she served as CEO and Co-founder of Alladapt Immunotherapeutics, a biopharmaceutical company that developed prescription therapies to treat food allergy; she was CEO and Co-founder of SpoonfulOne, a company focused on early allergen introduction; and was CEO and Co-founder of Before Brands, Inc., a company focused on innovative nutritional products. Dr. Dombkowski also served as Chief Business Officer and Vice President of Operations for 23andMe. She spent 15 years as a Managing Director at venture capital firms MPM Capital and Bay City Capital, and earlier in her career was an Equity Analyst for Tiger Management L.L.C. and for Dresdner RCM Global Investors. Dr. Dombkowski holds a Ph.D. in mathematics from Rice University and received her B.A. in mathematics from Wellesley College.\nAbout RAPT Therapeutics, Inc.\nRAPT is a clinical-stage immunology-based biopharmaceutical company focused on discovering, developing and commercializing novel therapies for patients living with inflammatory and immunological diseases. Utilizing our deep and proprietary expertise in immunology, we develop novel therapies that are designed to modulate the critical immune responses underlying these diseases.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as “anticipate,” “estimates,” “expects,” “look forward,” “planned,” “potential” “will” and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances) are intended to identify forward-looking statements. These statements relate to future events and involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from any future performances or achievements expressed or implied by the forward-looking statements. Each of these statements is based only on current information, assumptions and expectations that are inherently subject to change and involve a number of risks and uncertainties. Forward-looking statements include, but are not limited to, statements about the therapeutic potential of RPT904, the timing of the initiation of or data from clinical trials, the market opportunity for RPT904, and other statements that are not historical fact. Many factors may cause differences between current expectations and actual results, including unexpected or unfavorable safety or efficacy data observed during clinical studies, preliminary data and trends that may not be predictive of future data or results or that may not demonstrate safety or efficacy or lead to regulatory approval, our reliance on our partners and other third parties, clinical trial site activation or enrollment rates that are lower than expected, unanticipated or greater than anticipated impacts or delays due to macroeconomic and geopolitical conditions (including the long-term impacts of ongoing overseas conflicts, tariffs and trade tensions, fluctuations in inflation and interest rates and other economic uncertainty), changes in expected or existing competition, changes in the regulatory environment, the uncertainties and timing of the regulatory approval process and the sufficiency of RAPT’s cash resources. Detailed information regarding risk factors that may cause actual results to differ materially from the results expressed or implied by statements in this press release may be found in RAPT’s Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission on May 8, 2025 and subsequent filings made by RAPT with the Securities and Exchange Commission. These forward-looking statements speak only as of the date hereof. RAPT disclaims any obligation to update these forward-looking statements, except as required by law.\nRAPT Investor Contact:\nSylvia Wheeler\nswheeler@wheelhouselsa.com\nRAPT Media Contact:\nAljanae Reynolds\nareynolds@wheelhouselsa.com"
  },
  {
    "ticker": "ATAI",
    "title": "IntelGenx Announces Rebranding to Nualtis, Signaling Strategic Evolution and Renewed Vision",
    "link": "https://www.globenewswire.com/news-release/2025/06/11/3097527/0/en/IntelGenx-Announces-Rebranding-to-Nualtis-Signaling-Strategic-Evolution-and-Renewed-Vision.html",
    "date": "June 11, 2025 08:28 ET",
    "text": "IntelGenx Announces Rebranding to Nualtis, Signaling Strategic Evolution and Renewed Vision\nJune 11, 2025 08:28 ET\n| Source:\nIntelGenx Corp.\nFollow\nIntelGenx Corp.\nShare\nMONTREAL, June  11, 2025  (GLOBE NEWSWIRE) -- IntelGenx, a leader in oral thin film drug delivery, today announced its official rebrand to Nualtis, marking a pivotal step in the company’s transformation and long-term strategic vision.\nThe name Nualtis blends “Nu,” symbolizing renewal, with “altis,” derived from Latin for “high” or “elevated.” Together, they represent the company’s ambition to reach new heights in pharmaceutical innovation, agility, and impact.\n“This new identity captures the evolution of our company,” said Dr. Michael Raven, Chief Executive Officer of Nualtis. “It is a renewed commitment to scientific excellence, strategic execution, and financial stability as we deepen partnerships and advance our platform of proprietary oral film technologies.”\nOver the past year, the company has restructured, upgraded its operations and facilities, as well as expanded key alliances. As Nualtis, the organization is positioned to deliver great value to partners through lifecycle extension, accelerated development timelines, and differentiated drug delivery.\nThe rebranding initiative includes a new visual identity, updated digital presence, and a refined communication strategy to align with the company’s future-focused direction.\nThe transition to Nualtis is effective immediately. Legal documents, domain names, and all corporate materials will be updated over the next months. Existing partnerships and operations will continue without disruption.\nAbout Nualtis\nNualtis is a specialty pharmaceutical company advancing innovative drug delivery technologies with a focus on oral thin films. Building on more than a decade of formulation and manufacturing expertise, Nualtis supports pharmaceutical partners in extending product lifecycles and accelerating development timelines. Headquartered in Montreal, the company offers a fully integrated platform that includes research and development, analytical services, regulatory support, and scalable manufacturing from lab to market. With a patient centered approach and a focus on execution excellence, Nualtis delivers smart solutions that meet real world therapeutic needs. Nualtis is a wholly owned subsidiary of atai Life Sciences. For more information, visit\nwww.nualtis.com\nor connect with us on\nLinkedIn\nand\nX\n.\nNualtis Forward-Looking Statements\nThis press release contains forward-looking information under applicable securities law. All information that addresses activities or developments that we expect to occur in the future is forward-looking information. Forward-looking statements use such word as “will”, “may”, “potential”, “believe”, “expect”, “continue”, “anticipate” and other similar terminology. Forward-looking statements are based on the estimates and opinions of management on the date the statements are made. However, they should not be regarded as a representation that any of the plans will be achieved. Actual results may differ materially from those set forth in this press release due to risks affecting the Company. Nualtis assumes no responsibility to update forward-looking statements in this press release except as required by law. These forward-looking statements involve known and unknown risks and uncertainties. Investors are cautioned not to rely on these forward-looking statements and are encouraged to read the company’s continuous disclosure documents.\nSource: IntelGenx Corp.\nFor Nualtis:\nTommy Kenny\nBusiness Development Lead & General Counsel\n(438) 803-0954\nTommy@Nualtis.com\nRelated Links\nNualtis.com"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences and Beckley Psytech to Combine Creating a Global Leader in Psychedelic Mental Health Therapies",
    "link": "https://www.globenewswire.com/news-release/2025/06/02/3091657/0/en/atai-Life-Sciences-and-Beckley-Psytech-to-Combine-Creating-a-Global-Leader-in-Psychedelic-Mental-Health-Therapies.html",
    "date": "June 02, 2025 06:00 ET",
    "text": "atai Life Sciences and Beckley Psytech to Combine Creating a Global Leader in Psychedelic Mental Health Therapies\nJune 02, 2025 06:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nStrategic combination establishes a market-leading mental health company with a pipeline that includes potentially transformative, rapid-acting psychedelic assets differentiated by their convenient route of administration and short time-in-clinic\nCombined company will operate under the name atai Beckley with a joint leadership team and Board that leverage the deep psychedelic, drug development and CNS expertise within both organizations\nTopline data from the Phase 2b study of BPL-003 in patients with treatment-resistant depression (TRD) is expected in mid-2025 - the largest controlled trial of mebufotenin (5-MeO-DMT) and the first and only controlled trial to investigate mebufotenin in the U.S.\nThe all-share transaction is expected to close in the second half of 2025\nConcurrent $30.0M private placement by Ferring Ventures S.A. and Adage Capital Partners LP\nConference call scheduled for 8:00am EDT today\nNEW YORK and BERLIN and OXFORD, United Kingdom, June  02, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, and\nBeckley Psytech Limited\n(“Beckley”), a private clinical-stage biopharmaceutical company pioneering the next generation of mental health treatments, today announced a definitive agreement under which atai and Beckley plan to combine in an all-share transaction subject to pre-agreed BPL-003 (mebufotenin benzoate) Phase 2b success criteria.\n“The strategic combination marks a transformational moment, solidifying us as a leader in rapid-acting and accessible psychedelic treatments for mental health conditions with a pipeline of potential first-in-class and best-in-class assets,” stated Srinivas Rao, M.D., Ph.D., Chief Executive Officer and Co-Founder of atai. “With a unified vision and a synergistic pipeline, we believe we are well-positioned to unlock the strategic value of our clinical development programs for both patients and shareholders. Together, we plan to move confidently towards our goal of bringing innovative interventional psychiatry therapies to patients in need of new treatments.”\nCosmo Feilding Mellen, Chief Executive Officer and Co-Founder of Beckley added, “This combination brings together two highly complementary pipelines to create a market leader at the forefront of psychiatric care. Clinical data has shown the rapid and durable effects of our compounds, as well as their potential to fit within the existing treatment paradigm established by SPRAVATO\n®\n. We believe that the unified business will be even better positioned to accelerate development, drive long-term value for shareholders, and - most importantly - deliver meaningful innovation for patients.”\n“This transaction marks a pivotal milestone in delivering on the strategic vision we set forth from the start of atai in 2018: to be the leader in the psychedelic space,” added Christian Angermayer, Co-Founder and Chairman of atai. “I am also very pleased to announce the concurrent financing with existing investors from both companies. The continued support from Ferring Ventures, a valued investor in atai, and Adage Capital, a longstanding investor in Beckley, further validates the strength and potential of this combination.”\nTransaction Benefits\nMarket-Leading Pipeline:\natai Beckley will boast a synergistic fully owned pipeline that includes proprietary, rapid-acting psychedelic compounds differentiated by their convenient route of administration and short time-in-clinic.\nNear-Term Clinical Milestones:\nTopline data from the eight-week, randomized core stage of Beckley’s BPL-003 Phase 2b trial in treatment-resistant depression (NCT05870540) is expected in mid-2025, representing a potentially significant value inflection point. The study builds on previously reported open-label results which demonstrated that a single dose of BPL-003, when given as a\nmonotherapy\nor\nalongside SSRIs\n, was well-tolerated and could produce a rapid and lasting antidepressant effect for up to three months.\nFinancial Synergies and Strong IP Portfolio\n:\nCash runway through multiple Phase 2 clinical catalysts, near and long-term operational synergies, as well as a strong IP portfolio with granted U.S. patents out to 2043.\nUnified Vision and Team:\nThe new entity is expected to leverage the expertise, teams, and networks of both organizations to accelerate the development and commercialization of transformative mental health treatments.\nTransaction Terms\natai made a strategic investment in Beckley in January 2024. Under the terms of the deal, Beckley’s shareholders (other than atai) will be issued approximately 105 million new shares as consideration for the remaining shares of Beckley not presently held by atai. These newly issued shares equate to approximately 31% of the combined company on a fully diluted basis, based on the treasury stock method, upon closing of the transaction and the concurrent private placement, and value Beckley at approximately $390 million.\nThese newly issued atai shares are subject to a lock-up wherein, following the completion of the lock-up period, 1/12 of the shares are released every month. Additionally, Apeiron Investment Group, the family office of Mr. Angermayer, voluntarily entered into a similar lock-up agreement covering all of its shares in atai.\nBeckley also intends to distribute Eleusis Holdings Limited and its subsidiaries, which hold assets and funding related to its second clinical-stage asset, ELE-101, out of Beckley prior to closing of the transaction.\nTiming and Approvals\natai’s Supervisory Board and Management Board and Beckley’s Board of Directors have approved the transaction.\nThe transaction is expected to close in the second half of 2025, subject to approval of the share issuance by the shareholders of atai and satisfaction of other customary closing conditions.\nConcurrent Financing\nConcurrent with the transaction, atai also executed a $30.0 million private placement with Ferring Ventures S.A. and Adage Capital Partners LP. This financing is not contingent on closing of the transaction. The private placement is expected to close on June 3, 2025, subject to customary closing conditions.\nThe securities being issued and sold in the private placement have not been registered under the Securities Act of 1933, as amended (the “Securities Act”), or any state’s securities laws, and will be issued and sold in a private placement in reliance on Section 4(a)(2) of the Securities Act. The securities may not be offered or sold in the United States, except pursuant to an effective registration statement or an applicable exemption from the registration requirements of the Securities Act. atai granted registration rights to the purchasers in the private placement, and has agreed to file a registration statement with the Securities and Exchange Commission (the “SEC”) registering the resale of the common shares issued in the private placement and the shares of common stock issuable upon exercise of the pre-funded warrants issued in the private placement.\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy any securities described herein, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nConference Call\natai and Beckley will host a conference call and live webcast today Monday, June 2, 2025 at 8:00 a.m. EDT. The conference call can be accessed by dialing 1-800-715-9871 for participants in the U.S. and 1-646-307-1963 for international callers, with the Conference ID: 1459387. The webcast can be accessed on the Investors section of atai’s corporate website under\nEvents\n. The presentation and an archived replay of the webcast will be available in the same section of the website for a minimum of 30 days following the event.\nAdvisors\nGuggenheim Securities is serving as financial advisor to atai and Latham & Watkins LLP is serving as its legal counsel. Cantor is serving as financial advisor to Beckley, and CMS and Mayer Brown are serving as its legal counsel.\nGuggenheim Securities is acting as the lead placement agent for the private placement. Berenberg is acting as joint-lead placement agent for the private placement.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. atai’s pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. They are also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychiatry therapies that can integrate seamlessly into healthcare systems. For the latest updates and to learn more about atai’s mission, visit\nwww.atai.com\nor follow the Company on\nLinkedIn\nand on\nX\n.\nAbout Beckley Psytech\nBeckley Psytech Ltd is a private biopharmaceutical company dedicated to improving the lives of people living with neuropsychiatric disorders by developing rapid-acting psychedelic medicines. Founded in 2019, and underpinned by more than two decades of pioneering scientific research from the Beckley Foundation, Beckley Psytech combines world-leading psychedelic science with extensive drug development expertise in order to optimise patient outcomes, improve treatment opportunities and ease the burden neuropsychiatric conditions have on individuals, healthcare systems and society. For more information about Beckley Psytech, visit\nwww.beckleypsytech.com\nor follow the Company on\nLinkedIn\n.\nAbout BPL-003\nBPL-003 is Beckley Psytech’s patent-protected, proprietary intranasal formulation of mebufotenin benzoate, administered via a nasal spray device used in a previously approved drug product. BPL-003 is designed to deliver rapid and durable effects from a single dose, with a short time in the clinic, and is being investigated as a potential therapy for treatment resistant depression (TRD) and for alcohol use disorder (AUD). BPL-003 is covered by granted US, UK and European composition-of-matter patents, with multiple further claims pending in various jurisdictions.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “anticipate,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. Forward-looking statements include express or implied statements relating to, among other things: expectations regarding the closing of the transaction, including timing and approvals; expectations regarding operations of the combined company, including strategic value of the clinical development programs for patients and shareholders as well as expectations regarding financial synergies; timing and results of Beckley’s BPL-003 Phase 2b trial and related data readouts; expectations regarding Beckley’s other clinical assets, including ELE-101; expectations regarding the concurrent private placement, including related closing conditions; our business strategy and plans; and the potential, success, cost and timing of development of our product candidates, and the product candidates of those companies we invest in.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the important factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the SEC, as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nNo Offer or Solicitation\nThis communication is for information purposes only and is not intended to and does not constitute, or form part of, an offer, invitation or the solicitation of an offer or invitation to purchase, otherwise acquire, subscribe for, sell or otherwise dispose of any securities, or the solicitation of any vote or approval in any jurisdiction, pursuant to the proposed transaction or otherwise, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in contravention of applicable law.\nAdditional Information and Where to Find It\nThis press release is being made in respect of the proposed transaction between the Company and Beckley Psytech Limited. In connection with the proposed transaction, the Company will file with the SEC a proxy statement on Schedule 14A (the “Proxy Statement”), as well as other relevant documents regarding the proposed transaction. This press release is not a substitute for the Proxy Statement or any other document which the Company may file with the SEC. INVESTORS ARE URGED TO READ IN THEIR ENTIRETY THE PROXY STATEMENT REGARDING THE TRANSACTION WHEN IT BECOMES AVAILABLE AND ANY OTHER RELEVANT DOCUMENTS FILED WITH THE SEC, AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THOSE DOCUMENTS, BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION.\nA free copy of the Proxy Statement, as well as other filings containing information about the Company, when such documents become available, may be obtained at the SEC’s website (http://www.sec.gov).\nParticipants in the Solicitation\nThe Company and its directors and executive officers may be deemed to be participants in the solicitation of proxies from its shareholders in respect of the proposed transactions contemplated by the Proxy Statement. Information regarding the persons who are, under the rules of the SEC, participants in the solicitation of the shareholders of the Company in connection with the proposed transactions, including a description of their direct or indirect interests, by security holdings or otherwise, will be set forth in the Proxy Statement when it is filed with the SEC. Information regarding the Company’s directors and executive officers is contained in its Annual Report on Form 10-K for the year ended December 31, 2024 and its Proxy Statement on Schedule 14A, dated April 21, 2025, which are filed with the SEC.\nContact Information\nInvestor Contact:\nIR@atai.com\nMedia Contact:\nPR@atai.com\nBeckley media contact:\nCharlotte.Chorley@beckleypsytech.com"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences to Participate in Upcoming Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/05/29/3090320/0/en/atai-Life-Sciences-to-Participate-in-Upcoming-Investor-Conferences.html",
    "date": "May 29, 2025 08:30 ET",
    "text": "atai Life Sciences to Participate in Upcoming Investor Conferences\nMay 29, 2025 08:30 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nNEW YORK and BERLIN, May  29, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, today announced that the Company’s management team is scheduled to participate in the following investor conferences in June:\nJefferies Global Healthcare Conference\nFormat: Fireside Chat\nDate and Time: Thursday, June 5 at 9:55 A.M. EDT\nLocation: New York\nWebcast link:\nhere\nH.C. Wainwright 6th Annual Neuro Perspectives Hybrid Conference\nFormat: Pre-recorded Fireside Chat\nDate and Time: Tuesday, June 17 at 7:00 A.M. EDT\nLocation: Virtual\nWebcast link:\nhere\nThe webcasts of the fireside chats will also be available on the Investors section of the atai website under\nEvents\n. A replay will be available following the live event.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. Our pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. We are also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychiatry therapies that can integrate seamlessly into healthcare systems. For the latest updates and to learn more about our mission, visit\nwww.atai.com\nor follow us on\nLinkedIn\n.\nContact Information\nInvestor Contact:\nIR@atai.com\nMedia Contact:\nPR@atai.com"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces Positive Topline Data from Part 2 of Beckley Psytech’s Phase 2a Study of BPL-003 in Combination with SSRIs for Treatment-Resistant Depression",
    "link": "https://www.globenewswire.com/news-release/2025/05/20/3084684/0/en/atai-Life-Sciences-Announces-Positive-Topline-Data-from-Part-2-of-Beckley-Psytech-s-Phase-2a-Study-of-BPL-003-in-Combination-with-SSRIs-for-Treatment-Resistant-Depression.html",
    "date": "May 20, 2025 07:00 ET",
    "text": "atai Life Sciences Announces Positive Topline Data from Part 2 of Beckley Psytech’s Phase 2a Study of BPL-003 in Combination with SSRIs for Treatment-Resistant Depression\nMay 20, 2025 07:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\n- Positive results show that a single dose of BPL-003, administered adjunctively to SSRIs, produced a rapid and durable\nantidepressant effect for up to three months after dosing\n- BPL-003 was well-tolerated and patients were able to be discharged within an average time of less than two hours after dosing\n- Data from the eight-week core, randomized stage of Beckley Psytech’s Phase 2b study of BPL-003 for treatment-resistant depression is expected in mid-2025\nNEW YORK and BERLIN, May  20, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, today announced positive topline data from Part 2 of Beckley Psytech’s Phase 2a study (\nNCT05660642\n) of BPL-003 (mebufotenin benzoate), for treatment-resistant depression (TRD). The findings show that a single dose of BPL-003, when given to patients who were also taking defined selective serotonin reuptake inhibitors (SSRIs), was well-tolerated, with rapid and durable antidepressive effects of up to three months with an average in-clinic treatment time of less than two hours following dosing.\n“We’re very encouraged by the growing body of data supporting BPL-003 as a potentially differentiated and commercially scalable interventional psychiatric treatment for depression,” stated Srinivas Rao, M.D., Ph.D., Chief Executive Officer and Co-founder of atai. “Patients with treatment-resistant depression face limited options and these results show that a single dose of BPL-003 can deliver rapid and durable antidepressant effects when co-administered with an SSRI, extending the positive results observed in the Part 1 monotherapy study. Although a small, open-label study, the data validates the co-administration approach, which could improve accessibility in the real-world setting. Congratulations to Cosmo, Rob and the Beckley team for continued execution of the BPL-003 program, and we look forward to the Phase 2b readout mid-year.”\nThe open-label Phase 2a study investigated the safety, efficacy and pharmacokinetics of a single dose of BPL-003 in 12 patients with moderate-to-severe depression, who had failed to respond to at least two or more prior treatments and were taking defined SSRIs. Patients were followed for 12 weeks post-dosing with assessments conducted at multiple points throughout the study.\nBPL-003 was also shown to be well-tolerated. All adverse events were mild or moderate in severity and there were no serious adverse events reported (SAEs). Furthermore, acute effects resolved on the day of dosing with patients deemed dischargeable within an average time of less than two hours after dosing.\nA single dose of BPL-003 induced rapid and long-lasting antidepressant effects, with a mean MADRS (Montgomery-Asberg Depression Rating Scale) reduction of 18 points from baseline observed the day after dosing, a mean MADRS reduction of 19 points from baseline observed one month after dosing, and a mean MADRS reduction of 18 points from baseline observed three months after dosing.\nThese findings demonstrate the potential of BPL-003 to deliver a commercially scalable single dose treatment model, if approved, that fits within the current interventional psychiatric care model established by Spravato\n®\n.\nThe results are also consistent with initial results from Part 1 of the study, which investigated BPL-003 as a monotherapy. Data from that study showed that a single dose of BPL-003 was well-tolerated and produced a rapid and lasting antidepressant effect for up to three months after dosing.\nBeckley Psytech is expecting results from the core, randomized, quadruple-masked stage of its Phase 2b study of BPL-003 for TRD in mid-2025. The study enrolled 196 patients, which is the largest ever controlled clinical study to investigate mebufotenin and the only blinded Phase 2b study of mebufotenin in the United States. Data from the study will be used to support end-of-Phase 2 meetings with regulatory bodies and Phase 3 planning.\nAbout BPL-003\nBPL-003 is Beckley Psytech’s patent-protected, proprietary intranasal formulation of mebufotenin benzoate, administered via a nasal spray device used in a previously approved drug product. BPL-003 is designed to deliver rapid and durable antidepressant effects from a single dose, with a short time in the clinic and is being investigated as a potential therapy for treatment resistant depression (TRD) and for alcohol use disorder (AUD). BPL-003 is covered by granted US, UK and European composition-of-matter patents, with multiple further claims pending in various jurisdictions.\nAbout Treatment-Resistant Depression\nDepression is a debilitating and life-changing condition affecting nearly 300 million people across the globe, with around 52 million people affected by the condition in Europe and the US combined. Treatment resistant depression occurs when an individual does not respond to two or more courses of antidepressants and some studies show that it may affect up to 50% of those living with depression, meaning there is a significant unmet need for more effective treatments.\nAbout Beckley Psytech\nBeckley Psytech Ltd. is a private clinical-stage biopharmaceutical company dedicated to improving the lives of people with neuropsychiatric disorders through the development of rapid-acting, short-duration psychedelic medicines. In January 2024, atai made a strategic investment in Beckley Psytech, resulting in an approximate one third ownership stake and 1:1 warrant coverage at a 30% premium on the primary issuances. atai holds a time-limited right of first refusal on a future sale of the company and an indefinite right of first negotiation for BPL-003 and ELE-101. atai and Beckley Psytech also agreed to collaborate on digital therapeutics, commercial and market access activities in preparation for future potential commercialization.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. Our pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. We are also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychiatry therapies that can integrate seamlessly into healthcare systems. For the latest updates and to learn more about our mission, visit\nwww.atai.com\nor follow us on\nLinkedIn\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “anticipate,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. Forward-looking statements include express or implied statements relating to, among other things: our business strategy and plans; the potential, success, cost and timing of development of our product candidates, and the product candidates of those companies we invest in, including the progress of preclinical and clinical trials and related milestones such as BPL-003 and related data readouts.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the important factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (“SEC”), as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.com\nMedia Contact:\nPR@atai.com"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Reports First Quarter 2025 Financial Results and Recent Corporate Updates",
    "link": "https://www.globenewswire.com/news-release/2025/05/14/3080966/0/en/atai-Life-Sciences-Reports-First-Quarter-2025-Financial-Results-and-Recent-Corporate-Updates.html",
    "date": "May 14, 2025 07:00 ET",
    "text": "atai Life Sciences Reports First Quarter 2025 Financial Results and Recent Corporate Updates\nMay 14, 2025 07:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nWith clinical momentum across its pipeline, atai strengthens its position as a leader in potentially transformative psychedelic mental health treatments\nAnticipate topline data midyear from the Phase 2b clinical trial of BPL-003 in patients with treatment-resistant depression (TRD) - the largest controlled trial of mebufotenin and the first and only such trial to investigate mebufotenin in the U.S.\nDosed the first patient in the exploratory Phase 2 study of EMP-01 (oral R-MDMA) for the treatment of social anxiety; topline data anticipated in Q1’26\nContinued enrollment in Elumina, a Phase 2 study of VLS-01 (buccal film DMT) in patients with TRD; topline data are anticipated in Q1’26\nCash, cash equivalents, short-term securities, and public equity holdings expected to fund operations into 2027\nNEW YORK and BERLIN, May  14, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, today announced first quarter 2025 financial results and provided corporate updates.\n“In the first quarter of 2025, we made meaningful progress across our pipeline, thus advancing our mission to transform the treatment of mental health conditions,” stated Srinivas Rao, M.D., Ph.D., Chief Executive Officer and Co-founder of atai. “Dosing the first patient in our exploratory Phase 2 study of EMP-01 in social anxiety disorder represents a significant milestone in our quest to address an area of high unmet need with a novel therapeutic approach. Looking ahead, we are excited about the upcoming mid-year data readouts for BPL-003 in treatment-resistant depression and RL-007 in cognitive impairment associated with schizophrenia. We believe that these milestones have the potential to reinforce our position as a leader in mental health innovation.”\n“The world is waking up to the scale and urgency of the mental health crisis, and atai remains at the forefront of developing innovative, science-driven solutions to meet this challenge,” stated Christian Angermayer, Co-founder and Chairman of atai. “Our progress this year reinforces my conviction in our mission and the long-term value we’re building, which is why I’ve continued to personally increase my investment in atai. With a robust pipeline, strategic clarity, and growing momentum, we are well-positioned to deliver both transformative outcomes for patients in need and strong returns for shareholders.”\nRecent Clinical Highlights and Upcoming Milestones\nVLS-01: Dimethyltryptamine (DMT) for treatment-resistant depression (TRD)\nVLS-01 is an investigational proprietary oral transmucosal film formulation of DMT applied to the buccal surface, designed to fit within the established two-hour interventional psychiatry treatment paradigm.\nContinued to enroll patients in Elumina, a Phase 2, multicenter, double-blind, randomized, placebo-controlled trial to assess the safety and efficacy of repeated doses of VLS-01 in ~142 patients with TRD. Topline data are anticipated in the first quarter of 2026.\nPresented data from the Phase 1 study of VLS-01 at the Society of Biological Psychiatry (SOBP) annual meeting.\nEMP-01: R-enantiomer of 3,4-methylenedioxy-methamphetamine (R-MDMA) for social anxiety disorder (SAD)\nEMP-01 is an oral formulation of R-MDMA that demonstrated unique, dose-dependent subjective effects in a Phase 1 trial that was generally found to be more similar to classical psychedelics than to racemic MDMA.\nDosed the first patient in the exploratory, randomized, double-blind, placebo-controlled Phase 2 study of EMP-01 to assess the safety, tolerability and efficacy in ~60 adults with SAD. Topline data are anticipated in the first quarter of 2026.\nBPL-003: Mebufotenin benzoate for TRD and alcohol use disorder (AUD) (strategic investment in Beckley Psytech)\nBPL-003 is an intranasal transmucosal formulation of mebufotenin benzoate designed to fit within the established two-hour interventional psychiatry treatment paradigm.\nBeckley Psytech remains on track to report topline results in mid-year 2025 from the eight-week core phase of the randomized, quadruple-masked, global Phase 2b clinical study of BPL-003 in 196 patients with TRD.\nBeckley Psytech also remains on track to report topline data from Part 2 of its Phase 2a study of BPL-003 in combination with selective serotonin reuptake inhibitors (SSRIs) for TRD in the second quarter of 2025.\nBeckley Psytech presented data from Part 1 of its open-label Phase 2a trial in patients with TRD at SOBP 2025.\nNovel 5-HT2A Receptor Agonists (including the discovery of non-hallucinogenic neuroplastogens)\nNovel 5-HT2A receptor agonists were discovered that maintain non-hallucinogenic potential based on their inability to fully-substitute for a traditional psychedelic in rodent drug discrimination studies. These differentiated 5-HT2A receptor agonists are being further optimized and studied in a series of animal models to assess therapeutic potential.\nPresented a poster on the\nIdentification of Lead 5-HT2A Receptor Agonists for use in Treatment Resistant Depression with Non-hallucinogenic Potential and Low Valvulopathy Liability\nat the International Festival of Neuroscience BNA 2025.\nRL-007: Pro-cognitive neuromodulator for cognitive impairment associated with schizophrenia (CIAS) (strategic investment in Recognify Life Sciences)\nRL-007 is an orally bioavailable compound that has demonstrated pro-cognitive effects in multiple pre-clinical and clinical studies, including two Phase 1 and two Phase 2 trials.\nRecognify Life Sciences remains on track to report topline data in mid-2025 from the Phase 2b proof-of-concept study of RL-007 in 234 patients living with CIAS.\nRecognify Life Sciences presented RL-007 preclinical data at SOBP 2025.\nCorporate Update\nOn May 2, 2025, the Company repaid in full the outstanding indebtedness of $21.8 million and terminated all commitments and obligations under the Hercules Loan Agreement. The early prepayment saved atai approximately $2.1 million of interest otherwise due under the full amortization payment schedule.\nConsolidated Financial Results\nCash, cash equivalents, and short-term securities:\nAs of March 31, 2025, the Company had cash, cash equivalents, restricted cash and short-term securities of $108.2 million compared to $72.3 million as of December 31, 2024. The $35.9 million increase in cash is a result of $59.1 million net proceeds from equity financings, net of $17.8 million used in operations and $5.0 million invested in digital assets. The Company expects its cash, cash equivalents, short-term securities, and public equity holdings to be sufficient to fund operations into 2027.\nResearch and development (R&D) expenses:\nR&D expenses were $11.3 million for the three months ended March 31, 2025, as compared to $11.5 million for the same prior year period. The year-over-year decrease of $0.2 million is primarily attributable to decreases in personnel-related expenses and consulting services, partially offset by increases in contract research organization and intellectual property spend related to our clinical programs.\nGeneral and administrative (G&A) expenses:\nG&A expenses for the three months ended March 31, 2025 were $10.6 million as compared to $12.6 million in the same prior year period. The year-over-year decrease of $2.0 million was primarily attributable to decreases in personnel-related expenses and professional services. The Company expects the reduction in G&A spend over prior years to continue.\nNet income (loss):\nNet loss attributable to stockholders for the three months ended March 31, 2025, was $26.4 million as compared to $26.7 million for the three months ended March 31, 2024.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. Our pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. We are also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychiatry therapies that can integrate seamlessly into healthcare systems. For the latest updates and to learn more about our mission, visit\nwww.atai.com\nor follow us on\nLinkedIn\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “anticipate,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. Forward-looking statements include express or implied statements relating to, among other things: our business strategy and plans; the potential, success, cost and timing of development of our product candidates, including the progress of preclinical studies and clinical trials and related milestones; expectations regarding our cash runway; and the plans and objectives of management for future operations, research and development and capital expenditures.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the important factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (“SEC”), as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.com\nMedia Contact:\nPR@atai.com\n-- Financial Statements Attached --\nATAI LIFE SCIENCES N.V.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(Amounts in thousands, except share and per share amounts)\nThree Months Ended\nMarch 31,\n2025\n2024\n(unaudited)\nRevenue\n$\n1,555\n$\n—\nOperating expenses:\nResearch and development\n11,328\n11,530\nGeneral and administrative\n10,597\n12,555\nTotal operating expenses\n21,925\n24,085\nLoss from operations\n(20,370\n)\n(24,085\n)\nOther expense, net\n(5,939\n)\n(1,596\n)\nNet loss before income taxes\n(26,309\n)\n(25,681\n)\nBenefit from (provision for) income taxes\n(156\n)\n4\nLosses from investments in equity method investees, net of tax\n—\n(1,701\n)\nNet loss\n(26,465\n)\n(27,378\n)\nNet loss attributable to noncontrolling interests\n(34\n)\n(665\n)\nNet loss attributable to ATAI Life Sciences N.V. stockholders\n$\n(26,431\n)\n$\n(26,713\n)\nNet loss per share attributable to ATAI Life Sciences N.V. stockholders — basic and diluted\n$\n(0.15\n)\n$\n(0.17\n)\nWeighted average common shares outstanding attributable to ATAI Life Sciences N.V. stockholders — basic and diluted\n176,271,176\n158,891,067\nATAI LIFE SCIENCES N.V.\nCONDENSED CONSOLIDATED BALANCE SHEET\n(Amounts in thousands)\nMarch 31,\nDecember 31,\n2025\n2024\nAssets\n(unaudited)\nCash and cash equivalents\n$\n48,287\n$\n17,505\nSecurities carried at fair value\n49,917\n44,825\nShort-term restricted cash for other investments\n10,000\n10,000\nPrepaid expenses and other current assets\n7,774\n7,795\nProperty and equipment, net\n2,682\n2,535\nOperating lease right-of-use assets, net\n2,905\n1,334\nOther investments held at fair value\n23,053\n28,887\nOther investments\n42,079\n42,079\nIntangible assets, net\n3,157\n3,246\nGoodwill\n331\n331\nDigital assets\n4,788\n-\nOther assets\n810\n850\nTotal assets\n$\n195,783\n$\n159,387\nLiabilities and Stockholders' Equity\nAccounts payable\n$\n2,705\n$\n2,616\nAccrued liabilities\n8,680\n9,847\nCurrent portion of lease liabilities\n287\n477\nShort-term convertible promissory notes and derivative liability - related party\n1,205\n1,150\nShort-term convertible promissory notes and derivative liability\n1,923\n1,840\nCurrent portion of long-term debt\n11,366\n6,374\nOther current liabilities\n2,335\n2,647\nContingent consideration liabilities - related parties\n110\n110\nContingent consideration liabilities\n212\n212\nNoncurrent portion of lease liabilities\n2,587\n732\nLong-term debt, net\n9,300\n14,133\nOther liabilities\n2,799\n2,695\nTotal stockholders' equity attributable to ATAI Life Sciences N.V. stockholders\n152,053\n116,297\nNoncontrolling interests\n221\n257\nTotal liabilities and stockholders' equity\n$\n195,783\n$\n159,387"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces First Patient Dosed in Phase 2 Study of EMP-01 for the Treatment of Social Anxiety Disorder",
    "link": "https://www.globenewswire.com/news-release/2025/05/13/3079966/0/en/atai-Life-Sciences-Announces-First-Patient-Dosed-in-Phase-2-Study-of-EMP-01-for-the-Treatment-of-Social-Anxiety-Disorder.html",
    "date": "May 13, 2025 07:01 ET",
    "text": "atai Life Sciences Announces First Patient Dosed in Phase 2 Study of EMP-01 for the Treatment of Social Anxiety Disorder\nMay 13, 2025 07:01 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\n- In a Phase 1 study, EMP-01 (oral R-MDMA) demonstrated a unique, dose-dependent subjective effect profile that was generally found to be more similar to classical psychedelics than to racemic MDMA\n- The exploratory, randomized, double-blind, placebo-controlled Phase 2 study will assess the safety, tolerability and efficacy of EMP-01 in adults with social anxiety disorder\n- Topline data anticipated in the first quarter of 2026\nNEW YORK and BERLIN, May  13, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, today announced that the first patient has been dosed in the exploratory Phase 2 study of EMP-01 (R-3,4-methylenedioxy-methamphetamine (R-MDMA)) for the treatment of social anxiety disorder (SAD).\n\"We are pleased to have dosed the first patient in the exploratory Phase 2 study evaluating EMP-01 in adults with social anxiety disorder,\" stated Kevin Craig, M.D., Chief Medical Officer of atai. \"Social anxiety disorder affects millions and remains significantly underserved by current treatment options. We believe this Phase 2 study will provide critical insights into EMP-01’s potential to address this large and growing market with substantial unmet need.”\nThe Phase 2 study is an exploratory, randomized, double-blind, placebo-controlled trial (\nNCT06693609\n) to assess the safety, tolerability and efficacy of EMP-01 in approximately 60 adults with SAD. Patients will be randomized 1:1 to receive two double-blind administrations of either EMP-01 or placebo, spaced four weeks apart. Symptoms will be monitored for six weeks following the first dose. The primary objective of the study is to assess the safety and tolerability of EMP-01 in adults with SAD. The secondary objective is to estimate any improvements in social anxiety symptoms compared to placebo.\nAbout EMP-01 (Oral R-MDMA)\nEMP-01 is an oral formulation of R-3,4-methylenedioxy-methamphetamine (R-MDMA) that demonstrated a unique, dose-dependent subjective effect profile in a Phase 1 trial that was generally found to be more similar to classical psychedelics than to racemic MDMA. Anxiety disorders are the most common mental health disorders worldwide, affecting how one experiences worry, fear and anxiety in everyday situations. Social anxiety disorder (SAD) is an area of high unmet medical need with approximately 18 million people currently diagnosed in the United States and no novel molecules approved in over two decades. atai is currently enrolling patients into an exploratory, randomized, double-blind, placebo-controlled Phase 2 study to assess the safety, tolerability and efficacy of EMP-01 in adults with SAD. Topline data from the Phase 2 study is anticipated in the first quarter of 2026.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. Our pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. We are also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychiatry therapies that can integrate seamlessly into healthcare systems. For the latest updates and to learn more about our mission, visit\nwww.atai.com\nor follow us on\nLinkedIn\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “anticipate,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. Forward-looking statements include express or implied statements relating to, among other things: our business strategy and plans; the potential, success, cost and timing of development and progress of trials and related milestones of our product candidates such as EMP-01; expectations regarding our cash runway; and the plans and objectives of management for future operations, research and development and capital expenditures.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the important factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (“SEC”), as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.com\nMedia Contact:\nPR@atai.com"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Reports Fourth Quarter and Full Year 2024 Financial Results and Recent Corporate Highlights",
    "link": "https://www.globenewswire.com/news-release/2025/03/17/3043651/0/en/atai-Life-Sciences-Reports-Fourth-Quarter-and-Full-Year-2024-Financial-Results-and-Recent-Corporate-Highlights.html",
    "date": "March 17, 2025 08:00 ET",
    "text": "atai Life Sciences Reports Fourth Quarter and Full Year 2024 Financial Results and Recent Corporate Highlights\nMarch 17, 2025 08:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\n- Dosed the first patient in the Phase 2 Elumina trial of VLS-01 (buccal film DMT) for patients with treatment-resistant depression; topline data anticipated in Q1’26\n- Initiated a Phase 2 clinical trial of EMP-01 (oral R-MDMA) for patients with social anxiety disorder; topline data anticipated in Q1’26\n- Beckley Psytech completed enrollment in the Phase 2b study of BPL-003 (intranasal mebufotenin benzoate) in patients with treatment-resistant depression; topline data anticipated in mid-25\n- Completed an equity offering with net proceeds of $59.2 million; extending operational runway into 2027\nNEW YORK and BERLIN, March  17, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes, today announced fourth quarter and full year 2024 financial results and recent corporate highlights.\n“We are beginning the year in a strong financial position, thanks to the recent capital raise, which extends our runway into 2027, beyond when we expect the topline data readouts from the Phase 2 clinical trials of our two core programs, VLS-01 and EMP-01, in Q1’26” stated Srinivas Rao, M.D., Ph.D., Chief Executive Officer and Co-founder of atai. “Our team is focused on executing these trials rigorously and efficiently to drive forward our mission to transform patient outcomes in mental health. We also look forward to several key milestones this year, notably Beckley Psytech’s BPL-003 Phase 2b topline results in patients with treatment-resistant depression as well as RL-007 in patients with cognitive impairment associated with schizophrenia, both expected mid-2025.”\nRecent Clinical Highlights and Upcoming Milestones\nVLS-01: N,N-dimethyltryptamine (DMT) for treatment-resistant depression (TRD)\nVLS-01 is an investigational proprietary oral transmucosal film formulation of DMT applied to the buccal surface, designed to fit within the established two-hour interventional psychiatry treatment paradigm.\nDosed the first patient in Elumina, a Phase 2, multicenter, double-blind, randomized, placebo-controlled trial to assess the safety and efficacy of repeated doses of VLS-01 in patients with TRD.\nTopline data from the Phase 2 Elumina trial of VLS-01 are anticipated in the first quarter of 2026.\nEMP-01: R-enantiomer of 3,4-methylenedioxy-methamphetamine (R-MDMA) for social anxiety disorder (SAD)\nEMP-01 is an oral formulation of R-MDMA that demonstrated a unique, dose-dependent subjective effect profile in a Phase 1 trial that was generally found to be more similar to classical psychedelics than to racemic MDMA.\nInitiated an exploratory Phase 2, randomized, double-blind, placebo-controlled clinical study to assess the safety, tolerability and efficacy of EMP-01 in adults with SAD.\nTopline data from the Phase 2 study of EMP-01 are anticipated in the first quarter of 2026.\nBPL-003: 5-Methoxy N,N-dimethyltryptamine (mebufotenin) benzoate for TRD and alcohol use disorder (AUD) (strategic investment in Beckley Psytech)\nBPL-003 is an intranasal transmucosal formulation of mebufotenin benzoate designed to fit within the established two-hour interventional psychiatry treatment paradigm.\nIn March 2025, Beckley Psytech completed patient enrollment in the eight-week, double-blind, core stage of the global Phase 2b clinical trial of BPL-003 in 196 patients with TRD. Topline results from the core phase of the study are expected in mid-2025.\nIn January 2025, Beckley Psytech announced positive topline data from its open-label Phase 2a study of BPL-003 in 12 patients with moderate-to-severe AUD. Initial data demonstrated that a single dose of BPL-003, combined with relapse prevention therapy, produced meaningful and sustained reductions in alcohol use, with 50% of patients maintaining complete abstinence out to three months and was well-tolerated with no serious adverse events reported.\nRL-007: Pro-cognitive neuromodulator for cognitive impairment associated with schizophrenia (CIAS) (strategic investment in Recognify Life Sciences)\nRL-007 is an orally bioavailable compound that has demonstrated pro-cognitive effects in multiple pre-clinical and clinical studies, including two Phase 1 and two Phase 2 trials.\nRecognify Life Sciences is running a Phase 2b proof-of-concept study in 234 patients living with CIAS. Topline results are expected in mid-2025.\nConsolidated Financial Results\nCash, cash equivalents, and short-term securities:\nAs of December 31, 2024, the Company had cash, cash equivalents, restricted cash and short-term securities of $72.3 million compared to $154.2 million as of December 31, 2023. The decrease of $81.9 million was primarily driven by $82.4 million net cash used in operating activities, $15.0 million for the Beckley Psytech investment, and $7.7 million of additional investments to advance our programs; partially offset by $16.1 million in proceeds from the partial sale of our ADS holdings in Compass Pathways, and $5.0 million in proceeds from our committed term loan with Hercules Capital, Inc. In February 2025, the Company completed an equity offering with net proceeds of $59.2 million and now expects its cash, short-term securities, and public equity holdings to be sufficient to fund operations into 2027.\nResearch and development (R&D) expenses:\nR&D expenses were $18.9 million and $55.5 million for the three and twelve months ended December 31, 2024, respectively, as compared to $14.2 million and $62.2 million for the comparable prior year periods. The year-over-year full-year decrease of $6.7 million was primarily attributable to a $5.5 million decrease in R&D personnel-related expenses and a $1.4 million decrease in program-specific expenses. The overall decrease in program-specific spend relates to the wind-down of certain programs, offset by the increase in on-going clinical trials and our non-hallucinogenic discovery program. The Company is anticipating R&D spend to increase as its R&D programs progress into later stage clinical trials.\nGeneral and administrative (G&A) expenses:\nG&A expenses for the three and twelve months ended December 31, 2024 were $11.3 million and $47.5 million, respectively, as compared to $19.4 million and $63.6 million for the comparable prior year periods. The year-over-year full-year decrease of $16.0 million was primarily attributable to a $16.2 million decrease in personnel-related expenses and professional services. The Company expects the reduction in G&A spend over prior years to continue.\nNet income (loss):\nNet loss attributable to shareholders for the three and twelve months ended December 31, 2024 was $39.0 million and $149.3 million, respectively, as compared to $18.3 million and $40.2 million for the comparable prior year periods. Net loss attributable to shareholders for the twelve months ended December 31, 2024 includes $48.9 million of non-cash decrease in fair value of assets and liabilities, net and $25.5 million of non-cash share-based compensation. Net loss attributable to shareholders for the twelve months ended December 31, 2023 includes $86.6 million of non-cash increase in fair value of assets and liabilities, net, of which $69.0 million relates to a one-time accounting change, and $33.0 million of non-cash share-based compensation.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company on a mission to develop highly effective mental health treatments to transform patient outcomes. Our pipeline of psychedelic-based therapies includes VLS-01 (buccal film DMT) for treatment-resistant depression (TRD) and EMP-01 (oral R-MDMA) for social anxiety disorder, which are in Phase 2 clinical development. We are also advancing a drug discovery program to identify novel, non-hallucinogenic 5-HT2AR agonists for TRD. These programs aim to address the complex nature of mental health providing commercially scalable interventional psychology therapies that can integrate seamlessly into healthcare systems. For the latest updates and to learn more about our mission, visit\nwww.atai.com\nor follow us on\nLinkedIn\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “anticipate,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. Forward-looking statements include express or implied statements relating to, among other things: our business strategy and plans; the potential, success, cost and timing of development of our product candidates, including the progress of preclinical and clinical trials and related milestones; expectations regarding our strategic investment in Beckley Psytech and other investments; expectations regarding our cash runway; and the plans and objectives of management for future operations, research and development and capital expenditures.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the important factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (“SEC”), as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.com\nMedia Contact:\nPR@atai.com\n-- Financial Statements Attached --\nATAI LIFE SCIENCES N.V.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(Amounts in thousands, except share and per share amounts)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2024\n2023\n2024\n2023\n(unaudited)\nLicense revenue\n$\n(5\n)\n$\n18\n$\n308\n$\n314\nOperating expenses:\nResearch and development\n18,942\n14,156\n55,455\n62,203\nGeneral and administrative\n11,318\n19,423\n47,544\n63,582\nTotal operating expenses\n30,260\n33,579\n102,999\n125,785\nLoss from operations\n(30,265\n)\n(33,561\n)\n(102,691\n)\n(125,471\n)\nOther income (expense), net\n(8,919\n)\n15,241\n(45,714\n)\n86,185\nNet loss before income taxes\n(39,184\n)\n(18,320\n)\n(148,405\n)\n(39,286\n)\nBenefit from (provision for) income taxes\n193\n(428\n)\n356\n(1,016\n)\nLosses from investments in equity method investees, net of tax\n—\n(394\n)\n(2,000\n)\n(3,593\n)\nNet loss\n(38,991\n)\n(19,142\n)\n(150,049\n)\n(43,895\n)\nNet loss attributable to noncontrolling interests\n(33\n)\n(850\n)\n(780\n)\n(3,671\n)\nNet loss attributable to ATAI Life Sciences N.V. stockholders\n$\n(38,958\n)\n$\n(18,292\n)\n$\n(149,269\n)\n$\n(40,224\n)\nNet loss per share attributable to ATAI Life Sciences N.V. stockholders — basic and diluted\n$\n(0.24\n)\n$\n(0.12\n)\n$\n(0.93\n)\n$\n(0.25\n)\nWeighted average common shares outstanding attributable to ATAI Life Sciences N.V. stockholders — basic and diluted\n160,711,543\n158,842,995\n160,159,983\n158,833,785\nATAI LIFE SCIENCES N.V.\nCONDENSED CONSOLIDATED BALANCE SHEET\n(Amounts in thousands)\nDecember 31,\nDecember 31,\n2024\n2023\nAssets\nCash and cash equivalents\n$\n17,505\n$\n45,034\nSecurities carried at fair value\n44,825\n109,223\nShort-term restricted cash for other investments\n10,000\n-\nCommitted investment funds\n-\n25,000\nPrepaid expenses and other current assets\n7,795\n5,830\nShort-term notes receivable - related party, net\n-\n505\nProperty and equipment, net\n2,535\n981\nOperating lease right-of-use assets, net\n1,334\n1,223\nOther investments held at fair value\n28,887\n89,825\nOther investments\n42,079\n1,838\nIntangible assets, net\n3,246\n1,772\nGoodwill\n331\n-\nLong-term notes receivable - related party, net\n-\n97\nConvertible notes receivable - related party\n-\n11,202\nOther assets\n850\n948\nTotal assets\n$\n159,387\n$\n293,478\nLiabilities and Stockholders' Equity\nAccounts payable\n$\n2,616\n$\n4,589\nAccrued liabilities\n9,847\n15,256\nCurrent portion of lease liabilities\n477\n275\nShort-term convertible promissory notes and derivative liability - related party\n1,150\n-\nShort-term convertible promissory notes and derivative liability\n1,840\n-\nCurrent portion of long-term debt\n6,374\n-\nOther current liabilities\n2,647\n-\nContingent consideration liability - related party\n110\n620\nContingent consideration liabilities\n212\n1,637\nNoncurrent portion of lease liabilities\n732\n990\nConvertible promissory notes and derivative liability - related party\n-\n164\nConvertible promissory notes and derivative liability\n-\n2,666\nLong-term debt, net\n14,133\n15,047\nOther liabilities\n2,695\n7,918\nTotal stockholders' equity attributable to ATAI Life Sciences N.V. stockholders\n116,297\n242,962\nNoncontrolling interests\n257\n1,354\nTotal liabilities and stockholders' equity\n$\n159,387\n$\n293,478"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces First Patient Dosed in Elumina, the Phase 2 Clinical Trial of VLS-01 for Treatment-Resistant Depression",
    "link": "https://www.globenewswire.com/news-release/2025/03/11/3040405/0/en/atai-Life-Sciences-Announces-First-Patient-Dosed-in-Elumina-the-Phase-2-Clinical-Trial-of-VLS-01-for-Treatment-Resistant-Depression.html",
    "date": "March 11, 2025 07:00 ET",
    "text": "atai Life Sciences Announces First Patient Dosed in Elumina, the Phase 2 Clinical Trial of VLS-01 for Treatment-Resistant Depression\nMarch 11, 2025 07:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\n- Elumina is a Phase 2, multicenter, double-blind, randomized, placebo-controlled, clinical trial to assess the efficacy, safety and tolerability of VLS-01 (buccal film DMT) in people suffering from treatment-resistant depression\n- VLS-01 is being developed as a rapid-acting, robust and durable antidepressant for people suffering from treatment-resistant depression, which affects approximately 100 million people globally\n- VLS-01 is designed to fit within the established two-hour interventional psychiatry treatment paradigm\n-\nTopline results from the Phase 2 Elumina trial are anticipated in the first quarter of 2026\nNEW YORK and BERLIN, March  11, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders, today announced that the first patient has been dosed in the Phase 2 Elumina trial of VLS-01, atai’s proprietary oral transmucosal film formulation of N,N-Dimethyltryptamine (DMT) applied to the buccal surface, in people suffering from treatment-resistant depression (TRD).\n\"Dosing the first patient in the Phase 2 Elumina trial of VLS-01 marks a significant milestone in our commitment to transforming the treatment landscape for mental health disorders,\" stated Kevin Craig, M.D., Chief Medical Officer of atai. \"Millions worldwide struggle with treatment-resistant depression, often left with few or no viable options. With VLS-01, we see the potential to offer rapid, robust, and durable antidepressant effects that could provide meaningful relief where existing treatments fall short. This trial brings us one step closer to delivering a new and innovative solution to those people who need it most.\"\nElumina is a Phase 2, multi-center, double-blind, randomized, placebo-controlled, clinical trial to assess the efficacy, safety and tolerability of repeated doses of VLS-01 (\nNCT06524830\n). The trial consists of two treatment periods. In the first treatment period, approximately 142 patients will be randomized 1:1 to receive a 120mg dose of VLS-01 or placebo on Day 1, followed by a second dose of the same intervention at Week 2. The primary endpoint is the change from Baseline in Montgomery-Asberg Depression Rating Scale (MADRS) total score at Week 4. The last double-blind assessment visit will be at Week 14. The first treatment period will provide 12 weeks of blinded durability data following two doses of VLS-01 administered in a placebo-controlled fashion. Topline results from the first treatment period are anticipated in the first quarter of 2026.\nThe second treatment period starts at Week 14 and will explore the response to two different dose levels of VLS-01. Patients will be randomized 1:1 to receive a third dose of either 60mg or 120mg of VLS-01. Final safety and efficacy assessment will be conducted two weeks after administration of the third dose.\nAbout VLS-01 (buccal film DMT)\nVLS-01 is a proprietary oral transmucosal film formulation of N,N-Dimethyltryptamine (DMT) applied to the buccal surface, being developed for the treatment of people suffering from treatment-resistant depression (TRD). Pharmacologically, VLS-01 is a partial to full agonist of the 5-HT\n1/2/6/7\nreceptors and is being developed to potentially offer rapid, robust, and durable efficacy with a favorable safety profile. VLS-01 is designed to fit within the established two-hour interventional psychiatry treatment paradigm, positioning it for integration into existing care models. atai is enrolling patients into Elumina, the Phase 2, multi-center, double-blind, randomized, placebo-controlled, trial to assess the efficacy, safety and tolerability of VLS-01 in people suffering from TRD. Topline results from the first treatment period of the Phase 2 Elumina trial are anticipated in the first quarter of 2026.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life. For more information, please visit\nwww.atai.life\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. All statements contained in this press release that do not relate to matters of historical fact should be considered forward-looking statements, including, without limitation, statements relating to our business strategy and plans; and the potential, success, cost and timing of development of VLS-01 and related trials and studies.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (SEC) on March 28, 2024, as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces Completion of Enrollment in Phase 2b Clinical Trial Evaluating BPL-003 for Treatment-Resistant Depression",
    "link": "https://www.globenewswire.com/news-release/2025/03/05/3037279/0/en/atai-Life-Sciences-Announces-Completion-of-Enrollment-in-Phase-2b-Clinical-Trial-Evaluating-BPL-003-for-Treatment-Resistant-Depression.html",
    "date": "March 05, 2025 07:00 ET",
    "text": "atai Life Sciences Announces Completion of Enrollment in Phase 2b Clinical Trial Evaluating BPL-003 for Treatment-Resistant Depression\nMarch 05, 2025 07:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\n- The eight-week, quadruple-masked, dose-finding, core stage of the Phase 2b clinical trial is evaluating the efficacy and safety of a single dose of BPL-003 (mebufotenin benzoate) in patients with treatment-resistant depression\n-\nThe open-label extension stage of the Phase 2b clinical trial continues to enroll patients to evaluate the safety and efficacy of a second dose of BPL-003\n- As previously reported, the Phase 2a study of BPL-003 in patients with treatment-resistant depression showed rapid and lasting antidepressant effects from a single dose, and patients were deemed ready for discharge within an average time of less than two hours after dosing\n-\nTopline results from the core stage of the Phase 2b clinical trial are expected in mid-2025\nNEW YORK and BERLIN, March  05, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders, today announced the completion of patient enrollment in the eight-week, double-blind, core stage of the global Phase 2b clinical trial evaluating BPL-003 (mebufotenin benzoate) in patients with treatment-resistant depression (TRD). BPL-003 is Beckley Psytech’s patent-protected, proprietary intranasal formulation of mebufotenin benzoate, administered via a nasal spray device used in a previously approved drug product. BPL-003 is designed to deliver rapid and durable effects from a single dose, with a short time in clinic. Topline results from the core stage of the Phase 2b clinical trial are expected in mid-2025.\n“We are impressed by the Beckley Psytech team’s execution of the Phase 2b clinical trial of BPL-003 in patients with treatment-resistant depression, which is the largest controlled trial of mebufotenin and the first and only Phase 2b clinical trial to investigate mebufotenin in the U.S.,” stated Srinivas Rao, M.D., Ph.D., Chief Executive Officer and Co-founder of atai. “The promising data from earlier clinical studies of BPL-003 have demonstrated that a single dose can induce rapid, significant, and lasting antidepressant effects, further reinforcing our confidence in its potential to revolutionize treatment for difficult-to-treat depression. We look forward to the topline results from the eight-week core stage of the Phase 2b clinical trial of BPL-003, which remains on track for mid-2025.”\nThe eight-week, quadruple-masked, dose-finding, core stage of the Phase 2b clinical trial (\nNCT05870540\n) is evaluating the efficacy and safety of a single medium (8mg) or high (12mg) dose of BPL-003 against a sub-perceptual dose. The trial enrolled 196 patients with moderate-to-severe depression that had failed to respond to at least two or more prior treatments in the current episode of depression across 38 sites in six countries. Patients are followed for eight weeks, and efficacy is assessed at various timepoints by centralized, blinded raters using the Montgomery-Asberg Depression Rating Scale (MADRS).\nThe eight-week, open-label, extension stage of the Phase 2b clinical trial continues to enroll patients to evaluate the safety and efficacy of a second high dose of BPL-003 administered after the completion of the core stage of the trial.\nData from the Phase 2b clinical trial will be used in conjunction with data from the Phase 2a study of BPL-003 in patients with TRD to support end-of-Phase 2 meetings with regulatory bodies and Phase 3 planning in the second half of 2025. Initial Phase 2a data showed that a single 10mg dose of BPL-003 can produce a rapid and lasting antidepressant effect, with 55% of patients meeting the criteria for remission (MADRS ≤10) at Day 29 and 45% meeting the criteria for remission at Day 85. BPL-003 only required a short time in clinic, with patients deemed dischargeable within an average time of less than two hours after dosing.\nAbout BPL-003\nBPL-003 is Beckley Psytech’s patent-protected, proprietary intranasal formulation of mebufotenin benzoate, administered via a nasal spray device used in a previously approved drug product. BPL-003 is designed to deliver rapid and durable effects from a single dose, with a short time in clinic. BPL-003 is being investigated for treatment-resistant depression (TRD) and for alcohol use disorder (AUD). In a Phase 2a study in patients with TRD, a single 10mg dose of BPL-003 produced a rapid antidepressant response in 55% of patients at Day 1, with 55% of patients in remission at Day 29 and 45% in remission at Day 85. BPL-003 demonstrated a short treatment duration, with patients deemed ready to be discharged within an average of less than two hours after dosing. Topline results from the eight-week, randomized, core stage of the Phase 2b clinical trial in patients with TRD are expected in mid-2025.\nAbout Beckley Psytech Ltd\nBeckley Psytech Ltd. is a private clinical-stage biopharmaceutical company dedicated to improving the lives of people with neuropsychiatric disorders through the development of rapid-acting, short-duration psychedelic medicines. In January 2024,\natai made a strategic investment in Beckley Psytech\n, resulting in an approximate one third ownership stake and 1:1 warrant coverage at a 30% premium on the primary issuances. atai holds a time-limited right of first refusal on a future sale of the company and an indefinite right of first negotiation for BPL-003 and ELE-101. atai and Beckley Psytech also agreed to collaborate on digital therapeutics, commercial and market access activities in preparation for future potential commercialization.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life. For more information, please visit\nwww.atai.life\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. All statements contained in this press release that do not relate to matters of historical fact should be considered forward-looking statements, including, without limitation, statements relating to our business strategy and plans; and the potential, success, cost and timing of development of our product candidates, and the product candidates of those companies we invest in, including the progress of preclinical and clinical trials and related milestones such as BPL-003 and related data readouts.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (SEC) on March 28, 2024, as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences to Participate in the TD Cowen 45th Annual Health Care Conference",
    "link": "https://www.globenewswire.com/news-release/2025/02/24/3031540/0/en/atai-Life-Sciences-to-Participate-in-the-TD-Cowen-45th-Annual-Health-Care-Conference.html",
    "date": "February 24, 2025 16:10 ET",
    "text": "atai Life Sciences to Participate in the TD Cowen 45th Annual Health Care Conference\nFebruary 24, 2025 16:10 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nNEW YORK and BERLIN, Feb.  24, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders, today announced that the Company’s management team is scheduled to participate in the TD Cowen 45\nth\nAnnual Health Care Conference in Boston, MA from March 3-5, 2025. Details of the company’s participation:\nFormat:\nFireside chat and 1x1 investor meetings\nDate and Time:\nFireside chat on Monday, March 3 at 11:50 A.M. ET\nWebcast link:\nHere\nAn archived replay will be available on the Investors section of the atai website under\nEvents\nfor up to 90 days.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life. For more information, please visit\nwww.atai.life\n.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces Closing of Public Offering and Full Exercise of Option to Purchase Additional Common Shares",
    "link": "https://www.globenewswire.com/news-release/2025/02/20/3029467/0/en/atai-Life-Sciences-Announces-Closing-of-Public-Offering-and-Full-Exercise-of-Option-to-Purchase-Additional-Common-Shares.html",
    "date": "February 20, 2025 07:00 ET",
    "text": "atai Life Sciences Announces Closing of Public Offering and Full Exercise of Option to Purchase Additional Common Shares\nFebruary 20, 2025 07:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nNEW YORK and BERLIN, Feb.  20, 2025  (GLOBE NEWSWIRE) --\natai Lif\ne Sciences (NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company focused on transforming the treatment of mental health disorders, today announced that, on February 14, 2025, the closing of its public offering of 26,190,477 common shares occurred. Additionally, on February 17, 2025, the underwriter exercised its option in full to purchase an additional 3,928,571 common shares at the public offering price of $2.10 per share, and the closing of the underwriter’s option to purchase 3,928,571 additional common shares occurred on February 19, 2025. The aggregate gross proceeds from the offering, including the gross proceeds from the exercise of the underwriter’s option to purchase additional shares, were approximately $63.25 million, before deducting underwriting discounts and commissions and other offering expenses payable by atai.\natai intends to use the net proceeds from the offering for general corporate purposes, including for working capital and to advance the clinical development of its product candidates and programs. Based on this planned use of proceeds and atai’s current operating plan, atai estimates that its existing cash, short-term securities, public equity holdings and committed term loan facility will be sufficient to fund operations into 2027.\nBerenberg acted as the sole bookrunner for the offering.\nThe securities in the underwritten offering described above were offered pursuant to an effective shelf registration statement that was filed with the U.S. Securities and Exchange Commission (“SEC”) on July 1, 2022 and declared effective by the SEC on July 11, 2022. This offering was made only by means of a prospectus supplement and the accompanying prospectus which formed a part of the effective shelf registration statement. The final prospectus supplement related to the offering was filed with the SEC on February 13, 2025 and is available on the SEC’s website at www.sec.gov. Copies of the final prospectus may be obtained by contacting: Berenberg Capital Markets LLC, Attention: Investment Banking, 1251 Avenue of the Americas, 53rd Floor, New York, New York 10020, or by telephone at +1 (646) 949-9000, or by e-mail at\nprospectusrequests@berenberg-us.com\n.\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as contained in Section 27A of the Securities Act and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements include, but are not limited to, the use of proceeds from the offering, the sufficiency of the proceeds from the offering and the Company’s cash, short-term securities, public equity holdings and committed term loan facility to fund operations and the timing thereof and other statements relating to the offering. There are numerous risks and uncertainties that could cause actual results and atai’s plans and objectives to differ materially from those expressed in the forward-looking information, such as those risks discussed in the section entitled “Risk Factors” set forth in atai’s most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q, in each case, as filed with the SEC, and future reports to be filed with the SEC. These documents contain and identify important factors that could cause the actual results for atai to differ materially from those contained in atai’s forward-looking statements. Any forward-looking statements contained in this press release speak only as of the date hereof, and atai specifically disclaims any obligation to update any forward-looking statement, except as required by law. These forward-looking statements should not be relied upon as representing atai’s views as of any date subsequent to the date of this press release.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces Pricing of Public Offering of Common Shares",
    "link": "https://www.globenewswire.com/news-release/2025/02/13/3025562/0/en/atai-Life-Sciences-Announces-Pricing-of-Public-Offering-of-Common-Shares.html",
    "date": "February 12, 2025 22:47 ET",
    "text": "atai Life Sciences Announces Pricing of Public Offering of Common Shares\nFebruary 12, 2025 22:47 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nNEW YORK and BERLIN, Feb.  12, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company focused on transforming the treatment of mental health disorders, today announced the pricing of a registered underwritten offering of 26,190,477 common shares, at a price of $2.10 per share. atai has granted the underwriter a 30-day option to purchase up to an additional 3,928,571 common shares. All common shares to be sold in the offering will be sold by atai.\nThe gross proceeds of the offering, before deducting underwriting discounts and commissions and other offering expenses payable by atai, are expected to be approximately $55 million. atai intends to use the net proceeds from this offering for general corporate purposes, including for working capital and to advance the clinical development of its product candidates and programs.\nThe offering is expected to close on February 14, 2025, subject to customary closing conditions.\nBerenberg is acting as the sole bookrunner for the offering.\nThe securities in the underwritten offering described above are being offered pursuant to an effective shelf registration statement that was filed with the U.S. Securities and Exchange Commission (“SEC”) on July 1, 2022 and declared effective by the SEC on July 11, 2022. This offering is being made only by means of a prospectus supplement and the accompanying prospectus which forms a part of the effective shelf registration statement. A final prospectus supplement related to the offering will be filed with the SEC and will be available on the SEC’s website at www.sec.gov. Copies of the final prospectus may be obtained, when available, by contacting: Berenberg Capital Markets LLC, Attention: Investment Banking, 1251 Avenue of the Americas, 53rd Floor, New York, New York 10020, or by telephone at +1 (646) 949-9000, or by e-mail at\nprospectusrequests@berenberg-us.com\n.\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as contained in Section 27A of the Securities Act and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements include, but are not limited to, the uncertainties related to the completion of the public offering, the grant of the option to purchase additional shares, the anticipated use of proceeds from the offering and other statements relating to the proposed offering. There are numerous risks and uncertainties that could cause actual results and atai’s plans and objectives to differ materially from those expressed in the forward-looking information, such as those risks discussed in the section entitled “Risk Factors” set forth in atai’s most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q, in each case, as filed with the SEC, and future reports to be filed with the SEC. These documents contain and identify important factors that could cause the actual results for atai to differ materially from those contained in atai’s forward-looking statements. Any forward-looking statements contained in this press release speak only as of the date hereof, and atai specifically disclaims any obligation to update any forward-looking statement, except as required by law. These forward-looking statements should not be relied upon as representing atai’s views as of any date subsequent to the date of this press release.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces Proposed Public Offering of Common Shares",
    "link": "https://www.globenewswire.com/news-release/2025/02/12/3025406/0/en/atai-Life-Sciences-Announces-Proposed-Public-Offering-of-Common-Shares.html",
    "date": "February 12, 2025 16:01 ET",
    "text": "atai Life Sciences Announces Proposed Public Offering of Common Shares\nFebruary 12, 2025 16:01 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\nNEW YORK and BERLIN, Feb.  12, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company focused on transforming the treatment of mental health disorders, today announced the commencement of a proposed registered underwritten offering of $55,000,000 of its common shares. atai expects to grant the underwriter a 30-day option to purchase up to an additional $8,250,000 of common shares. All common shares to be sold in the offering will be sold by atai.\natai intends to use the net proceeds from this offering for general corporate purposes, including for working capital and to advance the clinical development of its product candidates and programs.\nBerenberg is acting as the sole bookrunner for the offering.\nThe securities in the underwritten offering described above are being offered pursuant to an effective shelf registration statement that was filed with the U.S. Securities and Exchange Commission (“SEC”) on July 1, 2022 and declared effective by the SEC on July 11, 2022. This offering will be made only by means of a prospectus supplement and the accompanying prospectus which forms a part of the effective shelf registration statement. A preliminary prospectus supplement related to the offering will be filed with the SEC and will be available on the SEC’s website at www.sec.gov. Copies of the preliminary prospectus may be obtained, when available, by contacting: Berenberg Capital Markets LLC, Attention: Investment Banking, 1251 Avenue of the Americas, 53rd Floor, New York, New York 10020, or by telephone at +1 (646) 949-9000, or by e-mail at prospectusrequests@berenberg-us.com.\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as contained in Section 27A of the Securities Act and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements include, but are not limited to, the uncertainties related to the timing and size of the public offering, the grant of the option to purchase additional shares, the anticipated use of proceeds from the offering and other statements relating to the proposed offering. There are numerous risks and uncertainties that could cause actual results and atai’s plans and objectives to differ materially from those expressed in the forward-looking information, such as those risks discussed in the section entitled “Risk Factors” set forth in atai’s most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q, in each case, as filed with the SEC, and future reports to be filed with the SEC. These documents contain and identify important factors that could cause the actual results for atai to differ materially from those contained in atai’s forward-looking statements. Any forward-looking statements contained in this press release speak only as of the date hereof, and atai specifically disclaims any obligation to update any forward-looking statement, except as required by law. These forward-looking statements should not be relied upon as representing atai’s views as of any date subsequent to the date of this press release.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces Positive Topline Results from Beckley Psytech’s BPL-003 (intranasal 5-MeO-DMT benzoate) Phase 2a Open-Label Study for Alcohol Use Disorder",
    "link": "https://www.globenewswire.com/news-release/2025/01/28/3016256/0/en/atai-Life-Sciences-Announces-Positive-Topline-Results-from-Beckley-Psytech-s-BPL-003-intranasal-5-MeO-DMT-benzoate-Phase-2a-Open-Label-Study-for-Alcohol-Use-Disorder.html",
    "date": "January 28, 2025 07:00 ET",
    "text": "atai Life Sciences Announces Positive Topline Results from Beckley Psytech’s BPL-003 (intranasal 5-MeO-DMT benzoate) Phase 2a Open-Label Study for Alcohol Use Disorder\nJanuary 28, 2025 07:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\n- A single dose of BPL-003, combined with relapse prevention therapy, produced meaningful and sustained reductions in alcohol use, with 50% of patients maintaining complete abstinence out to three months\n- BPL-003 was well-tolerated with no serious or severe adverse events reported\nNEW YORK and BERLIN, Jan.  28, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders, today announced positive topline results from Beckley Psytech’s Phase 2a open-label study of BPL-003 in 12 patients with moderate to severe alcohol use disorder (AUD). BPL-003 is a patent-protected synthetic intranasal formulation of 5-MeO-DMT benzoate designed to deliver rapid and durable treatment effects from a single dose with a short in-clinic treatment time. The results showed that a single dose of BPL-003, in combination with relapse prevention cognitive behavioral therapy, induced meaningful and sustained reduction in alcohol use and heavy drinking days (HDDs) in patients with moderate to severe AUD out to 12 weeks.\n“We are encouraged by these exploratory results from Beckley Psytech, our strategic investment, which demonstrate the potential of short in-clinic psychedelic therapies to transform the treatment of substance use disorders,” stated Dr. Srinivas Rao, CEO and Co-founder of atai. “The high rates of sustained abstinence in this study are particularly promising given the significant challenges patients with alcohol use disorder face in achieving and maintaining abstinence. These findings add to the growing body of evidence supporting the potential of BPL-003 in treating serious mental health disorders. We look forward to the Phase 2b data readout of BPL-003 in treatment-resistant depression expected mid-year.”\nThe 12-week Phase 2a open-label study enrolled 12 patients with moderate to severe AUD and evaluated the safety, tolerability, pharmacodynamic effects and impact on alcohol use of a single dose of BPL-003, in combination with relapse prevention cognitive behavioral therapy (\nNCT05674929\n). The results demonstrated meaningful and sustained reductions in alcohol use following a single dose of BPL-003:\nMean number of alcohol units consumed per day decreased from 9.3 units to 2.2 units at Week 12\nMean percentage of HDDs, defined as consuming seven or more units of alcohol per day for women and nine or more units of alcohol per day for men, declined from 56% to 13% at Week 12\nMean number of abstinent days increased from 33% to 81% at Week 12\n50% of the patients remained completely abstinent through the 12-week study\nBPL-003 was shown to be well-tolerated with adverse events (AEs) being reported as mild or moderate and there were no serious or severe adverse events reported. Most patients were assessed as ready for discharge within approximately two hours.\nBeckley Psytech plans to evaluate future development options for BPL-003 in substance use disorders and anticipates reporting additional clinical data from this study in publications and conferences in 2025.\nAbout Alcohol Use Disorder (AUD)\nAUD is a medical condition characterized by an impaired ability to stop or control alcohol use despite adverse social, occupational, or health consequences. The World Health Organization estimates that around 400 million people suffer with AUD worldwide, with around 3 million deaths each year attributed to the harmful use of alcohol. Currently available pharmacological treatment options are not very effective and some people with alcohol use disorder who wish to abstain from, or reduce, alcohol consumption do not achieve their treatment goal with currently approved treatment options. This contributes to an unmet need for more effective medical treatments.\nAbout BPL-003\nBPL-003 is Beckley Psytech’s patent-protected synthetic intranasal 5-MeO-DMT benzoate formulation, designed to deliver rapid and durable effects from a single dose, with a short time in clinic. PL-003 is being investigated for treatment resistant depression (TRD) and for alcohol use disorder (AUD). In a Phase 2a study TRD study, a single 10mg dose of BPL-003 produced a rapid antidepressant response in 55% of patients at Day 1, with 55% of patients in remission at Day 29 and 45% in remission at Day 85. BPL-003 demonstrated a short treatment duration, with patients deemed ready to be discharged within an average of less than two hours. Topline Phase 2b data are anticipated mid-2025.\nAbout Beckley Psytech Ltd\nBeckley Psytech Ltd. is a private clinical-stage biopharmaceutical company dedicated to improving the lives of people with neuropsychiatric disorders through the development of rapid-acting, short-duration psychedelic medicines. In January 2024,\natai made a strategic investment in Beckley Psytech\n, resulting in a 35.5% ownership stake and 1:1 warrant coverage at a 30% premium on the primary issuances. atai holds a time-limited right of first refusal on a future sale of the company and an indefinite right of first negotiation for BPL-003 and ELE-101. atai and Beckley Psytech also agreed to collaborate on digital therapeutics, commercial and market access activities in preparation for future potential commercialization.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life. For more information, please visit\nwww.atai.life\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. All statements contained in this press release that do not relate to matters of historical fact should be considered forward-looking statements, including, without limitation, statements relating to our business strategy and plans; and the potential, success, cost and timing of development of our product candidates, and the product candidates of those companies we invest in, including the progress of preclinical and clinical trials and related milestones such as BPL-003 and related data readouts.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (SEC) on March 28, 2024, as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  },
  {
    "ticker": "ATAI",
    "title": "atai Life Sciences Announces Key Leadership Appointments as it Advances its Pipeline of Novel Psychedelic Therapeutics for Mental Health",
    "link": "https://www.globenewswire.com/news-release/2025/01/10/3007542/0/en/atai-Life-Sciences-Announces-Key-Leadership-Appointments-as-it-Advances-its-Pipeline-of-Novel-Psychedelic-Therapeutics-for-Mental-Health.html",
    "date": "January 10, 2025 07:00 ET",
    "text": "atai Life Sciences Announces Key Leadership Appointments as it Advances its Pipeline of Novel Psychedelic Therapeutics for Mental Health\nJanuary 10, 2025 07:00 ET\n| Source:\natai Life Sciences\nFollow\natai Life Sciences\nShare\n- Srinivas Rao\nM.D., Ph.D. succeeds as sole Chief Executive Officer\n- Kevin Craig, M.D. promoted to Chief Medical Officer\n- Glenn Short, Ph.D. promoted to Chief Scientific Officer\n- Gerd Kochendoerfer, Ph.D. joins as Chief Operating Officer\nNEW YORK and BERLIN, Jan.  10, 2025  (GLOBE NEWSWIRE) --\natai Life Sciences\n(NASDAQ: ATAI) (“atai” or “Company”), a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders, today announced key leadership appointments to advance its goal of delivering novel mental health therapeutics. Srinivas Rao M.D., Ph.D., has assumed the role of sole Chief Executive Officer (CEO), joined by the promotions of Kevin Craig, M.D., to Chief Medical Officer (CMO), Glenn Short, Ph.D., to Chief Scientific Officer (CSO) and the appointment of Gerd Kochendoerfer, Ph.D., as Chief Operating Officer (COO).\n“We have strengthened our leadership team at a pivotal time as we advance VLS-01 and EMP-01 into Phase 2 clinical trials,” stated Dr. Srinivas Rao, CEO and Co-founder of atai. “Kevin, Glenn and Gerd bring exceptional expertise that will further enhance our capabilities in clinical development, scientific innovation and operational excellence. It is a privilege to lead atai during this critical phase of our evolution, supported by a world-class team of biotech and pharmaceutical experts. As we continue to focus on executing our Phase 2 clinical trials, with VLS-01 now screening patients, we look forward to the Phase 2b data readout for Beckley Psytech’s BPL-003, anticipated mid-year. This is a key milestone and an important step towards the potential of commercially scalable short-duration psychedelic therapies for people with treatment-resistant depression.”\nAs announced in May 2024, Co-Founder Srinivas Rao, M.D., Ph.D., was promoted to Co-CEO effective June 1, 2024, and assumed the role of CEO on January 1, 2025. Dr. Rao has over 24 years of diverse biotechnology and pharmaceutical experience, having held the titles of Chief Scientific, Medical, and Executive Officer at companies ranging from venture-backed startups to vertically integrated, publicly traded pharmaceutical companies.\nKevin Craig, M.D., has been named CMO to head clinical development for VLS-01 (buccal film DMT) and EMP-01 (R-MDMA). Dr. Craig served as atai’s Senior Vice President of Clinical Development since July 2023 and he leads the entirety of atai’s clinical-stage research & development effort, clinical development, patient safety, clinical operations, regulatory affairs, biostatistics and all other clinical functions. Dr. Craig has been a member of atai’s leadership team since 2021, and he has over 20 years of clinical experience, with 13 years in the industry and a decade in clinical and academic settings. Prior to joining atai, he was Head of Early Clinical Development at Jazz Pharmaceuticals (formally GW Pharmaceuticals) where he was responsible for the design and execution of rapid decision-making clinical trials across the early neuroscience pipeline. Before joining the industry, Dr. Craig held a faculty appointment at the Behavioral and Clinical Neuroscience Institute at the University of Cambridge and has published widely on cognition and brain imaging in mental health. He received his medical degree from the University of the Witwatersrand, South Africa, and his MPhil from the University of Cambridge. He was trained in Psychiatry in Cambridge, UK and is a UK board-certified psychiatrist.\nGlenn Short, Ph.D., has been named CSO to lead atai’s research programs including discovery, nonclinical pharmacology, preclinical development and Chemistry, Manufacturing & Controls and to advance internally discovered, novel 5-HT2AR agonists with non-hallucinogenic potential. Dr. Short has served as Senior Vice President of Early Development since August 2022 and has been a member of atai’s leadership team since 2019. He has over 20 years of industry and research experience and has been involved in numerous programs that leverage cutting-edge biotechnologies to develop new therapies to address unmet medical needs in oncology, immunology, neurological disease, and pain. Dr. Short holds a Ph.D. in Chemistry from the University of Virginia and conducted his postdoctoral training in Molecular Biology at Massachusetts General Hospital/Harvard Medical School in Boston.\nGerd Kochendoerfer, Ph.D., has been named COO to foster strategic alignment and operational excellence as the company progresses its key clinical programs. Dr. Kochendoerfer has more than 25 years of experience in leadership roles across the pharmaceutical and biotech sectors. He has a strong track record in drug development, corporate development and team leadership. Dr. Kochendoerfer has led technology innovation, pipeline growth, and strategic alliances, as well as overseeing business operations and quality infrastructure. Prior to joining atai, he was COO at NFlection Therapeutics, Inc. and Senior VP and Head of Operations at PellePharm Inc., a BridgeBio company. He also held leadership positions at Depomed Inc., FibroGen Inc., and Gryphon Therapeutics, Inc. Dr. Kochendoerfer holds a Ph.D. in Chemistry from UC Berkeley, is an inventor on multiple patents and has published more than 25 papers in peer-reviewed literature.\nAbout VLS-01 (buccal film DMT)\nVLS-01 (VLS-01-BU) is a proprietary oral transmucosal film formulation of N,N-Dimethyltryptamine (DMT) applied to the buccal surface, being developed for people living with treatment-resistant depression (TRD). Pharmacologically, DMT is a partial agonist of the 5-HT 1A/2A/2C receptors, developed to induce a short duration of psychedelic effect. Clinical evidence suggests that administration of intravenous (IV) DMT results in rapid-acting and durable antidepressant effects in patients with major depressive disorder. The buccal film formulation is designed with the aim to eliminate the need for IV administration, provide improved pharmacokinetics (PK) compared to such route of administration, and maximize the therapeutic potential to fit into the established two-hour in-clinic treatment paradigm. atai is conducting a Phase 2, multicenter, double-blind, randomized, placebo-controlled, trial (\nNCT06524830\n) to assess the efficacy, safety and tolerability of multiple doses of VLS-01 in people with TRD. Topline data from the Phase 2 study is anticipated in the first quarter of 2026.\nAbout EMP-01 (R-MDMA)\nEMP-01 is a proprietary oral formulation of the R-enantiomer of 3,4-Methylenedioxymethamphetamine (MDMA) being developed for the treatment of social anxiety disorder (SAD). EMP-01's pharmacology is more targeted than racemic MDMA, preferentially targeting the serotonergic system with less activation of other biological targets associated with some side effects observed with racemic MDMA. In a Phase 1 clinical trial, EMP-01 was well-tolerated and found to produce subjective experiences and altered states that were more similar to those of classic psychedelics than racemic MDMA, with participants also reporting having an introspective experience, emotional breakthroughs, and increased self-compassion. atai plans to initiate an exploratory Phase 2a placebo-controlled clinical trial in the first quarter of 2025 to assess the safety and efficacy of two doses of EMP-01 in adults with SAD. Topline data from the Phase 2a study is anticipated in the first quarter of 2026.\nAbout atai Life Sciences\natai is a clinical-stage biopharmaceutical company aiming to transform the treatment of mental health disorders. The Company was founded in response to the significant unmet need and lack of innovation in the mental health treatment landscape. atai is dedicated to developing novel, evidence-based therapeutics to treat depression, anxiety and other mental health disorders. atai's vision is to heal mental health disorders so that everyone, everywhere can live a more fulfilled life. For more information, please visit\nwww.atai.life\n.\nForward-looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “initiate,” “could,” “would,” “project,” “plan,” “potentially,” “preliminary,” “likely,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these words. All statements contained in this press release that do not relate to matters of historical fact should be considered forward-looking statements, including, without limitation, statements relating to our expectations relating to management and our leadership team; our business strategy and plans; the potential, success, cost and timing of development of our product candidates, and the product candidates of those companies we invest in, including the progress of preclinical and clinical trials and related milestones such as VLS-01 and EMP-01 and the anticipated data readout for BPL-003; and the plans and objectives of management for future operations, research and development and capital expenditures.\nForward-looking statements are neither promises nor guarantees, but involve known and unknown risks and uncertainties that could cause actual results to differ materially from those projected, including, without limitation, the factors described in the section titled “Risk Factors” in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (SEC) on March 28, 2024, as such factors may be updated from time to time in atai's other filings with the SEC. atai disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by applicable law.\nContact Information\nInvestor Contact:\nIR@atai.life\nMedia Contact:\nPR@atai.life"
  }
]