[
  {
    "ticker": "CNTA",
    "title": "Centessa Pharmaceuticals Announces Clearance of Investigational New Drug Application (IND) for ORX142, a Novel Orexin Receptor 2 (OX2R) Agonist; Clinical Data in Acutely Sleep-Deprived Healthy Volunteers Planned for this Year",
    "link": "https://www.globenewswire.com/news-release/2025/06/16/3099897/0/en/Centessa-Pharmaceuticals-Announces-Clearance-of-Investigational-New-Drug-Application-IND-for-ORX142-a-Novel-Orexin-Receptor-2-OX2R-Agonist-Clinical-Data-in-Acutely-Sleep-Deprived-H.html",
    "date": "June 16, 2025 09:00 ET",
    "text": "Centessa Pharmaceuticals Announces Clearance of Investigational New Drug Application (IND) for ORX142, a Novel Orexin Receptor 2 (OX2R) Agonist; Clinical Data in Acutely Sleep-Deprived Healthy Volunteers Planned for this Year\nJune 16, 2025 09:00 ET\n| Source:\nCentessa Pharmaceuticals plc\nFollow\nCentessa Pharmaceuticals plc\nShare\nBOSTON and LONDON, June  16, 2025  (GLOBE NEWSWIRE) -- Centessa Pharmaceuticals plc (Nasdaq: CNTA), a clinical-stage pharmaceutical company, today announced that the U.S. Food and Drug Administration (FDA) has cleared the IND to initiate a Phase 1 clinical study of ORX142 in healthy volunteers. ORX142 is an investigational, novel, highly potent and selective OX2R agonist being developed for the treatment of select neurological and neurodegenerative disorders. ORX142 is the second drug candidate from the Company’s multi-asset orexin franchise.\n“The clearance of our IND to initiate clinical studies of ORX142 represents a significant milestone, signaling the beginning of an exciting new phase in the clinical development of our OX2R agonist pipeline for indications beyond rare hypersomnias,” said Saurabh Saha MD PhD, Chief Executive Officer of Centessa. “With our most advanced OX2R agonist, ORX750, advancing in the Phase 2a\nCRYSTAL-1\nstudy for the treatment of narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH), we are eager to leverage our insights from this new drug class and explore ORX142’s potential to treat a broad range of neurological and neurodegenerative disorders with significant unmet needs. We are excited to begin executing our ORX142 Phase 1 clinical study in acutely sleep-deprived healthy volunteers which is aimed at generating early proof-of-concept data for ORX142 this year which we expect to enable a dose selection for planned studies evaluating ORX142 in patients.”\nThe Phase 1 study will evaluate the safety, tolerability and pharmacokinetics of single-ascending doses (SAD) and multiple-ascending doses (MAD) of ORX142 in healthy volunteers. In parallel to the SAD, a placebo-controlled crossover pharmacodynamic (PD) assessment will be performed utilizing the Maintenance of Wakefulness Test (MWT) and Karolinska Sleepiness Scale (KSS) in acutely sleep-deprived healthy adult subjects. The Company plans to initiate the first-in-human Phase 1 clinical study imminently, with clinical data expected this year.\nAbout Centessa’s Orexin Receptor 2 (OX2R) Agonist Program\nOrexin is a neuropeptide that regulates the sleep-wake cycle, leading to arousal and promoting wakefulness. Targeting the orexin pathway with novel orexin receptor 2 (OX2R) agonists represents a promising approach to address excessive daytime sleepiness (EDS), impaired attention, cognitive deficits and fatigue associated with a broad range of neurological, neurodegenerative and neuropsychiatric disorders. Centessa is developing a pipeline of potential best-in-class OX2R agonists, including ORX750 for the treatment of sleep-wake disorders including narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH), ORX142 for the treatment of select neurological and neurodegenerative disorders, and ORX489 for the treatment of neuropsychiatric disorders. ORX750 is being evaluated in the Phase 2a\nCRYSTAL-1\nstudy. ORX750, ORX142 and ORX489 are investigational candidates and have not been approved by the FDA or any other regulatory authority.\nAbout Centessa Pharmaceuticals\nCentessa Pharmaceuticals, plc\nis a clinical-stage pharmaceutical company with a mission to discover, develop and ultimately deliver medicines that are transformational for patients. We are pioneering a new class of potential therapies within our orexin receptor 2 (OX2R) agonist program for the treatment of excessive daytime sleepiness (EDS), impaired attention, cognitive deficits, fatigue and other symptoms across neurological, neurodegenerative and neuropsychiatric disorders. We also have an early-stage immuno-oncology program focused on our novel LockBody\n®\ntechnology platform. For more information, visit\nwww.centessa.com\n, which does not form part of this release.\nForward Looking Statements\nThis press release contains forward-looking statements. These statements may be identified by words such as “may,” “might,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “objective,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “continue,” “ongoing,” “aim,” “seek,” and variations of these words or similar expressions that are intended to identify forward-looking statements. Any such statements in this press release that are not statements of historical fact may be deemed to be forward-looking statements, including statements related to the Company’s ability to discover and develop transformational medicines for patients; its expectations for executing on the Company's pipeline; its expectations on its anticipated cash runway; the timing of commencement of new studies or clinical trials or clinical and preclinical data related to ORX750, ORX142, ORX489 and other OX2R agonist molecules, and the LockBody technology platform; its ability to identify, screen, recruit and maintain a sufficient number of or any subjects in its existing and anticipated studies or clinical trials of ORX750, ORX142, ORX489 and other OX2R agonist molecules, and any LockBody candidates; its expectations on executing its research and clinical development plans and the timing thereof; its expectations as to the potential results and impact of each of its clinical programs and trials; the Company’s ability to differentiate ORX750, ORX142, ORX489 and other OX2R agonist molecules, any LockBody candidates from other treatment options; the development, design and therapeutic potential of ORX750, ORX142, ORX489 and other OX2R agonist molecules, and the LockBody technology platform; and regulatory matters, including the timing and likelihood of success of obtaining regulatory clearance, obtaining authorizations to initiate or continue clinical trials. Any forward-looking statements in this press release are based on our current expectations, estimates, assumptions and projections only as of the date of this release and are subject to a number of risks and uncertainties that could cause actual results to differ materially and adversely from those set forth in or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, risks related to the safety and tolerability profile of our product candidates; our ability to identify, screen and recruit a sufficient number of or any subjects in our existing and anticipated new studies or clinical trials of ORX750, ORX142, ORX489 or within anticipated timelines; our expectations relating to the clinical trials of ORX750, including the predicted timing of enrollment, the predicted efficacious doses of ORX750 and our ability to successfully conduct our clinical development of ORX750, our ability to protect and maintain our intellectual property position; business (including commercial viability), regulatory, economic and competitive risks, uncertainties, contingencies and assumptions about the Company; risks inherent in developing product candidates and technologies; future results from our ongoing and planned clinical trials; our ability to obtain adequate financing, including through our financing facility with Oxford Finance, to fund our planned clinical trials and other expenses; trends in the industry; the legal and regulatory framework for the industry, including the receipt and maintenance of clearances to conduct or continue clinical testing; our operating costs and use of cash, including cash runway, cost of development activities and conducting clinical trials, future expenditures risks; the risk that any one or more of our product candidates will not be successfully developed and/or commercialized; the risk that the historical results of preclinical studies or clinical studies will not be predictive of future results in ongoing or future studies; economic risks to the United States and United Kingdom banking systems; and geo-political risks such as the Russia-Ukraine war or the Middle East conflicts. These and other risks concerning our programs and operations are described in additional detail in our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and our other reports, which are on file with the U.S. Securities and Exchange Commission (SEC). We explicitly disclaim any obligation to update any forward-looking statements except to the extent required by law.\nContact:\nKristen K. Sheppard, Esq.\nSVP of Investor Relations\ninvestors@centessa.com"
  },
  {
    "ticker": "CNTA",
    "title": "Centessa Pharmaceuticals to Participate in Upcoming Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/05/19/3083941/0/en/Centessa-Pharmaceuticals-to-Participate-in-Upcoming-Investor-Conferences.html",
    "date": "May 19, 2025 08:00 ET",
    "text": "Centessa Pharmaceuticals to Participate in Upcoming Investor Conferences\nMay 19, 2025 08:00 ET\n| Source:\nCentessa Pharmaceuticals plc\nFollow\nCentessa Pharmaceuticals plc\nShare\nBOSTON and LONDON, May  19, 2025  (GLOBE NEWSWIRE) --\nCentessa Pharmaceuticals plc\n(Nasdaq: CNTA), a clinical-stage pharmaceutical company that aims to discover and develop transformational medicines for patients, today announced that members of its management team will participate in the following investor conferences:\nEvent:\nJefferies 2025 Global Healthcare Conference\nDate:\nJune 4, 2025\nFireside Chat:\n11:40 AM ET\nEvent:\nGoldman Sachs 46\nth\nAnnual Global Healthcare Conference\nDate:\nJune 10, 2025\nFireside Chat\n: 9:20 AM ET\nAccess to the live webcasts of these events, as well as archived recordings, will be available under the “Events and Publications” tab on the investor relations section of the Centessa Pharmaceuticals website at\nhttps://investors.centessa.com/\n.\nAbout Centessa Pharmaceuticals\nCentessa Pharmaceuticals, plc\nis a clinical-stage pharmaceutical company with a mission to discover, develop and ultimately deliver medicines that are transformational for patients. We are pioneering a new class of potential therapies within our orexin receptor 2 (OX2R) agonist program for the treatment of excessive daytime sleepiness (EDS), impaired attention, cognitive deficits and fatigue across neurological, neurodegenerative and neuropsychiatric disorders. We also have an early-stage immuno-oncology program focused on our novel LockBody\n®\ntechnology platform. For more information, visit\nwww.centessa.com\n, which does not form part of this release.\nContact:\nKristen K. Sheppard, Esq.\nSVP of Investor Relations\ninvestors@centessa.com"
  },
  {
    "ticker": "CNTA",
    "title": "Centessa Pharmaceuticals Reports Financial Results and Business Highlights for the First Quarter of 2025",
    "link": "https://www.globenewswire.com/news-release/2025/05/14/3081000/0/en/Centessa-Pharmaceuticals-Reports-Financial-Results-and-Business-Highlights-for-the-First-Quarter-of-2025.html",
    "date": "May 14, 2025 07:00 ET",
    "text": "Centessa Pharmaceuticals Reports Financial Results and Business Highlights for the First Quarter of 2025\nMay 14, 2025 07:00 ET\n| Source:\nCentessa Pharmaceuticals plc\nFollow\nCentessa Pharmaceuticals plc\nShare\nAdvancing a broad, potential best-in-class orexin receptor 2 (OX2R) agonist franchise, with key data readouts expected this year\nORX750 Phase 2a CRYSTAL-1 study for the treatment of narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH) on track with data expected across all three indications this year with first-in-class potential in NT2 and IH\nORX142 on track to initiate first-in-human studies for the treatment of neurological and neurodegenerative disorders with clinical data in acutely sleep-deprived healthy volunteers planned for this year\nORX489 advancing in IND-enabling studies for the treatment of neuropsychiatric disorders\nBOSTON and LONDON, May  14, 2025  (GLOBE NEWSWIRE) --\nCentessa Pharmaceuticals plc\n(Nasdaq: CNTA), a clinical-stage pharmaceutical company, today reported financial results and business highlights for the first quarter ended March 31, 2025.\n“This was a productive quarter for Centessa, marked by steady progress across our OX2R agonist pipeline,” said Saurabh Saha MD PhD, Chief Executive Officer of Centessa. “The orexin pathway represents a promising new frontier in neuroscience, with the potential to address not only sleep-wake disorders, but also excessive daytime sleepiness in a broad spectrum of neurological, neurodegenerative and neuropsychiatric disorders, as well as impaired attention, cognitive deficits and fatigue.”\nDr. Saha continued, “We are excited to be at the forefront of developing OX2R agonists starting with ORX750, our most advanced OX2R agonist for the treatment of NT1, NT2 and IH. ORX750 is progressing in the Phase 2a\nCRYSTAL-1\nstudy and is on track with patient data expected across all three indications this year. Given the unmet patient need for new treatment options, the team is intensely focused on execution to carry this momentum forward into registrational studies, as quickly as possible.”\n“In parallel, we continue to advance our pipeline of potential first-in-class follow-up OX2R agonists for the treatment of neurological, neurodegenerative and neuropsychiatric disorders. More specifically, we are on track to initiate first-in-human studies of ORX142 with clinical data in acutely sleep-deprived healthy volunteers planned for this year. With multiple data readouts expected across our OX2R agonist pipeline, we believe this will be another transformative year for Centessa and for the OX2R agonist class overall,” said Dr. Saha.\nRecent Highlights\nIn April 2025, additional data from the Phase 1 study of ORX750 were presented in a poster session at the American Academy of Neurology (AAN) Annual Meeting. In addition to showing previously disclosed Phase 1 data, the poster featured the time-course curves of the Maintenance of Wakefulness Test (MWT) and Karolinska Sleepiness Scale (KSS) results from the 5.0 mg dose cohort. These data showed that at the 5.0 mg dose sustained effects were observed throughout the 8-hour post dose observation period in both mean sleep latency on the MWT (>30 minutes) and in KSS scores, compared to placebo. The Company believes that the totality of the Phase 1 data continues to support ORX750’s profile as a potential best-in-class OX2R agonist for the treatment of NT1, NT2 and IH, with first-in-class potential in NT2 and IH.\nOX2R Agonist Pipeline and Anticipated Upcoming Milestones\nORX750\n: The Phase 2a\nCRYSTAL-1\nstudy is ongoing in participants with NT1, NT2 and IH, with data from all three indications planned in 2025.\nORX142\n: Subject to IND clearance, the Company plans to initiate first-in-human studies with the goal of sharing clinical data in acutely sleep-deprived healthy volunteers in 2025.\nORX489\n: Currently in IND-enabling studies.\nFirst Quarter 2025 Financial Results\nCash, Cash Equivalents and Investments\n: Cash, cash equivalents and investments totaled $424.9 million as of March 31, 2025. The Company expects its cash, cash equivalents and investments as of March 31, 2025 will fund operations into mid-2027.\nResearch & Development (R&D) Expenses\n: R&D expenses were $33.4 million for the first quarter ended March 31, 2025, compared to $22.7 million for the first quarter ended March 31, 2024.\nGeneral & Administrative (G&A) Expenses\n: G&A expenses were $12.3 million for the first quarter ended March 31, 2025, compared to $13.4 million for the first quarter ended March 31, 2024.\nNet Loss Attributable to Ordinary Shareholders (Net loss)\n: Net loss was $26.1 million for the first quarter ended March 31, 2025, compared to $38.0 million for the first quarter ended March 31, 2024.\nAbout Phase 2a\nCRYSTAL-1\nClinical Study of ORX750\nThe Phase 2a CRYSTAL-1 study is a randomized, double-blind, placebo-controlled, cross-over basket study to evaluate the safety, tolerability and pharmacokinetics (PK) of ORX750 in participants with NT1, NT2 and IH. Efficacy assessments will evaluate the effect of ORX750 on excessive daytime sleepiness (using the MWT and Epworth Sleepiness Scale (ESS)), cataplexy (NT1 only) and overall symptom improvement (measured by Narcolepsy Severity Scale (NSS) and Idiopathic Hypersomnia Severity Scale (IHSS)). Other exploratory assessments include measures of sleep, cognition, attention, memory and general health. For more information, visit\nhttps://clinicaltrials.gov/study/NCT06752668\n.\nAbout Centessa Pharmaceuticals\nCentessa Pharmaceuticals, plc\nis a clinical-stage pharmaceutical company with a mission to discover, develop and ultimately deliver medicines that are transformational for patients. We are pioneering a new class of potential therapies within our orexin receptor 2 (OX2R) agonist program for the treatment of excessive daytime sleepiness (EDS), impaired attention, cognitive deficits and fatigue across neurological, neurodegenerative and neuropsychiatric disorders. We also have an early-stage immuno-oncology program focused on our novel LockBody\n®\ntechnology platform. For more information, visit www.centessa.com, which does not form part of this release.\nForward Looking Statements\nThis press release contains forward-looking statements. These statements may be identified by words such as “may,” “might,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “objective,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “continue,” “ongoing,” “aim,” “seek,” and variations of these words or similar expressions that are intended to identify forward-looking statements. Any such statements in this press release that are not statements of historical fact may be deemed to be forward-looking statements, including statements related to the Company’s ability to discover and develop transformational medicines for patients; its expectations for executing on the Company's pipeline; its expectations on its anticipated cash runway; the timing of commencement of new studies or clinical trials or clinical and preclinical data related to ORX750, ORX142, ORX489 and other OX2R agonist molecules, and the LockBody technology platform; its ability to identify, screen, recruit and maintain a sufficient number of or any subjects in its existing and anticipated studies or clinical trials of ORX750, ORX142, ORX489 and other OX2R agonist molecules, and any LockBody candidates; its expectations on executing its research and clinical development plans and the timing thereof; its expectations as to the potential results and impact of each of its clinical programs and trials; the Company’s ability to differentiate ORX750, ORX142, ORX489 and other OX2R agonist molecules, any LockBody candidates from other treatment options; the development, design and therapeutic potential of ORX750, ORX142, ORX489 and other OX2R agonist molecules, and the LockBody technology platform; and regulatory matters, including the timing and likelihood of success of obtaining regulatory clearance, obtaining authorizations to initiate or continue clinical trials. Any forward-looking statements in this press release are based on our current expectations, estimates, assumptions and projections only as of the date of this release and are subject to a number of risks and uncertainties that could cause actual results to differ materially and adversely from those set forth in or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, risks related to the safety and tolerability profile of our product candidates; our ability to identify, screen and recruit a sufficient number of or any subjects in our existing and anticipated new studies or clinical trials of ORX750, ORX142, ORX489 or within anticipated timelines; our expectations relating to the clinical trials of ORX750, including the predicted timing of enrollment, the predicted efficacious doses of ORX750 and our ability to successfully conduct our clinical development of ORX750, our ability to protect and maintain our intellectual property position; business (including commercial viability), regulatory, economic and competitive risks, uncertainties, contingencies and assumptions about the Company; risks inherent in developing product candidates and technologies; future results from our ongoing and planned clinical trials; our ability to obtain adequate financing, including through our financing facility with Oxford Finance, to fund our planned clinical trials and other expenses; trends in the industry; the legal and regulatory framework for the industry, including the receipt and maintenance of clearances to conduct or continue clinical testing; our operating costs and use of cash, including cash runway, cost of development activities and conducting clinical trials, future expenditures risks; the risk that any one or more of our product candidates will not be successfully developed and/or commercialized; the risk that the historical results of preclinical studies or clinical studies will not be predictive of future results in ongoing or future studies; economic risks to the United States and United Kingdom banking systems; and geo-political risks such as the Russia-Ukraine war, the Middle East conflicts or trade wars and imposition of tariffs. These and other risks concerning our programs and operations are described in additional detail in our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and our other reports, which are on file with the U.S. Securities and Exchange Commission (SEC). We explicitly disclaim any obligation to update any forward-looking statements except to the extent required by law.\nContact:\nKristen K. Sheppard, Esq.\nSVP of Investor Relations\ninvestors@centessa.com\nCentessa Pharmaceuticals plc\nConsolidated Statements of Operations and Comprehensive Loss\n(unaudited)\n(amounts in thousands except share and per share data)\nThree Months Ended\nMarch 31, 2025\nThree Months Ended\nMarch 31, 2024\nLicense and other revenue\n$\n15,000\n$\n—\nOperating expenses:\nResearch and development\n33,443\n22,652\nGeneral and administrative\n12,334\n13,438\nLoss from operations\n(30,777\n)\n(36,090\n)\nInterest and investment income\n7,890\n2,591\nInterest expense\n(2,877\n)\n(2,529\n)\nOther non-operating income (expense), net\n1,026\n(1,537\n)\nLoss before income taxes\n(24,738\n)\n(37,565\n)\nIncome tax expense\n1,397\n481\nNet loss\n(26,135\n)\n(38,046\n)\nOther comprehensive (loss) income:\nForeign currency translation adjustment\n643\n(25\n)\nUnrealized gain on available for sale marketable securities, net of reclassification adjustment and tax\n(2,781\n)\n155\nOther comprehensive (loss) income\n(2,138\n)\n130\nTotal comprehensive loss\n$\n(28,273\n)\n$\n(37,916\n)\nNet loss per ordinary share - basic and diluted\n$\n(0.20\n)\n$\n(0.38\n)\nWeighted average ordinary shares outstanding - basic and diluted\n133,033,541\n99,887,720\nCentessa Pharmaceuticals plc\nCondensed Consolidated Balance Sheets\n(unaudited)\n(amounts in thousands)\nMarch 31, 2025\nDecember 31, 2024\nTotal assets:\nCash and cash equivalents\n$\n105,156\n$\n383,221\nInvestments in marketable securities\n319,744\n98,956\nOther assets\n102,945\n94,621\nTotal assets\n$\n527,845\n$\n576,798\nTotal liabilities\nOther liabilities\n$\n32,346\n$\n66,313\nLong term debt\n109,252\n108,940\nTotal liabilities\n141,598\n175,253\nTotal shareholders’ equity\n386,247\n401,545\nTotal liabilities and shareholders' equity\n$\n527,845\n$\n576,798"
  },
  {
    "ticker": "CNTA",
    "title": "Centessa Pharmaceuticals Reports Business Highlights and Financial Results for the Fourth Quarter and Full-Year 2024",
    "link": "https://www.globenewswire.com/news-release/2025/03/24/3047715/0/en/Centessa-Pharmaceuticals-Reports-Business-Highlights-and-Financial-Results-for-the-Fourth-Quarter-and-Full-Year-2024.html",
    "date": "March 24, 2025 07:00 ET",
    "text": "Centessa Pharmaceuticals Reports Business Highlights and Financial Results for the Fourth Quarter and Full-Year 2024\nMarch 24, 2025 07:00 ET\n| Source:\nCentessa Pharmaceuticals plc\nFollow\nCentessa Pharmaceuticals plc\nShare\nAdvancing a broad, potential best-in-class orexin receptor 2 (OX2R) agonist franchise with key data readouts expected in 2025\nORX750 Phase 2a CRYSTAL-1 study for the treatment of narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH) well underway and on track with data expected across all three indications in 2025 with first-in-class potential in NT2 and IH\nORX142 in IND-enabling studies for the treatment of neurological and neurodegenerative disorders; Clinical data in acutely sleep-deprived healthy volunteers planned for 2025\nORX489 in IND-enabling studies for the treatment of neuropsychiatric disorders\nBOSTON and LONDON, March  24, 2025  (GLOBE NEWSWIRE) --\nCentessa Pharmaceuticals plc\n(Nasdaq: CNTA), a clinical-stage pharmaceutical company, today reported recent business highlights and financial results for the fourth quarter and full-year ended December 31, 2024.\n“Centessa is proud to be at the forefront of developing OX2R agonists, a groundbreaking new drug class with the potential to transform the standard of care for patients across multiple therapeutic areas,” said Saurabh Saha MD PhD, Chief Executive Officer of Centessa. “Our team’s drug optimization techniques have enabled a growing pipeline of novel, potential best-in-class OX2R agonists aimed at restoring normative wakefulness for individuals living with excessive daytime sleepiness (EDS) in neurological, neurodegenerative and neuropsychiatric disorders, and potentially addressing other key symptoms such as impaired attention, cognitive deficits and fatigue.”\nDr. Saha continued, “Our most advanced OX2R agonist, ORX750, is progressing in the Phase 2a\nCRYSTAL-1\nstudy for the treatment of NT1, NT2 and IH, and is on track with data expected across all three indications this year. Data from the Phase 1 study of ORX750 showed compelling activity in acutely sleep-deprived healthy volunteers at low doses with a favorable initial safety and tolerability profile. Based on the strength of these data, we believe ORX750 has the potential to be best-in-class and to enable the full range of doses required to meet the needs of patients living with NT1, NT2 and IH. We look forward to sharing data this year and expect the Phase 2a study to enable dose selection for future registrational studies of ORX750.”\nDr. Saha concluded, “In addition to the transformational potential of ORX750 for individuals living with sleep-wake disorders, we see tremendous opportunity with our follow-up OX2R agonists that are being advanced for the treatment of EDS, impaired attention, cognitive deficits and fatigue in neurological, neurodegenerative and neuropsychiatric disorders. ORX142 is progressing in IND-enabling studies, and subject to IND clearance, we expect to initiate clinical development and share clinical data in acutely sleep-deprived healthy volunteers this year. We are also pleased to have ORX489, our most potent OX2R agonist to date based on preclinical data, advancing in IND-enabling studies. With this ongoing momentum across our pipeline, we expect 2025 to be an exciting, data-rich year for Centessa.”\nRecent Highlights\nIn January 2025, the Company shared positive data from the Phase 1 clinical study of ORX750, a highly potent and selective OX2R agonist, in healthy volunteers as of December 5, 2024, the most recent data cutoff date. These data showed ORX750 significantly increased wakefulness in acutely sleep-deprived healthy volunteers compared to placebo at all doses tested, with a clear dose response. More specifically, in the 2.5 mg (n=8), 3.5 mg (n=10) and 5.0 mg (n=8) dose cohorts, ORX750 was shown to restore normative wakefulness with mean sleep latencies (MSL) >30 minutes (out of a score of 40 minutes) as measured by the Maintenance of Wakefulness Test (MWT); the 5.0 mg dose cohort achieved an MSL of 38 minutes, compared to 15 minutes for placebo. A favorable safety and tolerability profile was observed with all treatment-emergent adverse events (AEs) being transient with none leading to treatment discontinuation. There were no cases of hepatotoxicity or visual disturbances observed. Additionally, there were no clinically significant treatment-emergent changes in hepatic and renal parameters, vital signs or ECG parameters. These data also showed linear pharmacokinetics (PK) with a profile that supports the use of ORX750 as a once-daily oral dosing regimen with rapid absorption. The Company believes these data continue to support ORX750’s profile as a potential best-in-class OX2R agonist for the treatment of NT1, NT2 and IH, with first-in-class potential in NT2 and IH. Data from the Phase 1 study of ORX750 will be presented in a poster session at the American Academy of Neurology (AAN) Annual Meeting on April 5, 2025.\nIn November 2024, the Company announced the initiation of the Phase 2a\nCRYSTAL-1\nstudy of ORX750 in participants with NT1, NT2 and IH.\nPipeline and Anticipated Upcoming Milestones\nORX750\n: Phase 2a\nCRYSTAL-1\nstudy ongoing in participants with NT1, NT2 and IH. The Company expects to share Phase 2a data across all three indications in 2025. In addition, data from the Phase 1 study will be presented in a poster session at the AAN Annual Meeting on April 5, 2025.\nORX142\n: Advancing through IND-enabling studies. The Company is focused on obtaining IND clearance and initiating clinical development with the goal of sharing clinical data in acutely sleep-deprived healthy volunteers in 2025.\nORX489\n: Advancing in IND-enabling studies.\nFourth Quarter and Full-Year 2024 Financial Results\nCash, Cash Equivalents and Short-term Investments\n: Cash, cash equivalents and short-term investments totaled $482.2 million as of December 31, 2024. The Company expects its cash, cash equivalents and short-term investments as of December 31, 2024 will fund operations into mid-2027.\nResearch & Development (R&D) Expenses\n: R&D expenses were $60.9 million for the fourth quarter ended December 31, 2024, compared to $29.7 million for the fourth quarter ended December 31, 2023, and $150.2 million for the full-year 2024 compared to $124.4 million for the full-year 2023. R&D expenses for the quarter and full-year 2024 included a one-time charge of $31.5 million related to the discontinuation of the global clinical development program for SerpinPC that was being progressed for the treatment of hemophilia B.\nGeneral & Administrative Expenses\n: General and administrative expenses were $13.7 million for the fourth quarter ended December 31, 2024, compared to $12.3 million the fourth quarter ended December 31, 2023, and $50.8 million for the full-year 2024 compared to $53.7 million for the full-year 2023.\nNet Loss Attributable to Ordinary Shareholders (Net loss)\n: Net loss was $111.3 million for the fourth quarter ended December 31, 2024, compared to $36.8 million for the fourth quarter ended December 31, 2023, and $235.8 million for the full-year 2024 compared to $151.1 million for the full-year 2023. Net loss for the quarter and full-year 2024 reflects non-recurring items including a $34.1 million loss on debt extinguishment and a charge of $31.5 million related to the discontinuation of the global clinical development program for SerpinPC which was included in R&D expenses. In addition, net loss for full-year 2023 included a non-recurring non-cash tax benefit of $24.2 million.\nAbout the Phase 2a\nCRYSTAL-1\nClinical Study of ORX750\nThe Phase 2a\nCRYSTAL-1\nstudy is a randomized, double-blind, placebo-controlled, cross-over basket study to evaluate the safety, tolerability, and PK of ORX750 in participants with NT1, NT2 and IH. There are separate cohorts for each indication. Initial dosing is 1.0 mg for NT1 and 2.0 mg for NT2 and IH with sequential dose escalation/de-escalation between cohorts. Each dosing cohort consists of a 6-week treatment duration with crossover study design. During the 6 weeks of treatment, each participant will be randomized to one of two blinded treatment sequences and receive a total of 4 weeks of treatment with ORX750 and 2 weeks of treatment with placebo. Efficacy assessments will evaluate the effect of ORX750 on excessive daytime sleepiness (using the MWT and Epworth Sleepiness Scale (ESS)), cataplexy (NT1 only) and overall symptom improvement (measured by Narcolepsy Severity Scale (NSS) and Idiopathic Hypersomnia Severity Scale (IHSS)). Other exploratory assessments include measures of sleep, cognition, attention, memory and general health.\nAbout Centessa Pharmaceuticals\nCentessa Pharmaceuticals, plc\nis a clinical-stage pharmaceutical company with a mission to discover, develop and ultimately deliver medicines that are transformational for patients. We are pioneering a new class of potential therapies within our orexin receptor 2 (OX2R) agonist program for the treatment of excessive daytime sleepiness (EDS), impaired attention, cognitive deficits and fatigue across neurological, neurodegenerative and neuropsychiatric disorders. We also have an early-stage immuno-oncology program focused on our novel LockBody® technology platform. For more information, visit\nwww.centessa.com\n, which does not form part of this release.\nForward Looking Statements\nThis press release contains forward-looking statements. These statements may be identified by words such as “may,” “might,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “objective,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “continue,” “ongoing,” “aim,” “seek,” and variations of these words or similar expressions that are intended to identify forward-looking statements. Any such statements in this press release that are not statements of historical fact may be deemed to be forward-looking statements, including statements related to the Company’s ability to discover and develop transformational medicines for patients; its expectations for executing on the Company's pipeline; its expectations on its anticipated cash runway; the timing of commencement of new studies or clinical trials or clinical and preclinical data related to ORX750, ORX142, ORX489 and other OX2R agonist molecules, and the LockBody technology platform; its ability to identify, screen, recruit and maintain a sufficient number of or any subjects in its existing and anticipated studies or clinical trials of ORX750, ORX142, ORX489 and other OX2R agonist molecules, and any LockBody candidates; its expectations on executing its research and clinical development plans and the timing thereof; its expectations as to the potential results and impact of each of its clinical programs and trials; the Company’s ability to differentiate ORX750, ORX142, ORX489 and other OX2R agonist molecules, any LockBody candidates from other treatment options; the development, design and therapeutic potential of ORX750, ORX142, ORX489 and other OX2R agonist molecules, and the LockBody technology platform; the anticipated net savings associated with the discontinuation of the SerpinPC program; and regulatory matters, including the timing and likelihood of success of obtaining regulatory clearance, obtaining authorizations to initiate or continue clinical trials. Any forward-looking statements in this press release are based on our current expectations, estimates, assumptions and projections only as of the date of this release and are subject to a number of risks and uncertainties that could cause actual results to differ materially and adversely from those set forth in or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, risks related to the safety and tolerability profile of our product candidates; our ability to identify, screen and recruit a sufficient number of or any subjects in our existing and anticipated new studies or clinical trials of ORX750, ORX142, ORX489 or within anticipated timelines; our expectations relating to the clinical trials of ORX750, including the predicted timing of enrollment, the predicted efficacious doses of ORX750 and our ability to successfully conduct our clinical development of ORX750, our ability to protect and maintain our intellectual property position; business (including commercial viability), regulatory, economic and competitive risks, uncertainties, contingencies and assumptions about the Company; risks inherent in developing product candidates and technologies; future results from our ongoing and planned clinical trials; our ability to obtain adequate financing, including through our financing facility with Oxford Finance, to fund our planned clinical trials and other expenses; trends in the industry; the legal and regulatory framework for the industry, including the receipt and maintenance of clearances to conduct or continue clinical testing; our operating costs and use of cash, including cash runway, cost of development activities and conducting clinical trials, future expenditures risks; the risk that any one or more of our product candidates will not be successfully developed and/or commercialized; the risk that the historical results of preclinical studies or clinical studies will not be predictive of future results in ongoing or future studies; economic risks to the United States and United Kingdom banking systems; and geo-political risks such as the Russia-Ukraine war or the Middle East conflicts. These and other risks concerning our programs and operations are described in additional detail in our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and our other reports, which are on file with the U.S. Securities and Exchange Commission (SEC). We explicitly disclaim any obligation to update any forward-looking statements except to the extent required by law.\nContact:\nKristen K. Sheppard, Esq.\nSVP of Investor Relations\ninvestors@centessa.com\nCentessa Pharmaceuticals plc\nConsolidated Statements of Operations and Comprehensive Loss\n(unaudited)\n(amounts in thousands except share and per share data)\nQuarter Ended\nDecember 31, 2024\nQuarter Ended\nDecember 31, 2023\nYear Ended\nDecember 31, 2024\nYear Ended\nDecember 31, 2023\nLicense and other revenue\n$\n—\n$\n6,853\n$\n—\n$\n6,853\nOperating expenses:\nResearch and development\n60,874\n29,716\n150,244\n124,405\nGeneral and administrative\n13,706\n12,315\n50,811\n53,731\nLoss from operations\n(74,580\n)\n(35,178\n)\n(201,055\n)\n(171,283\n)\nInterest income\n4,845\n2,933\n14,016\n10,476\nInterest expense\n(2,479\n)\n(2,570\n)\n(10,090\n)\n(9,906\n)\nLoss on extinguishment of debt\n(34,097\n)\n—\n(34,097\n)\n—\nOther non-operating expenses, net\n(3,968\n)\n(878\n)\n(1,687\n)\n(5,428\n)\nLoss before income taxes\n(110,279\n)\n(35,693\n)\n(232,913\n)\n(176,141\n)\nIncome tax expense (benefit)\n1,050\n1,144\n2,844\n(25,056\n)\nNet loss\n(111,329\n)\n(36,837\n)\n(235,757\n)\n(151,085\n)\nOther comprehensive income:\nForeign currency translation adjustment\n1,721\n459\n1,223\n1,700\nUnrealized gain on available for sale securities, net of tax\n397\n255\n1,497\n1,290\nOther comprehensive income\n2,118\n714\n2,720\n2,990\nTotal comprehensive loss\n$\n(109,211\n)\n$\n(36,123\n)\n$\n(233,037\n)\n$\n(148,095\n)\nNet loss per ordinary share - basic and diluted\n$\n(0.84\n)\n$\n(0.38\n)\n$\n(2.06\n)\n$\n(1.57\n)\nWeighted average ordinary shares outstanding - basic and diluted\n132,050,271\n97,923,585\n114,473,449\n96,177,578\nCentessa Pharmaceuticals plc\nCondensed Consolidated Balance Sheets\n(unaudited)\n(amounts in thousands)\nDecember 31, 2024\nDecember 31, 2023\nTotal assets:\nCash and cash equivalents\n$\n383,221\n$\n128,030\nShort-term investments\n98,956\n128,519\nOther assets\n94,621\n103,697\nTotal assets\n$\n576,798\n$\n360,246\nTotal liabilities\nOther liabilities\n$\n66,313\n$\n48,302\nLong term debt\n108,940\n75,700\nTotal liabilities\n175,253\n124,002\nTotal shareholders’ equity\n401,545\n236,244\nTotal liabilities and shareholders' equity\n$\n576,798\n$\n360,246"
  },
  {
    "ticker": "CNTA",
    "title": "Centessa Pharmaceuticals Announces Poster Presentation of Phase 1 Clinical Data for ORX750, a novel orexin receptor 2 (OX2R) agonist, at the American Academy of Neurology (AAN) 2025 Annual Meeting",
    "link": "https://www.globenewswire.com/news-release/2025/03/06/3038635/0/en/Centessa-Pharmaceuticals-Announces-Poster-Presentation-of-Phase-1-Clinical-Data-for-ORX750-a-novel-orexin-receptor-2-OX2R-agonist-at-the-American-Academy-of-Neurology-AAN-2025-Annu.html",
    "date": "March 06, 2025 16:14 ET",
    "text": "Centessa Pharmaceuticals Announces Poster Presentation of Phase 1 Clinical Data for ORX750, a novel orexin receptor 2 (OX2R) agonist, at the American Academy of Neurology (AAN) 2025 Annual Meeting\nMarch 06, 2025 16:14 ET\n| Source:\nCentessa Pharmaceuticals plc\nFollow\nCentessa Pharmaceuticals plc\nShare\nBOSTON and LONDON, March  06, 2025  (GLOBE NEWSWIRE) --\nCentessa Pharmaceuticals\nplc (Nasdaq: CNTA), a clinical-stage pharmaceutical company that aims to discover and develop medicines that are transformational for patients, today announced that data from the Phase 1 clinical trial of ORX750, an investigational novel highly potent and selective OX2R agonist being progressed for the treatment of narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH), will be presented in a poster session at the American Academy of Neurology (AAN) 2025 Annual Meeting being held April 5-9, 2025, in San Diego, CA. ORX750 is being evaluated in an ongoing Phase 2a clinical trial (\nCRYSTAL-1\n) in participants with NT1, NT2 and IH.\nDetails of the poster presentation are as follows:\nTitle:\nPhase 1 Clinical Data with Orexin Receptor 2 (OX2R) Agonist, ORX750, in Acutely Sleep-Deprived Healthy Participants\nAbstract Number:\n2277\nPresenter:\nDeborah Hartman, PhD, Global Scientific Head, Orexin Program\nSession Date and Time:\nSaturday, April 5, 2025, at 11:45 AM- 12:45 PM PT\nCentessa’s booth number is 627. AAN abstracts are available on the conference website. Centessa’s poster will be available on the Centessa website at\nhttps://investors.centessa.com/events-presentations\nafter the poster presentation concludes.\nAbout Centessa Pharmaceuticals\nCentessa Pharmaceuticals\nplc is a clinical-stage pharmaceutical company that aims to discover and develop medicines that are transformational for patients. We are developing potential best-in-class orexin receptor 2 (OX2R) agonists intended to be orally administered for the treatment of sleep-wake disorders including narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH), and excessive daytime sleepiness (EDS) in neurological, neurodegenerative, and psychiatric conditions. We also anticipate that our OX2R agonists may have utility in treating impaired attention, cognitive deficits, fatigue, and other symptoms. Our earlier stage pipeline is focused on immuno-oncology with our proprietary LockBody\n®\ntechnology platform.\nContact:\nKristen K. Sheppard, Esq.\nSVP of Investor Relations\ninvestors@centessa.com"
  },
  {
    "ticker": "CNTA",
    "title": "EnWave Reports 2025 First Quarter Consolidated Interim Financial Results",
    "link": "https://www.globenewswire.com/news-release/2025/02/24/3031202/0/en/EnWave-Reports-2025-First-Quarter-Consolidated-Interim-Financial-Results.html",
    "date": "February 24, 2025 09:00 ET",
    "text": "EnWave Reports 2025 First Quarter Consolidated Interim Financial Results\nFebruary 24, 2025 09:00 ET\n| Source:\nEnWave Corporation\nFollow\nEnWave Corporation\nShare\nVANCOUVER, British Columbia, Feb.  24, 2025  (GLOBE NEWSWIRE) --\nEnWave Corporation (TSX-V:ENW | FSE:E4U) (“EnWave”, or the \"Company\")\ntoday reported the Company’s consolidated interim financial results for the first quarter ended December 31, 2024.\nAll values in thousands and denoted in CAD unless otherwise stated.\nReported royalty revenues of $559, representing an increase of $79 relative to the comparable period in the prior year. Royalties grew due to increased royalty partners, product sales, partner production, and exclusivity payments for the quarter.\nReported revenue for Q1 2025 of $1,177, representing a decrease of $85 relative to the comparable period in the prior year. The decrease was primarily related to fewer machine sales offset by an increase in royalties and tolling.\nGross margin for the three months ending Q1 2025 was 29% compared to 18% for the three months ended Q1 2024. The increase in margin was a result of higher royalties and tolling fees for the quarter.\nReported an increase in Selling, General & Administrative (“SG&A”) costs (including Research & Development (“R&D”)) of $5 for Q1 2025 relative to the comparable period in the prior year, with the increase primarily related to tradeshow attendance offset by reduced legal costs associated with the capitalization of the Term Loan and Credit facility issuance costs.\nReported an Adjusted EBITDA\n(1)\nloss of $624 for Q1 2025, an improvement of $132 from the comparable period in the prior year.\nConsolidated Financial Performance:\n($ ‘000s)\nThree months ended\nDecember 31\n,\n2024\n2023\nChange\n%\nRevenues\n1,177\n1,262\n(7%)\nDirect costs\n(837\n)\n(1,029)\n(19%)\nGross margin\n340\n233\n46%\nOperating expenses\nGeneral and administration\n424\n511\n(17%)\nSales and marketing\n486\n351\n38%\nResearch and development\n358\n401\n(11%)\n1,268\n1,263\n0%\nNet loss - continuous operations\n(938\n)\n(1,144)\n(18%)\nNet loss - discontinued operations\n(8\n)\n(151)\n(95%)\nAdjusted EBITDA\n(1)\nloss\n(624\n)\n(756)\n(17%)\nLoss per share:\nContinuous operations – basic and diluted\n$\n0.00\n$(0.01)\nDiscontinued operations – basic and diluted\n$\n0.00\n$0.00\nBasic and diluted\n$\n0.00\n$(0.01)\n(1)\nAdjusted EBITDA is a non-IFRS financial measure. Refer to the Non-IFRS Financial Measures disclosure below for a reconciliation to the nearest IFRS equivalent.\nEnWave’s consolidated interim financial statements and MD&A are available on SEDAR+ at\nwww.sedarplus.c\na\nand on the Company’s website\nwww.enwave.net\nSignificant Corporate Accomplishments in Q1 2025 and Subsequently:\nSigned an equipment purchase agreement and a license amendment with Sprouted Proteins SAC (“Sprouted Proteins”) of Peru. Sprouted Proteins purchased a 10kW REV™ machine and is leasing a second 10kW REV™ machine to ramp up commercial production. The license amendment grants Sprouted Proteins the exclusive right to produce certain starch-based snack products and instant soup mixes in Peru and sets annual minimum exclusivity royalty amounts.\nSigned an amendment to the royalty-bearing license agreement with Patatas Fritas Torres S.L. (“PFT”) of Spain. The amendment expands the product portfolio for PFT, who is focused on commercializing healthy, protein-rich snack products. Under the terms of the amendment, PFT will pay EnWave additional minimum annual royalties in exchange for the expanded product definition.\nSigned an amendment to the royalty-bearing license agreement with BranchOut Food Inc. to grant the company the exclusive rights to produce dried blueberry products using EnWave’s REV\nTM\ntechnology in Peru.\nSigned a Research, Development and License Agreement, Equipment Purchase Agreement, and Referral Agreement with CNTA of Spain. The Equipment Purchase Agreement was for a 10kW REV™ machine that will showcase their state-of-the-art facility with the value proposition of REV™ technology.\nSigned a Research, Development and License Agreement and Lease Agreement with ELEA Technology GmbH to lease a 10kW REV\nTM\nmachine.\nSigned a Technology Evaluation License Option Agreement with Solve Solutions LTDA of Brazil to rent a 10kW REV\nTM\nmachine for use at their facility in the state of Santa Catarina, Brazil.\nNon-IFRS Financial Measures:\nThis news release refers to Adjusted EBITDA which is a non-IFRS financial measure. We define Adjusted EBITDA as earnings before deducting amortization and depreciation, stock-based compensation, foreign exchange gain or loss, finance expense or income, income tax expense or recovery, non-recurring income and expenses, restructuring and severance charges, and discontinued operations. This measure is not necessarily comparable to similarly titled measures used by other companies and should not be construed as an alternative to net income or cash flow from operating activities as determined in accordance with IFRS. Please refer to the reconciliation between Adjusted EBITDA and the most comparable IFRS financial measure reported in the Company’s consolidated interim financial statements.\nThree months ended December 31,\n($ ‘000s)\n2024\n2023\nNet loss after income tax\n(946)\n(1,295)\nAmortization and depreciation\n293\n275\nStock-based compensation\n143\n115\nForeign exchange (gain) loss\n(147)\n24\nFinance income\n(47)\n(52)\nFinance expense\n72\n26\nDiscontinued operations\n8\n151\nAdjusted EBITDA\n(624)\n(756)\nNon-IFRS financial measures should be considered together with other data prepared in accordance with IFRS to enable investors to evaluate the Company’s operating results, underlying performance and prospects in a manner similar to EnWave’s management. Accordingly, these non-IFRS financial measures are intended to provide additional information and should not be considered in isolation or as a substitute for measures of performance prepared in accordance with IFRS. For more information, please refer to the\nNon-IFRS Financial Measures\nsection in the Company’s MD&A available on SEDAR+\nwww.sedarplus.c\na\n.\nAbout EnWave\nEnWave is a global leader in the innovation and application of vacuum microwave dehydration. From its headquarters in Delta, BC, EnWave has developed a robust intellectual property portfolio, perfected its Radiant Energy Vacuum (REV™) technology, and transformed an innovative idea into a proven, consistent, and scalable drying solution for the food, pharmaceutical and cannabis industries that vastly outperforms traditional drying methods in efficiency, capacity, product quality, and cost.\nWith more than fifty royalty-generating partners spanning twenty-three countries and five continents, EnWave’s licensed partners are creating profitable, never-before-seen snacks and ingredients, improving the quality and consistency of their existing offerings, running leaner and getting to market faster with the company’s patented technology, licensed machinery, and expert guidance.\nEnWave’s strategy is to sign royalty-bearing commercial licenses with food producers who want to dry better, faster and more economical than freeze drying, rack drying and air drying, and enjoy the following benefits of producing exciting new products, reaching optimal moisture levels up to seven times faster, and improve product taste, texture, color and nutritional value.\nLearn more at\nEnWave.net\n.\nEnWave Corporation\nMr. Brent Charleton, CFA\nPresident and CEO\nFor further information:\nBrent Charleton, CFA, President and CEO at +1 (778) 378-9616\nE-mail:\nbcharleton@enwave.net\nDylan Murray, CPA, CA, CFO at +1 (778) 870-0729\nE-mail:\ndmurray@enwave.net\nSafe Harbour for Forward-Looking Information Statements: This press release may contain forward-looking information based on management's expectations, estimates and projections. All statements that address expectations or projections about the future, including statements about the Company's strategy for growth, product development, market position, expected expenditures, and the expected synergies following the closing are forward-looking statements. All third-party claims referred to in this release are not guaranteed to be accurate. All third-party references to market information in this release are not guaranteed to be accurate as the Company did not conduct the original primary research. These statements are not a guarantee of future performance and involve a number of risks, uncertainties and assumptions. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements.\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release."
  },
  {
    "ticker": "CNTA",
    "title": "Centessa Pharmaceuticals to Participate in Upcoming Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/01/28/3016336/0/en/Centessa-Pharmaceuticals-to-Participate-in-Upcoming-Investor-Conferences.html",
    "date": "January 28, 2025 08:00 ET",
    "text": "Centessa Pharmaceuticals to Participate in Upcoming Investor Conferences\nJanuary 28, 2025 08:00 ET\n| Source:\nCentessa Pharmaceuticals plc\nFollow\nCentessa Pharmaceuticals plc\nShare\nBOSTON and LONDON, Jan.  28, 2025  (GLOBE NEWSWIRE) --\nCentessa Pharmaceuticals plc\n(Nasdaq: CNTA), a clinical-stage pharmaceutical company that aims to discover and develop transformational medicines for patients, today announced that members of its management team will participate in the following investor conferences:\nEvent:\nGuggenheim SMID Cap Biotech Conference\nDate:\nFebruary 6, 2025\nFireside Chat:\n1:00 PM ET\nEvent:\nOppenheimer 35\nth\nAnnual Healthcare Life Sciences Conference\nDate:\nFebruary 12, 2025\nFireside Chat\n: 10:40 AM ET\nEvent:\nTD Cowen 45\nth\nAnnual Health Care Conference\nDate:\nMarch 4, 2025\nFireside Chat:\n1:50 PM ET\nEvent:\nLeerink Partners Global Healthcare Conference\nDate:\nMarch 11, 2025\nFireside Chat:\n10:00 AM ET\nAccess to the live webcasts of these events, as well as archived recordings, will be available under the “Events and Publications” tab on the investor relations section of the Centessa Pharmaceuticals website at\nhttps://investors.centessa.com/\n.\nAbout Centessa Pharmaceuticals\nCentessa Pharmaceuticals plc is a clinical-stage pharmaceutical company that aims to discover and develop medicines that are transformational for patients. We are developing potential best-in-class orexin receptor 2 (OX2R) agonists intended to be orally administered for the treatment of sleep-wake disorders including narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH), and excessive daytime sleepiness (EDS) in neurological, neurodegenerative, and psychiatric conditions. We also anticipate that our OX2R agonists may have utility in treating impaired attention, cognitive deficits, fatigue, and other symptoms. Our earlier stage pipeline is focused on immuno-oncology with our proprietary LockBody technology platform.\nContact:\nKristen K. Sheppard, Esq.\nSVP of Investor Relations\ninvestors@centessa.com"
  },
  {
    "ticker": "CNTA",
    "title": "Centessa Pharmaceuticals Announces Appointment of Stephen Kanes, MD PhD, as Chief Medical Officer",
    "link": "https://www.globenewswire.com/news-release/2025/01/08/3006127/0/en/Centessa-Pharmaceuticals-Announces-Appointment-of-Stephen-Kanes-MD-PhD-as-Chief-Medical-Officer.html",
    "date": "January 08, 2025 07:05 ET",
    "text": "Centessa Pharmaceuticals Announces Appointment of Stephen Kanes, MD PhD, as Chief Medical Officer\nJanuary 08, 2025 07:05 ET\n| Source:\nCentessa Pharmaceuticals plc\nFollow\nCentessa Pharmaceuticals plc\nShare\nBOSTON and LONDON, Jan.  08, 2025  (GLOBE NEWSWIRE) -- Centessa Pharmaceuticals plc (Nasdaq: CNTA), a clinical stage pharmaceutical company with a mission to discover, develop and ultimately deliver medicines that are transformational for patients, today announced the appointment of Stephen Kanes MD PhD, as Chief Medical Officer (CMO). Dr. Kanes is a neuropsychiatrist, with a career in neuroscience, clinical psychiatry, and neuroscience drug development spanning more than 30 years.\n“Centessa is rapidly advancing a potential best-in-class and first-in-class portfolio of orexin receptor 2 (OX2R) agonists with a robust series of clinical milestones anticipated this year,” said Saurabh Saha MD PhD, Chief Executive Officer of Centessa. “Steve is a great addition to our team and brings an exceptional set of skills in the design and execution of clinical programs across key therapeutic areas, including neurology and psychiatry. His expertise will be invaluable as we continue to progress our novel OX2R agonists for the treatment of sleep-wake, neurological, neurodegenerative and psychiatric disorders.”\n“Orexin agonists are one of the most exciting emerging areas of therapeutic science, and Centessa’s potential best-in-class OX2R agonists represent an extraordinary opportunity to address unmet patient needs across multiple therapeutic areas,” said Stephen Kanes, MD PhD, Chief Medical Officer. “With Phase 2a clinical studies of ORX750 now underway, it’s an exciting time to be joining Centessa. I look forward to working with the team and contributing to the success of the Company’s growing OX2R agonist franchise.”\nDr. Kanes served as Chief Medical Officer of Sage Therapeutics from 2013 to 2021, where he led the successful clinical development of ZULRESSO® (brexanolone), the first-ever treatment approved for Postpartum Depression (PPD), along with the buildout of the development organization and Sage Therapeutics' broad neuroscience portfolio. Most recently, Dr. Kanes was Chief Executive Officer of EmbarkNeuro, a neuroscience focused biotech company. Earlier in his career, Dr. Kanes was Executive Director in Clinical Development in the Inflammation, Neuroscience and Respiratory therapeutic areas at AstraZeneca, and a faculty member of the University of Pennsylvania Department of Psychiatry where he explored both the genetics and physiology of severe mental illness. He has authored or co-authored more than 60 peer-reviewed publications in behavioral neuroscience, behavioral pharmacology, genetics, brain imaging, clinical trials, and health economics and serves as an ad hoc reviewer for multiple journals including\nNeuropsychopharmacology\nand\nThe American Journal of Medical Genetics and Biological Psychiatry\n. Dr. Kanes received his BA from the University of Pennsylvania in the Biological Basis of Behavior and both his PhD in Molecular and Cellular Pharmacology and MD from the Stony Brook University Renaissance School of Medicine. He completed his psychiatry residency at Yale-New Haven Medical Center and a neuropsychiatry postdoctoral fellowship at the University of Pennsylvania.\nAbout Centessa Pharmaceuticals\nCentessa Pharmaceuticals plc is a clinical-stage pharmaceutical company that aims to discover and develop medicines that are transformational for patients. We are developing potential best-in-class orexin receptor 2 (OX2R) agonists intended to be orally administered for the treatment of sleep-wake disorders including narcolepsy type 1 (NT1), narcolepsy type 2 (NT2) and idiopathic hypersomnia (IH), and excessive daytime sleepiness (EDS) in neurological, neurodegenerative, and psychiatric conditions. We also anticipate that our OX2R agonists may have utility in treating impaired attention, cognitive deficits, fatigue, and other symptoms. Our lead OX2R agonist, ORX750, is in Phase 2 clinical trials for NT1, NT2 and IH. ORX750 has not been approved by the FDA or any other regulatory authority. Centessa’s proprietary LockBody technology platform aims to redefine immuno-oncology treatment for patients with cancer. LockBody drug candidates are designed to selectively drive potent effector function activity to the tumor micro-environment (TME) while avoiding systemic toxicity.\nForward Looking Statements\nThis press release contains forward-looking statements. These statements may be identified by words such as “may,” “might,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “objective,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “continue,” “ongoing,” “aim,” “seek,” and variations of these words or similar expressions that are intended to identify forward-looking statements. Any such statements in this press release that are not statements of historical fact may be deemed to be forward-looking statements, including statements related to the Company’s ability to discover and develop transformational medicines for patients; its expectations for executing on the Company's pipeline; its expectations on its anticipated cash runway; the timing of commencement of new studies or clinical trials or clinical and preclinical data related to ORX750, ORX142, ORX489 and other OX2R agonist molecules, LB101, other LockBody candidates, and the LockBody technology platform; its ability to identify, screen, recruit and maintain a sufficient number of or any subjects in its existing and anticipated studies or clinical trials of ORX750, ORX142, ORX489 and other OX2R agonist molecules, LB101 and any other LockBody candidates; its expectations on executing its research and clinical development plans and the timing thereof; its expectations as to the potential results and impact of each of its clinical programs and trials; the Company’s ability to differentiate ORX750, ORX142, ORX489 and other OX2R agonist molecules, LB101, other LockBody candidates from other treatment options; the development, design and therapeutic potential of ORX750, ORX142, ORX489 and other OX2R agonist molecules, LB101, other LockBody candidates and the LockBody technology platform; and regulatory matters, including the timing and likelihood of success of obtaining regulatory clearance, obtaining authorizations to initiate or continue clinical trials. Any forward-looking statements in this press release are based on our current expectations, estimates, assumptions and projections only as of the date of this release and are subject to a number of risks and uncertainties that could cause actual results to differ materially and adversely from those set forth in or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, risks related to the safety and tolerability profile of our product candidates; our ability to identify, screen and recruit a sufficient number of or any subjects in our existing and anticipated new studies or clinical trials of ORX750, ORX142, ORX489 or LB101 or within anticipated timelines; our expectations relating to the clinical trials of ORX750, including the predicted timing of enrollment, the predicted efficacious doses of ORX750 and our ability to successfully conduct our clinical development of ORX750, our ability to protect and maintain our intellectual property position; business (including commercial viability), regulatory, economic and competitive risks, uncertainties, contingencies and assumptions about the Company; risks inherent in developing product candidates and technologies; future results from our ongoing and planned clinical trials; our ability to obtain adequate financing, including through our financing facility with Oxford Finance, to fund our planned clinical trials and other expenses; trends in the industry; the legal and regulatory framework for the industry, including the receipt and maintenance of clearances to conduct or continue clinical testing; our operating costs and use of cash, including cash runway, cost of development activities and conducting clinical trials, future expenditures risks; the risk that any one or more of our product candidates will not be successfully developed and/or commercialized; the risk that the historical results of preclinical studies or clinical studies will not be predictive of future results in ongoing or future studies; economic risks to the United States and United Kingdom banking systems; and geo-political risks such as the Russia-Ukraine war or the Middle East conflicts. These and other risks concerning our programs and operations are described in additional detail in our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and our other reports, which are on file with the U.S. Securities and Exchange Commission (SEC). We explicitly disclaim any obligation to update any forward-looking statements except to the extent required by law.\nContact:\nKristen K. Sheppard, Esq.\nSVP of Investor Relations\ninvestors@centessa.com"
  }
]