[
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals Announces Grants of Inducement Awards under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/07/16/3116825/0/en/Madrigal-Pharmaceuticals-Announces-Grants-of-Inducement-Awards-under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "July 16, 2025 16:05 ET",
    "text": "Madrigal Pharmaceuticals Announces Grants of Inducement Awards under Nasdaq Listing Rule 5635(c)(4)\nJuly 16, 2025 16:05 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., July  16, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ:MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced that it granted equity awards on July 1, 2025 and July 15, 2025 to a total of 30 new non-executive employees as equity inducement awards under the terms of Madrigal’s 2025 Inducement Plan. The equity awards were approved by Madrigal’s independent Compensation Committee in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe equity awards were granted as inducement material to employees’ acceptance of employment with the company. The new employees received, in the aggregate, options to purchase 5,675 shares of Madrigal’s common stock, and in the aggregate 19,863 time-based restricted stock units. Options granted on July 1, 2025 have an exercise price of $300.16 per share and options granted on July 15, 2025 have an exercise price of $311.14, which is equal to the closing price of the company’s common stock on the applicable grant date. Options vest as follows: (i) 25% of the option shares will vest on the first anniversary of the grant date and (ii) 6.25% of the option shares will vest on each quarterly anniversary following the first anniversary of the grant date. All restricted stock units granted vest in four equal installments on each of the first through fourth anniversaries of the grant date. The vesting of all awards described above shall be subject to each such employee’s continued employment as of the applicable vesting date.\nAbout Madrigal Pharmaceuticals\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nInvestor Contact\nTina Ventura, IR@madrigalpharma.com\nMedia Contact\nChristopher Frates, media@madrigalpharma.com"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals Receives Notice of Allowance from U.S. Patent and Trademark Office for New U.S. Patent Covering Rezdiffra™ (Resmetirom)",
    "link": "https://www.globenewswire.com/news-release/2025/07/16/3116331/0/en/Madrigal-Pharmaceuticals-Receives-Notice-of-Allowance-from-U-S-Patent-and-Trademark-Office-for-New-U-S-Patent-Covering-Rezdiffra-Resmetirom.html",
    "date": "July 16, 2025 08:00 ET",
    "text": "Madrigal Pharmaceuticals Receives Notice of Allowance from U.S. Patent and Trademark Office for New U.S. Patent Covering Rezdiffra™ (Resmetirom)\nJuly 16, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\n• Provides Protection Through Sept. 2044; Will Be Listed in FDA’s Orange Book\nCONSHOHOCKEN, Pa., July  16, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced that the United States Patent and Trademark Office (USPTO) has issued a Notice of Allowance covering the FDA-approved use of Rezdiffra\n™\n(resmetirom), the first and only FDA-approved treatment for adults with noncirrhotic MASH (also known as NASH) with moderate to advanced liver fibrosis.\nThe Notice of Allowance includes claims directed to Rezdiffra’s commercial weight-threshold dosing regimen as prescribed in the FDA-approved label. The U.S. patent scheduled to issue from this application provides protection through Sept. 30, 2044, and will be listed in the FDA’s Approved Drug Products with Therapeutic Equivalence Evaluations, commonly known as the Orange Book.\n“This issuance marks a pivotal milestone in our long-term Rezdiffra strategy,” said Bill Sibold, Chief Executive Officer of Madrigal. “It recognizes the value of our pioneering clinical development program and will allow our team to continue driving innovation for patients with MASH for years to come.”\nAbout Madrigal Pharmaceuticals\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward-Looking Statements\nThis press release includes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to the expected benefit of the new patent, when issued, and Rezdiffra’s role as a potential foundational therapy for the treatment of MASH. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that did not have commercial experience prior to 2024; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward-looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission (“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 26, 2025, and as updated from time to time by Madrigal’s other filings with the SEC.\nInvestor Contact\nTina Ventura, IR@madrigalpharma.com\nMedia Contact\nChristopher Frates, media@madrigalpharma.com\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Receives Positive CHMP Opinion for Resmetirom (Rezdiffra™) for the Treatment of MASH with Moderate to Advanced Liver Fibrosis",
    "link": "https://www.globenewswire.com/news-release/2025/06/20/3102620/0/en/Madrigal-Receives-Positive-CHMP-Opinion-for-Resmetirom-Rezdiffra-for-the-Treatment-of-MASH-with-Moderate-to-Advanced-Liver-Fibrosis.html",
    "date": "June 20, 2025 06:30 ET",
    "text": "Madrigal Receives Positive CHMP Opinion for Resmetirom (Rezdiffra™) for the Treatment of MASH with Moderate to Advanced Liver Fibrosis\nJune 20, 2025 06:30 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nPositive recommendation based on resmetirom’s favorable profile including positive results from the pivotal Phase 3 MAESTRO-NASH trial\nEuropean Commission decision expected\nin August 2025\n; if approved, resmetirom will be the first medication for people living with MASH in the E.U.\nCONSHOHOCKEN, Pa., June  20, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced that the Committee for Medicinal Products for Human Use (CHMP) of the European Medicines Agency (EMA) has adopted a positive opinion recommending approval of resmetirom (Rezdiffra) for the treatment of adults with noncirrhotic MASH with moderate to advanced liver fibrosis. The European Commission decision is anticipated in August.\nBill Sibold, Chief Executive Officer of Madrigal, stated, “Madrigal is singularly focused on leading the fight against MASH globally. Resmetirom was the first medication to achieve fibrosis improvement and MASH resolution in a Phase 3 trial, the first medication to receive FDA-approval for MASH, and today’s positive CHMP opinion represents another historic first for the global MASH community. MASH is the fastest-growing indication for liver transplantation in Europe, and we believe resmetirom has the potential to address the urgent unmet need for a foundational, liver-directed therapy to treat patients with this serious disease.”\nMASH is a leading cause of liver-related mortality and an increasing burden on healthcare systems globally. Resmetirom is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. The CHMP opinion was based on resmetirom’s favorable profile including the positive results from the pivotal Phase 3\nMAESTRO-NASH trial\n, which achieved both fibrosis reduction and MASH resolution primary endpoints.\nJörn M. Schattenberg, M.D., Professor of Medicine and Director of the Department of Medicine at the University Medical Center Homburg and University of the Saarland in Germany, stated, “I’m encouraged by the CHMP’s positive opinion recommending approval of resmetirom. After years of clinical research and growing appreciation of the burden of MASH on patients and health systems across Europe, we are finally on the cusp of having an approved therapy that targets the underlying disease. Importantly, resmetirom is already included in\nEuropean clinical practice guidelines\n, which provide a framework for identifying and monitoring patients with noninvasive tests. If approved, I believe the medication has the potential to transform care for my patients with MASH.”\nThe U.S. Food and Drug Administration (FDA) granted accelerated approval in March 2024 for Rezdiffra in conjunction with diet and exercise for the treatment of adults with noncirrhotic MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis). Continued approval for this indication may be contingent upon verification and description of clinical benefit in ongoing confirmatory trials.\nAbout MASH\nMetabolic dysfunction-associated steatohepatitis (MASH), formerly known as nonalcoholic steatohepatitis (NASH), is a serious liver disease that can progress to cirrhosis, liver failure, liver cancer, need for liver transplantation, and premature mortality. MASH is the leading cause of liver transplantation in women and the second leading cause of all liver transplantation in the U.S., and the fastest-growing indication for liver transplantation in Europe.\nOnce patients progress to MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis), the risk of adverse liver outcomes increases dramatically: these patients have a 10-17 times higher risk of liver-related mortality as compared to patients without fibrosis. Those who progress to cirrhosis face a 42 times higher risk of liver-related mortality, underscoring the need to treat MASH before complications of cirrhosis develop. MASH is also an independent driver of cardiovascular disease, the leading cause of mortality for patients.\nAs MASH disease awareness improves and disease prevalence increases, the number of diagnosed patients with MASH with moderate to advanced fibrosis or compensated MASH cirrhosis (F2-F4c) is expected to grow.\nAbout Rezdiffra\nRezdiffra is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. It is the first approved medication for the treatment of MASH in the U.S. In the pivotal Phase 3\nMAESTRO-NASH biopsy trial\n, Rezdiffra achieved both fibrosis improvement and MASH resolution primary endpoints, and 91% of patients treated with Rezdiffra 100 mg experienced improvement or stabilization of liver stiffness. In the U.S., Rezdiffra is indicated in conjunction with diet and exercise for the treatment of adults with noncirrhotic MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis). Continued approval for this indication may be contingent upon verification and description of clinical benefit in ongoing confirmatory trials.\nRezdiffra is not approved in Europe for the treatment of patients with MASH with moderate to advanced liver fibrosis and not approved in any geography for the treatment of patients with cirrhosis. The ongoing, fully enrolled MAESTRO-NASH OUTCOMES trial is evaluating progression to liver decompensation events in patients with compensated MASH cirrhosis treated with Rezdiffra versus placebo.\nWhat is Rezdiffra?\nRezdiffra is a prescribed medicine used along with diet and exercise to treat adults with nonalcoholic steatohepatitis (NASH) with moderate to advanced liver scarring (fibrosis), but not with cirrhosis of the liver.\nIt is not known if Rezdiffra is safe and effective in children (under 18 years old).\nThis indication is approved based on improvement of NASH and liver scarring (fibrosis). There are ongoing studies to confirm the clinical benefit of Rezdiffra.\nBefore you take Rezdiffra, tell your healthcare provider about all of your medical conditions, including if you:\nhave any liver problems other than NASH.\nhave gallbladder problems or have been told you have gallbladder problems, including gallstones.\nare pregnant or plan to become pregnant. It is not known if Rezdiffra will harm your unborn baby.\nare breastfeeding or plan to breastfeed. It is not known if Rezdiffra passes into your breast milk. Talk to your healthcare provider about the best way to feed your baby if you take Rezdiffra.\nTell your healthcare provider about all the medicines you take,\nincluding prescription and over-the-counter medicines, vitamins, and herbal supplements.\nRezdiffra and other medicines may affect each other, causing side effects. Rezdiffra may affect the way other medicines work, and other medicines may affect how Rezdiffra works.\nEspecially tell your healthcare provider if you take medicines that contain gemfibrozil to help lower your triglycerides, or cyclosporine to suppress your immune system, because Rezdiffra is not recommended in patients taking these medicines.\nTell your healthcare provider if you are taking medicines such as clopidogrel to thin your blood or statin medicines to help lower your cholesterol.\nKnow the medicines you take. Keep a list of them to show your healthcare provider and pharmacist when you get a new medicine.\nWhat are the possible side effects of Rezdiffra?\nRezdiffra may cause serious side effects, including:\nliver injury (hepatotoxicity). Stop taking Rezdiffra and call your healthcare provider right away if you develop the following signs or symptoms of hepatotoxicity: tiredness, nausea, vomiting, fever, rash, your skin or the white part of your eyes turns yellow (jaundice), pain or tenderness in the upper middle or upper right area of your stomach (abdomen).\ngallbladder problems. Gallbladder problems such as gallstones, inflammation of the gallbladder, or inflammation of the pancreas from gallstones can occur with NASH and may occur if you take Rezdiffra. Call your healthcare provider right away if you develop any signs or symptoms of these conditions including nausea, vomiting, fever, or pain in your stomach area (abdomen) that is severe and will not go away. The pain may be felt going from your abdomen to your back and the pain may happen with or without vomiting.\nThe most common side effects of Rezdiffra include:\ndiarrhea, nausea, itching, stomach (abdominal) pain, vomiting, dizziness, constipation. These are not all the possible side effects of Rezdiffra. For more information, ask your healthcare provider or pharmacist.\nCall your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088 or\nwww.fda.gov/medwatch\n. You may also report side effects to Madrigal at 1-800-905-0324.\nPlease see the full\nPrescribing Information\n, including\nPatient Information\n, for Rezdiffra.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward-Looking Statements\nThis press release includes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to the expected timing for a decision for marketing authorization by the European Commission and resmetirom’s role as a potential foundational therapy for the treatment of MASH in Europe. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that did not have commercial experience prior to 2024; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward-looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission(“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 26, 2025, and as updated from time to time by Madrigal’s other filings with the SEC.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nMASH\nCHMP\nEMA"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals Announces Grants of Inducement Awards under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/06/17/3101070/0/en/Madrigal-Pharmaceuticals-Announces-Grants-of-Inducement-Awards-under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "June 17, 2025 16:05 ET",
    "text": "Madrigal Pharmaceuticals Announces Grants of Inducement Awards under Nasdaq Listing Rule 5635(c)(4)\nJune 17, 2025 16:05 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., June  17, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ:MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced that it granted equity awards on June 15, 2025 to 36 new non-executive employees as equity inducement awards under the terms of Madrigal’s 2023 Inducement Plan. The equity awards were approved by Madrigal’s independent Compensation Committee in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe equity awards were granted as inducement material to employees’ acceptance of employment with the company. The new employees received, in the aggregate, options to purchase 2,184 shares of Madrigal’s common stock, and in the aggregate 21,125 time-based restricted stock units. All options granted have an exercise price of $295.57 per share, which is equal to the closing price of the company’s common stock on the grant date, and vest as follows: (i) 25% of the option shares will vest on the first anniversary of the grant date and (ii) 6.25% of the option shares will vest on each quarterly anniversary following the first anniversary of the grant date. All restricted stock units granted vest in four equal installments on each of the first through fourth anniversaries of the grant date. The vesting of all awards described above shall be subject to each such employee’s continued employment as of the applicable vesting date.\nAbout Madrigal Pharmaceuticals\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nInvestor Contact\nTina Ventura, IR@madrigalpharma.com\nMedia Contact\nChristopher Frates, media@madrigalpharma.com\nTags\nbiotech"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals to Participate in the 46th Annual Global Goldman Sachs Health Care Conference",
    "link": "https://www.globenewswire.com/news-release/2025/06/02/3091783/0/en/Madrigal-Pharmaceuticals-to-Participate-in-the-46th-Annual-Global-Goldman-Sachs-Health-Care-Conference.html",
    "date": "June 02, 2025 08:00 ET",
    "text": "Madrigal Pharmaceuticals to Participate in the 46th Annual Global Goldman Sachs Health Care Conference\nJune 02, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., June  02, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL) today announced that the company will participate in the 46\nth\nAnnual Global Goldman Sachs Health Care Conference on Wednesday, June 11, 2025 at 10:40 A.M. EDT.\nThe presentation will be webcast live and may be accessed\nhere\nor by visiting Madrigal’s Investor Relations Events and Presentations\npage\n. A replay of the webcast will be available after the event.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Announces New Clinical Data Demonstrating Rezdiffra™ (resmetirom) Significantly Improved Multiple Noninvasive Tests and Portal Hypertension Risk in Patients with Compensated MASH Cirrhosis",
    "link": "https://www.globenewswire.com/news-release/2025/05/10/3078638/0/en/Madrigal-Announces-New-Clinical-Data-Demonstrating-Rezdiffra-resmetirom-Significantly-Improved-Multiple-Noninvasive-Tests-and-Portal-Hypertension-Risk-in-Patients-with-Compensated-.html",
    "date": "May 10, 2025 07:15 ET",
    "text": "Madrigal Announces New Clinical Data Demonstrating Rezdiffra™ (resmetirom) Significantly Improved Multiple Noninvasive Tests and Portal Hypertension Risk in Patients with Compensated MASH Cirrhosis\nMay 10, 2025 07:15 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nLate-breaking results from the open-label compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial presented at the EASL Congress\n65% of patients with clinically significant portal hypertension (CSPH) at baseline moved into lower risk categories by year two\nPatients achieved a mean 6.7 kPa reduction in liver stiffness, which was statistically significant compared to baseline\nCONSHOHOCKEN, Pa., May  10, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced positive two-year results from the open-label compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial of Rezdiffra. Patients (n=122) in the study achieved significant improvements from baseline in liver stiffness, liver fat, fibrosis biomarkers, liver volume and risk scores for clinically significant portal hypertension (CSPH).\n“Rezdiffra demonstrated broad, sustained efficacy across multiple noninvasive parameters at two years of treatment. A high, statistically significant percentage of patients with CSPH or probable CSPH at baseline shifted to lower risk categories,” said Naim Alkhouri, M.D., Chief Academic Officer at Summit Clinical Research and the Director of the Steatotic Liver Disease Program at the Clinical Research Institute of Ohio. “A larger placebo-controlled study will be needed to confirm Rezdiffra’s benefit in F4c, but the totality of data in this high-risk population of patients on the cusp of progressing to liver decompensation is highly encouraging as we await results from the ongoing Phase 3 MAESTRO-NASH OUTCOMES trial of Rezdiffra.”\nCSPH is a major consequence of cirrhosis and is responsible for its most severe complications, including ascites, variceal bleeding and hepatic encephalopathy. Patients with MASH who progress to cirrhosis face a 42 times higher risk of liver-related mortality.\nMAESTRO-NAFLD-1 included an open-label active treatment arm of patients with compensated MASH cirrhosis. After one year, patients were given the option to enroll in an open-label extension trial; 122 patients enrolled and 113 completed two years of treatment. At baseline, 35% of patients met Baveno criteria for CSPH, 14% for probable CSPH and 51% for no/low CSPH. The Baveno criteria use a combination of vibration-controlled transient elastography (VCTE) and platelet count to assess CSPH risk.\nAmong patients with CSPH at baseline, 65% moved into lower risk categories by year two (42% to no/low CSPH and 23% to probable CSPH). Among patients with probable CSPH at baseline, 57% moved into the no/low CSPH category as compared to 14% who moved into the CSPH category by year two. Improvement in CSPH risk was statistically significant compared to baseline. Similar shifts to lower risk categories were observed in an analysis using a more stringent modified Baveno criteria that incorporates magnetic resonance elastography (MRE) and the Enhanced Liver Fibrosis (ELF) test as additional evidence for CSPH risk.\nAs previously reported, patients achieved a mean 6.7 kPa reduction in liver stiffness at two years, which was statistically significant compared to baseline. In a responder analysis examining ≥25% improvement or worsening of liver stiffness, 51% of patients achieved improvement. An improvement of this magnitude has been associated with reduced progression to end-stage liver disease.\n1\nRezdiffra helped 35% of patients achieve liver stiffness measurements consistent with F3 fibrosis, suggesting reversal of cirrhosis.\nSafety data were consistent with previous studies and Rezdiffra was well-tolerated with a low rate of discontinuation due to adverse events. The most common adverse events were diarrhea, COVID-19 and nausea. There were two deaths unrelated to Rezdiffra.\n“Lower thyroid-hormone receptor-beta (THR-β) activity in the liver is predictive of hepatic decompensation\n2\nin patients with MASH, so there is a strong mechanistic rationale supporting the potential of Rezdiffra, a THR-β agonist, to improve outcomes in patients with compensated MASH cirrhosis,” said David Soergel, M.D., Chief Medical Officer of Madrigal. “These two-year open-label data from MAESTRO-NAFLD-1 add important clinical evidence that supports our confidence in the ongoing, fully enrolled Phase 3 outcomes trial of Rezdiffra in compensated MASH cirrhosis.”\nInvestor Webcast to Review New F4c Data\nAt 8 a.m. EDT May 13, 2025, Madrigal will host a webcast to review the detailed two-year data from the compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial. To access the webcast, please visit the investor relations section of the Madrigal website or\nclick here\nto register.\nAbout MASH\nMetabolic dysfunction-associated steatohepatitis (MASH), formerly known as nonalcoholic steatohepatitis (NASH), is a serious liver disease that can progress to cirrhosis, liver failure, liver cancer, need for liver transplantation, and premature mortality. MASH is expected to become the leading cause of liver transplantation in the U.S. and is already the leading cause of liver transplantation among women.\nOnce patients progress to MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis), the risk of adverse liver outcomes increases dramatically: these patients have a 10-17 times higher risk of liver-related mortality as compared to patients without fibrosis. Those who progress to cirrhosis face a 42 times higher risk of liver-related mortality, underscoring the need to treat MASH before complications of cirrhosis develop. MASH is also an independent driver of cardiovascular disease, the leading cause of mortality for patients.\nAn estimated 1.5 million patients have been diagnosed with MASH in the U.S., and Madrigal is focused on reaching approximately 315,000 patients with moderate to advanced fibrosis who are under the care of liver specialists. As MASH disease awareness improves and disease prevalence increases, the number of diagnosed patients with MASH with moderate to advanced fibrosis is expected to grow.\nAbout Rezdiffra\nRezdiffra is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. It is the first approved medication for the treatment of MASH in the U.S. In the pivotal Phase 3\nMAESTRO-NASH biopsy trial\n, Rezdiffra achieved both fibrosis improvement and MASH resolution primary endpoints, and 91% of patients treated with Rezdiffra 100 mg experienced improvement or stabilization of liver stiffness. In the U.S., Rezdiffra is indicated in conjunction with diet and exercise for the treatment of adults with noncirrhotic MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis). Continued approval for this indication may be contingent upon verification and description of clinical benefit in ongoing confirmatory trials.\nRezdiffra is not approved in Europe for the treatment of patients with MASH with moderate to advanced liver fibrosis and not approved in any geography for the treatment of patients with cirrhosis. The ongoing, fully enrolled MAESTRO-NASH OUTCOMES trial is evaluating progression to liver decompensation events in patients with compensated NASH cirrhosis treated with Rezdiffra versus placebo. A positive outcome is expected to support the full approval of Rezdiffra for noncirrhotic MASH and expand the eligible patient population for Rezdiffra with an additional indication in patients with compensated MASH cirrhosis.\nWhat is Rezdiffra?\nRezdiffra is a prescribed medicine used along with diet and exercise to treat adults with nonalcoholic steatohepatitis (NASH) with moderate to advanced liver scarring (fibrosis), but not with cirrhosis of the liver.\nIt is not known if Rezdiffra is safe and effective in children (under 18 years old).\nThis indication is approved based on improvement of NASH and liver scarring (fibrosis). There are ongoing studies to confirm the clinical benefit of Rezdiffra.\nBefore you take Rezdiffra, tell your healthcare provider about all of your medical conditions, including if you:\nhave any liver problems other than NASH.\nhave gallbladder problems or have been told you have gallbladder problems, including gallstones.\nare pregnant or plan to become pregnant. It is not known if Rezdiffra will harm your unborn baby.\nare breastfeeding or plan to breastfeed. It is not known if Rezdiffra passes into your breast milk. Talk to your healthcare provider about the best way to feed your baby if you take Rezdiffra.\nTell your healthcare provider about all the medicines you take,\nincluding prescription and over-the-counter medicines, vitamins, and herbal supplements.\nRezdiffra and other medicines may affect each other, causing side effects. Rezdiffra may affect the way other medicines work, and other medicines may affect how Rezdiffra works.\nEspecially tell your healthcare provider if you take medicines that contain gemfibrozil to help lower your triglycerides, or cyclosporine to suppress your immune system, because Rezdiffra is not recommended in patients taking these medicines.\nTell your healthcare provider if you are taking medicines such as clopidogrel to thin your blood or statin medicines to help lower your cholesterol.\nKnow the medicines you take. Keep a list of them to show your healthcare provider and pharmacist when you get a new medicine.\nWhat are the possible side effects of Rezdiffra?\nRezdiffra may cause serious side effects, including:\nliver injury (hepatotoxicity). Stop taking Rezdiffra and call your healthcare provider right away if you develop the following signs or symptoms of hepatotoxicity: tiredness, nausea, vomiting, fever, rash, your skin or the white part of your eyes turns yellow (jaundice), pain or tenderness in the upper middle or upper right area of your stomach (abdomen).\ngallbladder problems. Gallbladder problems such as gallstones, inflammation of the gallbladder, or inflammation of the pancreas from gallstones can occur with NASH and may occur if you take Rezdiffra. Call your healthcare provider right away if you develop any signs or symptoms of these conditions including nausea, vomiting, fever, or pain in your stomach area (abdomen) that is severe and will not go away. The pain may be felt going from your abdomen to your back and the pain may happen with or without vomiting.\nThe most common side effects of Rezdiffra include:\ndiarrhea, nausea, itching, stomach (abdominal) pain, vomiting, dizziness, constipation. These are not all the possible side effects of Rezdiffra. For more information, ask your healthcare provider or pharmacist.\nCall your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088 or\nwww.fda.gov/medwatch\n. You may also report side effects to Madrigal at 1-800-905-0324.\nPlease see the full\nPrescribing Information\n, including\nPatient Information\n, for Rezdiffra.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward-Looking Statements\nThis press release includes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to the potential benefit of Rezdiffra in patients with compensated MASH cirrhosis. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that did not have commercial experience prior to 2024; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward-looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission(“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 26, 2025, and as updated from time to time by Madrigal’s other filings with the SEC.\n1. Lin H, Lee HW, Yip TC, et al. Vibration-Controlled Transient Elastography Scores to Predict Liver-Related Events in Steatotic Liver Disease.\nJAMA\n. 2024;331(15):1287–1297.\n2. Kendall TJ, Jimenez-Ramos M, Turner F, et al. An integrated gene-to-outcome multimodal database for metabolic dysfunction-associated steatotic liver disease.\nNat Med\n. 2023 Nov;29(11):2939-2953.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nMASH\nbiotech"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals Reports First-Quarter 2025 Financial Results and Provides Corporate Updates",
    "link": "https://www.globenewswire.com/news-release/2025/05/01/3072220/0/en/Madrigal-Pharmaceuticals-Reports-First-Quarter-2025-Financial-Results-and-Provides-Corporate-Updates.html",
    "date": "May 01, 2025 07:00 ET",
    "text": "Madrigal Pharmaceuticals Reports First-Quarter 2025 Financial Results and Provides Corporate Updates\nMay 01, 2025 07:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nFirst-quarter 2025 Rezdiffra™ (resmetirom) net sales of $137.3 million\nAs of March 31, 2025, more than 17,000 patients on Rezdiffra\nTwo-year compensated MASH cirrhosis (F4c) data from MAESTRO-NAFLD-1 trial selected as oral late-breaker at EASL Congress (May 7-10)\nAppointed David Soergel, M.D., to Chief Medical Officer; Rebecca Taub, M.D., named Senior Scientific and Medical Advisor\nAppointed Jacqualyn Fouse, Ph.D., to Board of Directors\nReports cash, cash equivalents, restricted cash and marketable securities of $848.1 million at March 31, 2025\nCompany to host conference call today, May 1, 2025, at 8 a.m. EDT\nCONSHOHOCKEN, Pa., May  01, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today reports first-quarter 2025 financial results and provides corporate updates.\nBill Sibold, Chief Executive Officer of Madrigal, stated, “Since Rezdiffra’s approval last year, we’ve executed an exceptional launch. We introduced the first FDA-approved treatment for MASH, launched with a best-case label, built a strong foundation with healthcare providers and payers, and delivered Rezdiffra to more than 17,000 patients. What’s most gratifying is the positive feedback we’re hearing from healthcare providers – they’re seeing meaningful improvements in the measures that matter most to patients, including liver stiffness, liver fat, liver enzymes, LDL and triglycerides, which are exceeding their expectations.”\nSibold continued, “We’re building on our leadership in MASH, and we believe Rezdiffra is on track to become the foundational therapy across F2 to F4c MASH. Later this month at the EASL Congress, we’ll share new Rezdiffra F4c late-breaking data from our MAESTRO-NAFLD-1 trial that shows its effect on the risk of clinically significant portal hypertension – a major consequence of cirrhosis that’s responsible for its most severe complications. In addition, we’re awaiting a regulatory decision from the European Medicines Agency expected mid-year that, if positive, would make Rezdiffra the first MASH therapy approved for patients in Europe.”\nFirst Quarter 2025 and Recent Corporate Updates\nMarked the one-year approval anniversary of Rezdiffra on March 14, 2024; more than 17,000 patients on Rezdiffra as of March 31, 2025\nReported two-year F4c data from MAESTRO-NAFLD-1 trial\nIn February, Madrigal announced two-year results from the active-treatment open-label compensated MASH cirrhosis (F4c) arm of its Phase 3 MAESTRO-NAFLD-1 trial (n=101):\nPatients achieved a mean 6.7 kPa reduction in liver stiffness as measured by vibration-controlled transient elastography (VCTE). This reduction was statistically significant as compared to baseline.\n51% of patients achieved a ≥ 25% reduction in liver stiffness as measured by VCTE. A reduction of this magnitude has been associated with reduced progression to end-stage liver disease.\nRezdiffra’s safety and tolerability profile was consistent with other Rezdiffra clinical trials with a low discontinuation rate due to adverse events.\nThe results further support the potential benefit of Rezdiffra in patients with compensated MASH cirrhosis and the potential success of the ongoing MAESTRO-NASH OUTCOMES trial, a double blind, placebo-controlled, event-driven trial in F4c, for which data are anticipated in 2027.\nStrong presence at upcoming European Association for the Study of Liver (EASL) Congress being held May 7-10, 2025\nSix Madrigal abstracts were accepted by the EASL Congress, which will take place from May 7-10, 2025, in Amsterdam, the Netherlands. The abstracts include a late-breaking oral presentation with detailed two-year data from the active-treatment open-label compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial. The presentation will focus on the impact of Rezdiffra on liver stiffness, fibrosis biomarkers and the risk of clinically significant portal hypertension, a major consequence of cirrhosis that’s responsible for its most severe complications, such as ascites, variceal bleeding and hepatic encephalopathy.\nMadrigal will host an investor webcast to review the F4c two-year data on May 13, 2025\nAt 8 a.m. EDT May 13, 2025, Madrigal will host a webcast to review the detailed two-year data from the active-treatment open-label compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial. To access the webcast, please visit the investor relations section of the Madrigal website or\nclick here\nto register.\nAppointed David Soergel, M.D., as Chief Medical Officer; named Rebecca Taub, M.D., to Senior Scientific and Medical Advisor\nIn April, the Company announced that David Soergel, M.D., was appointed to Chief Medical Officer, succeeding Rebecca Taub, M.D., who moved to the role of Senior Scientific and Medical Advisor. Dr. Taub founded Madrigal in 2011; her pioneering research in academia and industry led to the first FDA-approved therapy for patients with MASH.\nDr. Soergel brings more than 20 years of leadership experience in metabolic and cardiovascular disease drug development, most recently as Executive Vice President and Global Head of Cardiovascular, Renal and Metabolism Development at Novartis.\nAppointed Jacqualyn (“Jackie”) Fouse, Ph.D. to Board of Directors\nIn March 2025, Jackie Fouse, Ph.D., was appointed to Madrigal’s Board of Directors.\nDr. Fouse is an accomplished biotech executive, with more than 30 years of biopharmaceutical and financial leadership experience. Dr. Fouse has served in executive leadership roles as a CEO, CFO and COO across multiple biotechnology companies, including Agios Pharmaceuticals and Celgene Corporation.\nFirst-Quarter 2025 Financial Results\nTotal revenues:\nThe Company generated first-quarter 2025 net revenues of $137.3 million. No product sales were recognized during the comparable prior year period.\nOperating Expenses:\nFirst-quarter 2025 operating expenses were $216.6 million, compared to $152.0 million in the comparable prior year period.\nCost of sales:\nFirst-quarter 2025 cost of sales was $4.5 million. Cost of sales was not recognized during the comparable prior year period given that no product sales were recorded.\nR&D Expense:\nFirst-quarter 2025 R&D expense was $44.2 million, compared to $71.2 million in the comparable prior year period. Research and development expenses decreased by $27.1 million primarily due the change in accounting for inventory costs following FDA approval of Rezdiffra in March 2024 and a reduction in clinical trial expense.\nSG&A Expense:\nFirst-quarter 2025 SG&A expense was $167.9 million compared to $80.8 million in the comparable prior year period. Selling, general and administrative expenses increased by $87.1 million due primarily to increases for commercial launch activities for Rezdiffra, including a corresponding increase in headcount, and an increase in stock compensation expense.\nInterest Income:\nFirst-quarter 2025 interest income was $9.4 million compared to $8.3 million in the comparable prior year period. The increase in interest income was due primarily to higher principal balances.\nInterest Expense:\nFirst-quarter 2025 interest expense was $3.3 million compared to $3.8 million in the comparable prior year period. The decrease of $0.5 million was primarily the result of lower interest rates in 2025.\nCash, Cash Equivalents, Restricted Cash and Marketable Securities:\nAs of March 31, 2025, Madrigal had cash, cash equivalents, restricted cash and marketable securities of $848.1 million, compared to $931.3 million at December 31, 2024. This decrease was attributable to funding of operations.\nConference Call and Webcast\nAt 8 a.m. EDT today, May 1, 2025, Madrigal will host a webcast to review its financial and operating results and provide a general business update. To access the webcast, please visit the investor relations section of the Madrigal website or\nclick here\nto register. An archived webcast will be available on the Madrigal website following the event.\nAbout MASH\nMetabolic dysfunction-associated steatohepatitis (MASH), formerly known as nonalcoholic steatohepatitis (NASH), is a serious liver disease that can progress to cirrhosis, liver failure, liver cancer, need for liver transplantation, and premature mortality. MASH is expected to become the leading cause of liver transplantation in the U.S. and is already the leading cause of liver transplantation among women.\nOnce patients progress to MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis), the risk of adverse liver outcomes increases dramatically. These patients have a 10 to 17 times higher risk of liver-related mortality as compared to patients without fibrosis. Those who progress to cirrhosis face a 42 times higher risk of liver-related mortality, underscoring the need to treat MASH before complications of cirrhosis develop. MASH is also an independent driver of cardiovascular disease, the leading cause of mortality for patients.\nAn estimated 1.5 million patients have been diagnosed with MASH in the U.S., and Madrigal is focused on reaching approximately 315,000 patients with moderate to advanced fibrosis who are under the care of liver specialists. As MASH disease awareness improves and disease prevalence increases, the number of diagnosed patients with MASH with moderate to advanced fibrosis is expected to grow.\nAbout Rezdiffra\nWhat is Rezdiffra?\nRezdiffra is a prescribed medicine used along with diet and exercise to treat adults with nonalcoholic steatohepatitis (NASH) with moderate to advanced liver scarring (fibrosis), but not with cirrhosis of the liver.\nIt is not known if Rezdiffra is safe and effective in children (under 18 years old).\nThis indication is approved based on improvement of NASH and liver scarring (fibrosis). There are ongoing studies to confirm the clinical benefit of Rezdiffra.\nBefore you take Rezdiffra, tell your healthcare provider about all of your medical conditions, including if you:\nhave any liver problems other than NASH.\nhave gallbladder problems or have been told you have gallbladder problems, including gallstones.\nare pregnant or plan to become pregnant. It is not known if Rezdiffra will harm your unborn baby.\nare breastfeeding or plan to breastfeed. It is not known if Rezdiffra passes into your breast milk. Talk to your healthcare provider about the best way to feed your baby if you take Rezdiffra.\nTell your healthcare provider about all the medicines you take,\nincluding prescription and over-the-counter medicines, vitamins, and herbal supplements.\nRezdiffra and other medicines may affect each other, causing side effects. Rezdiffra may affect the way other medicines work, and other medicines may affect how Rezdiffra works.\nEspecially tell your healthcare provider if you take medicines that contain gemfibrozil to help lower your triglycerides, or cyclosporine to suppress your immune system, because Rezdiffra is not recommended in patients taking these medicines.\nTell your healthcare provider if you are taking medicines such as clopidogrel to thin your blood or statin medicines to help lower your cholesterol.\nKnow the medicines you take. Keep a list of them to show your healthcare provider and pharmacist when you get a new medicine.\nWhat are the possible side effects of Rezdiffra?\nRezdiffra may cause serious side effects, including:\nliver injury (hepatotoxicity). Stop taking Rezdiffra and call your healthcare provider right away if you develop the following signs or symptoms of hepatotoxicity: tiredness, nausea, vomiting, fever, rash, your skin or the white part of your eyes turns yellow (jaundice), pain or tenderness in the upper middle or upper right area of your stomach (abdomen).\ngallbladder problems. Gallbladder problems such as gallstones, inflammation of the gallbladder, or inflammation of the pancreas from gallstones can occur with NASH and may occur if you take Rezdiffra. Call your healthcare provider right away if you develop any signs or symptoms of these conditions including nausea, vomiting, fever, or pain in your stomach area (abdomen) that is severe and will not go away. The pain may be felt going from your abdomen to your back and the pain may happen with or without vomiting.\nThe most common side effects of Rezdiffra include:\ndiarrhea, nausea, itching, stomach (abdominal) pain, vomiting, dizziness, constipation.\nThese are not all the possible side effects of Rezdiffra. For more information, ask your healthcare provider or pharmacist.\nCall your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088 or\nwww.fda.gov/medwatch\n. You may also report side effects to Madrigal at 1-800-905-0324.\nPlease see the full\nPrescribing Information\n, including\nPatient Information\n, for Rezdiffra.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward Looking Statements\nThis press release\nincludes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to Madrigal’s aspirations to be the leading company in the MASH sector and Rezdiffra’s role as a foundational therapy, the timing and potential impact of results from the MAESTRO-NASH OUTCOMES trial, the potential benefit of Rezdiffra in patients with compensated MASH cirrhosis, the timing for a regulatory decision by the European Commission and the planned launch of Rezdiffra in Europe. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks related to obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the timing and outcomes of clinical trials of Rezdiffra (resmetirom); the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission (“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 26, 2025, and Part II, Item 1A of its Quarterly Report on Form 10-Q for the quarter ended March 31, 2025, filed with the SEC on May 1, 2025, and as updated from time to time by Madrigal’s other filings with the SEC.\nMadrigal Pharmaceuticals, Rezdiffra™ and associated logos are trademarks of Madrigal Pharmaceuticals, Inc.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nMadrigal Pharmaceuticals, Inc.\nCondensed Consolidated Statement of Operations\n(in thousands, except share and per share amounts)\n(unaudited)\nThree Months Ended\nMarch 31,\n2025\n2024\nRevenues:\nProduct revenue, net\n$\n137,250\n$\n-\nOperating expenses:\nCost of sales\n4,513\n-\nResearch and development\n44,172\n71,237\nSelling, general and administrative\n167,876\n80,800\nTotal operating expenses\n216,561\n152,037\nLoss from operations\n(79,311\n)\n(152,037\n)\nInterest income\n9,370\n8,334\nInterest expense\n(3,297\n)\n(3,838\n)\nNet loss\n$\n(73,238\n)\n$\n(147,541\n)\nBasic and diluted net loss per common share\n$\n(3.32\n)\n$\n(7.38\n)\nBasic and diluted weighted average number of common shares outstanding\n22,091,314\n20,001,569\nMadrigal Pharmaceuticals, Inc.\nCondensed Consolidated Balance Sheets\n(in thousands)\n(unaudited)\nMarch 31,\nDecember 31,\n2025\n2024\nCash, cash equivalents, restricted cash and marketable securities\n$\n848,068\n$\n931,251\nTrade receivables, net\n61,428\n53,822\nOther current assets\n78,483\n47,854\nOther non-current assets\n8,650\n9,320\nTotal assets\n$\n996,629\n$\n1,042,247\nLiabilities and Equity\nCurrent liabilities\n$\n167,237\n$\n169,277\nLong-term liabilities\n118,755\n118,587\nStockholders’ equity\n710,637\n754,383\nTotal liabilities and stockholders’ equity\n$\n996,629\n$\n1,042,247\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal to Present Late-Breaking Resmetirom Data in Patients with Compensated MASH Cirrhosis at the EASL Congress",
    "link": "https://www.globenewswire.com/news-release/2025/04/29/3070170/0/en/Madrigal-to-Present-Late-Breaking-Resmetirom-Data-in-Patients-with-Compensated-MASH-Cirrhosis-at-the-EASL-Congress.html",
    "date": "April 29, 2025 08:00 ET",
    "text": "Madrigal to Present Late-Breaking Resmetirom Data in Patients with Compensated MASH Cirrhosis at the EASL Congress\nApril 29, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., April  29, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced six presentations at the upcoming European Association for the Study of the Liver (EASL) Congress, taking place from May 7-10, 2025, in Amsterdam, the Netherlands. Madrigal will share detailed two-year data from the open-label compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial in a late-breaking oral presentation titled, “Treatment with resmetirom for up to two years led to improvement in liver stiffness, fibrosis biomarkers, fibrosis scores and portal hypertension risk in 122 patients with compensated MASH cirrhosis.”\n“Patients with compensated MASH cirrhosis who develop clinically significant portal hypertension are at greatly elevated risk of experiencing life-threatening complications of late-stage liver disease so there is an urgent need to advance new treatment strategies for this vulnerable population,” said Bill Sibold, Chief Executive Officer of Madrigal. “The late-breaking data we will be presenting at EASL suggest that resmetirom may help halt or reverse disease progression in patients with compensated MASH cirrhosis, and we look forward to sharing important new findings examining the medication’s impact on portal hypertension risk. These data reinforce our conviction in resmetirom’s potential to become the foundational therapy across F2 to F4c MASH.”\n“This EASL Congress comes at an ideal time for our growing team in Europe,” added Neil Archer, Executive Vice President and Head of International for Madrigal. “As we prepare for a European Commission decision on our marketing authorization application for resmetirom, EASL will provide a valuable opportunity to listen, learn and engage with healthcare providers, patient advocates and other stakeholders who are working to improve care for this serious disease.”\nResmetirom is a once-daily, oral, liver-directed thyroid hormone receptor (THR)-β agonist designed to target key underlying causes of MASH. It is the first approved medication for the treatment of MASH in the U.S. In the pivotal Phase 3\nMAESTRO-NASH biopsy trial\n, resmetirom achieved both fibrosis improvement and MASH resolution primary endpoints, and 91% of patients treated with resmetirom 100 mg experienced improvement or stabilization of liver stiffness. In the U.S., resmetirom is indicated in conjunction with diet and exercise for the treatment of adults with noncirrhotic MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis). Continued approval for this indication may be contingent upon verification and description of clinical benefit in ongoing confirmatory trials.\nResmetirom is not approved in Europe for the treatment of patients with MASH with moderate to advanced liver fibrosis and not approved in any geography for the treatment of patients with cirrhosis. A marketing authorization application (MAA) for resmetirom is under evaluation with the European Medicines Agency’s (EMA) Committee for Medicinal Products for Human Use (CHMP). The CHMP opinion and subsequent European Union (EU) decision are expected in mid-2025. Madrigal expects to launch resmetirom in Europe on a country-by-country basis commencing with Germany in the second half of 2025, pending European Commission approval.\nMadrigal Data Presentations at the EASL Congress 2025\nLate-Breaking Oral Presentation: “Treatment with resmetirom for up to two years led to improvement in liver stiffness, fibrosis biomarkers, fibrosis scores and portal hypertension risk in 122 patients with compensated MASH cirrhosis” [Saturday, May 10, at 13:15 CEST. Presenter: Naim Alkhouri]\nPoster: “Baseline characteristics in well-compensated NASH cirrhosis patients diagnosed with or without a liver biopsy in MAESTRO-NASH-OUTCOMES, a clinical outcome phase 3 study assessing the effect of resmetirom in well compensated NASH cirrhosis” [Presenter: Jörn M. Schattenberg]\nPoster: “Use of noninvasive tests (NITs) to diagnose and follow non-alcoholic steatohepatitis (NASH) with liver fibrosis patients treated with resmetirom” [Presenter: Jörn M. Schattenberg]\nPoster: “Metabolic dysfunction-associated steatohepatitis (MASH) prevalence in Germany – results from a claims analysis” [Presenter: Thomas Ramezani]\nPoster: “Metabolic dysfunction-associated steatohepatitis as a risk factor for hepatocellular carcinoma mortality” [Presenter: Robert G. Gish]\nPoster: “Use of the LiverRisk score for prediction of moderate to advanced liver fibrosis in United States adults” [Presenter: Mary E. Rinella]\nInvestor Webcast to Review New F4c Data\nAt 8 a.m. EDT May 13, 2025, Madrigal will host a webcast to review the detailed two-year data from the compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial. To access the webcast, please visit the investor relations section of the Madrigal website or\nclick here\nto register.\nAbout MASH\nMetabolic dysfunction-associated steatohepatitis (MASH), formerly known as nonalcoholic steatohepatitis (NASH), is a serious liver disease that can progress to cirrhosis, liver failure, liver cancer, need for liver transplantation, and premature mortality. MASH is expected to become the leading cause of liver transplantation in the U.S. and is already the leading cause of liver transplantation among women.\nOnce patients progress to MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis), the risk of adverse liver outcomes increases dramatically: these patients have a 10-17 times higher risk of liver-related mortality as compared to patients without fibrosis. Those who progress to cirrhosis face a 42 times higher risk of liver-related mortality, underscoring the need to treat MASH before complications of cirrhosis develop. MASH is also an independent driver of cardiovascular disease, the leading cause of mortality for patients.\nAn estimated 1.5 million patients have been diagnosed with MASH in the U.S., and Madrigal is focused on reaching approximately 315,000 patients with moderate to advanced fibrosis who are under the care of liver specialists. As MASH disease awareness improves and disease prevalence increases, the number of diagnosed patients with MASH with moderate to advanced fibrosis is expected to grow.\nAbout Rezdiffra\nWhat is Rezdiffra?\nRezdiffra is a prescribed medicine used along with diet and exercise to treat adults with nonalcoholic steatohepatitis (NASH) with moderate to advanced liver scarring (fibrosis), but not with cirrhosis of the liver.\nIt is not known if Rezdiffra is safe and effective in children (under 18 years old).\nThis indication is approved based on improvement of NASH and liver scarring (fibrosis). There are ongoing studies to confirm the clinical benefit of Rezdiffra.\nBefore you take Rezdiffra, tell your healthcare provider about all of your medical conditions, including if you:\nhave any liver problems other than NASH.\nhave gallbladder problems or have been told you have gallbladder problems, including gallstones.\nare pregnant or plan to become pregnant. It is not known if Rezdiffra will harm your unborn baby.\nare breastfeeding or plan to breastfeed. It is not known if Rezdiffra passes into your breast milk. Talk to your healthcare provider about the best way to feed your baby if you take Rezdiffra.\nTell your healthcare provider about all the medicines you take,\nincluding prescription and over-the-counter medicines, vitamins, and herbal supplements.\nRezdiffra and other medicines may affect each other, causing side effects. Rezdiffra may affect the way other medicines work, and other medicines may affect how Rezdiffra works.\nEspecially tell your healthcare provider if you take medicines that contain gemfibrozil to help lower your triglycerides, or cyclosporine to suppress your immune system, because Rezdiffra is not recommended in patients taking these medicines.\nTell your healthcare provider if you are taking medicines such as clopidogrel to thin your blood or statin medicines to help lower your cholesterol.\nKnow the medicines you take. Keep a list of them to show your healthcare provider and pharmacist when you get a new medicine.\nWhat are the possible side effects of Rezdiffra?\nRezdiffra may cause serious side effects, including:\nliver injury (hepatotoxicity). Stop taking Rezdiffra and call your healthcare provider right away if you develop the following signs or symptoms of hepatotoxicity: tiredness, nausea, vomiting, fever, rash, your skin or the white part of your eyes turns yellow (jaundice), pain or tenderness in the upper middle or upper right area of your stomach (abdomen).\ngallbladder problems. Gallbladder problems such as gallstones, inflammation of the gallbladder, or inflammation of the pancreas from gallstones can occur with NASH and may occur if you take Rezdiffra. Call your healthcare provider right away if you develop any signs or symptoms of these conditions including nausea, vomiting, fever, or pain in your stomach area (abdomen) that is severe and will not go away. The pain may be felt going from your abdomen to your back and the pain may happen with or without vomiting.\nThe most common side effects of Rezdiffra include:\ndiarrhea, nausea, itching, stomach (abdominal) pain, vomiting, dizziness, constipation. These are not all the possible side effects of Rezdiffra. For more information, ask your healthcare provider or pharmacist.\nCall your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088 or\nwww.fda.gov/medwatch\n. You may also report side effects to Madrigal at 1-800-905-0324.\nPlease see the full\nPrescribing Information\n, including\nPatient Information\n, for Rezdiffra.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward-Looking Statements\nThis press release includes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to Rezdiffra’s role as a foundational therapy, the potential benefit of Rezdiffra in patients with compensated MASH cirrhosis and timing for an expected regulatory decision regarding resmetirom in Europe and the expected commencement of commercialization in Germany. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that did not have commercial experience prior to 2024; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward-looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission(“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 26, 2025, and as updated from time to time by Madrigal’s other filings with the SEC.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals to Release First-Quarter 2025 Financial Results and Host Webcast on May 1, 2025",
    "link": "https://www.globenewswire.com/news-release/2025/04/18/3064054/0/en/Madrigal-Pharmaceuticals-to-Release-First-Quarter-2025-Financial-Results-and-Host-Webcast-on-May-1-2025.html",
    "date": "April 18, 2025 08:00 ET",
    "text": "Madrigal Pharmaceuticals to Release First-Quarter 2025 Financial Results and Host Webcast on May 1, 2025\nApril 18, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., April  18, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), announced today that it will release its first-quarter 2025 financial results on Thursday, May 1, 2025, prior to the open of the U.S. financial markets.\nFollowing the announcement, Madrigal’s management will host a live webcast at 8 a.m. Eastern Time to review the Company’s financial and operating results.\nThe live webcast may be accessed at the Investor Relations section of the Madrigal Pharmaceuticals\nwebsite\n. To ensure a timely connection, it is recommended that participants register at least 15 minutes prior to the scheduled webcast.\nThe webcast will be available approximately two hours after the live webcast.\nAbout Madrigal Pharmaceuticals\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nMASH\nbiotech"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals Announces Company Founder Rebecca Taub, M.D. to Become Senior Scientific and Medical Advisor; David Soergel, M.D., Appointed Chief Medical Officer",
    "link": "https://www.globenewswire.com/news-release/2025/04/16/3062417/0/en/Madrigal-Pharmaceuticals-Announces-Company-Founder-Rebecca-Taub-M-D-to-Become-Senior-Scientific-and-Medical-Advisor-David-Soergel-M-D-Appointed-Chief-Medical-Officer.html",
    "date": "April 16, 2025 07:00 ET",
    "text": "Madrigal Pharmaceuticals Announces Company Founder Rebecca Taub, M.D. to Become Senior Scientific and Medical Advisor; David Soergel, M.D., Appointed Chief Medical Officer\nDr. Taub’s pioneering research in academia and industry led to the first FDA-approved therapy for patients with MASH\nApril 16, 2025 07:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., April  16, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ: MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced that Rebecca Taub, M.D., the company's founder, Chief Medical Officer, and President of Research & Development (R&D), will transition to the role of Senior Scientific and Medical Advisor. Dr. Taub will continue to serve on Madrigal's Board of Directors. Succeeding her, David Soergel, M.D., has been appointed Executive Vice President, Chief Medical Officer, effective April 21, 2025.\nAfter teaching Genetics and Medicine at the University of Pennsylvania, where she was one of the youngest women at that time to become a fully tenured Professor, Dr. Taub moved into senior R&D leadership roles at Bristol Myers Squibb and Roche. In 2011, she co-founded Madrigal with a vision to address unmet medical needs for patients with serious liver and cardiometabolic diseases. Under her leadership, the company achieved an unprecedented milestone – the development of the first FDA-approved medicine for the treatment of MASH, Rezdiffra™ (resmetirom).\n\"Becky's visionary leadership and relentless commitment have been instrumental in Madrigal's success and the success of the MASH field,\" said Bill Sibold, Chief Executive Officer of Madrigal. \"Her pioneering work as both a scientist and entrepreneur led to the development and approval of Rezdiffra – the first-ever FDA-approved medicine for MASH – bringing real hope to patients who previously had no options. We are incredibly grateful for her contributions and are fortunate to have her continued guidance as a strategic advisor and Madrigal board member. Becky represents the best of what our industry is capable of, and I hope her story will serve as an inspiration for people beginning their careers in biopharma.\"\n“As Becky moves into her new role, we’re thrilled to welcome David Soergel to Madrigal,” said Sibold. “Dave brings more than 20 years of leadership experience in metabolic and cardiovascular disease drug development, spanning both biotech and large pharma. As we look to build a pipeline beyond Rezdiffra, Dave’s deep clinical development expertise and strong track record of advancing therapies across multiple therapeutic areas is exactly the kind of experience that aligns with where we’re taking the company.”\n“I’d like to thank my colleagues, our research partners, and the many patients in the MASH community who have made invaluable contributions to Madrigal’s success,” said Dr. Taub. “What started as a small team of fewer than 10 R&D professionals in Conshohocken, PA is now a commercial-stage biopharma company with more than five hundred employees across the U.S. and Europe. I look forward to supporting Dave in my role as a scientific and medical advisor as Madrigal enters its next phase.”\nDr. Soergel joins Madrigal from Novartis, where he served as the Executive Vice President and Global Head of Cardiovascular, Renal, and Metabolism Development, overseeing 10 late-stage development programs in 2024. At Novartis, Dave led teams that designed and implemented evidence generation programs supporting the expansion of Entresto’s indications and uses. Additionally, he advanced novel medicines to approval for cardiovascular and renal diseases, including Leqvio, Fabhalta and Vanrafia, and served as the development lead for the acquisitions of the Medicines Company and Chinook Therapeutics. Prior to Novartis, Dr. Soergel held leadership roles at biotechnology companies, including Senior Vice President of Clinical Development and Chief Medical Officer at Trevena, where he was responsible for the development of novel treatments for pain and other conditions. He began his career in early-stage clinical development and translational medicine at GlaxoSmithKline. Dr. Soergel trained in pediatrics, pediatric cardiology, and heart failure and transplant at Johns Hopkins Hospital and the Children's Hospital of Philadelphia.\n“It is a great privilege to be succeeding Becky as Chief Medical Officer and I look forward to tapping into her expertise and guidance as I begin my new role at Madrigal,” said Dr. Soergel. “I’m excited to be joining an R&D team that delivered the first approved therapy in a disease that has been a major challenge for drug development. With two fully enrolled outcomes studies of Rezdiffra underway, Madrigal is at the forefront of scientific innovation in MASH, and the company is well-positioned to build on its leadership position through pipeline expansion.”\nAbout Madrigal Pharmaceuticals\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward-Looking Statements\nThis press release includes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to Madrigal’s plans to expand its pipeline. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; Madrigal’s ability to enter into any strategic transactions to expand its pipeline and its ability to complete any such transactions; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that does not have commercial experience; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; enrollment and trial conclusion uncertainties; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward-looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission(“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 26, 2025, and as updated from time to time by Madrigal’s other filings with the SEC.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Appoints Jacqualyn A. Fouse, Ph.D. to Its Board of Directors",
    "link": "https://www.globenewswire.com/news-release/2025/03/11/3040473/0/en/Madrigal-Appoints-Jacqualyn-A-Fouse-Ph-D-to-Its-Board-of-Directors.html",
    "date": "March 11, 2025 08:00 ET",
    "text": "Madrigal Appoints Jacqualyn A. Fouse, Ph.D. to Its Board of Directors\nMarch 11, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nFred Craves, Ph.D. to retire from Madrigal’s Board of Directors in July 2025\nCONSHOHOCKEN, Pa., March  11, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ:MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced it has appointed Jacqualyn (“Jackie”) Fouse, Ph.D. to its Board of Directors. Fred Craves, Ph.D. is retiring from the Board in July 2025.\nJulian Baker, Chairman of the Board of Directors, stated, “I am delighted to welcome Jackie Fouse to Madrigal. Jackie is an accomplished biotech executive who brings more than 30 years of healthcare industry and finance experience to the Madrigal Board. She will be a tremendous asset for Madrigal as the Company continues to grow and evolve.”\nMr. Baker continued, “On behalf of the Board, I would like to thank Fred Craves for his many years of service to Madrigal. From the outset of the Company through today, Fred’s leadership has been an invaluable part of Madrigal’s success.”\nBill Sibold, Chief Executive Officer of Madrigal, added, “Jackie Fouse’s appointment to our Board of Directors reflects Madrigal’s commitment to long-term leadership in MASH. I look forward to working with her to drive the launch of Rezdiffra, expand geographically, advance our clinical program in compensated MASH cirrhosis, and build our pipeline. I’d also like to thank Fred Craves for the instrumental role he has played at Madrigal for more than 15 years.”\nDr. Fouse was previously Chief Executive Officer of Agios Pharmaceuticals from 2019 to 2022 and currently serves as the Chair of the Board of Agios. Prior to joining Agios, she served in executive leadership roles at Celgene Corporation including President and Chief Operating Officer, President, Global Hematology & Oncology, and Chief Financial Officer. Before joining Celgene, Dr. Fouse served as chief financial officer of Bunge Limited, a leading global agribusiness and food company. Prior to Bunge, she served as Senior Vice President, Chief Financial Officer, and Head of Corporate Strategy at Alcon Laboratories, a leading ophthalmic pharmaceutical and medical device company. Prior to her tenure with Alcon, she held a variety of senior leadership roles with international companies. Dr. Fouse earned her B.A. and M.A. in economics and a Ph.D. in finance from the University of Texas at Arlington. She also holds an M.S. in environmental management from Yale and an M.S. in wildlife forensics and conservation from the University of Florida.\nDr. Fouse stated, “I am thrilled to be joining the Board of Directors of Madrigal, a company that has transformed care for patients with MASH. After years of challenges and setbacks in MASH drug development, Madrigal broke through with the first approved treatment, and the early launch of Rezdiffra has demonstrated the compelling benefit that this innovative medicine represents for patients. I look forward to working with this team that has successfully developed and launched Rezdiffra to deliver on Madrigal’s growth objectives in the years ahead.”\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward Looking Statements\nThis press release includes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to the launch of Rezdiffra and its expected use for treating MASH with moderate to advanced fibrosis, Madrigal’s aspirations to be the leading company in the MASH sector, and Madrigal’s plans to expand to Europe. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that does not have commercial experience; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; enrollment and trial conclusion uncertainties; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the timing and outcomes of clinical trials of Rezdiffra (resmetirom); the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission(“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 26, 2025, and as updated from time to time by Madrigal’s other filings with the SEC.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals Reports Fourth-Quarter and Full-Year 2024 Financial Results and Announces New Two-Year Data Demonstrating Potential Benefit of Rezdiffra™ (resmetirom) in Patients with Compensated MASH Cirrhosis",
    "link": "https://www.globenewswire.com/news-release/2025/02/26/3032756/0/en/Madrigal-Pharmaceuticals-Reports-Fourth-Quarter-and-Full-Year-2024-Financial-Results-and-Announces-New-Two-Year-Data-Demonstrating-Potential-Benefit-of-Rezdiffra-resmetirom-in-Pati.html",
    "date": "February 26, 2025 07:00 ET",
    "text": "Madrigal Pharmaceuticals Reports Fourth-Quarter and Full-Year 2024 Financial Results and Announces New Two-Year Data Demonstrating Potential Benefit of Rezdiffra™ (resmetirom) in Patients with Compensated MASH Cirrhosis\nFebruary 26, 2025 07:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nFourth-quarter and full-year 2024 Rezdiffra net sales of $103.3 million and $180.1 million, respectively\nAs of year-end 2024, more than 11,800 patients on Rezdiffra\nReports cash, cash equivalents, restricted cash and marketable securities of $931.3 million at December 31, 2024\nAnnounces new two-year data for the active-treatment open-label compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial\nCompany to host conference call today, February 26, 2025, at 8 a.m. EST\nCONSHOHOCKEN, Pa., Feb.  26, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ:MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today reports fourth-quarter and year-end 2024 financial results and reviews business highlights.\nBill Sibold, Chief Executive Officer of Madrigal, stated, “Looking back on 2024, I’m incredibly proud of what we accomplished. We secured FDA approval for Rezdiffra, the first medicine approved for MASH, in March; executed a first-in-disease launch with remarkable results; and are well positioned for strong performance again in 2025 and beyond.”\nSibold continued, “The U.S. launch of Rezdiffra has energized the MASH community, and we’re positioned to extend our leadership. Today, we’re sharing new two-year analyses from an active-treatment open-label extension arm of our Phase 3 MAESTRO-NAFLD-1 trial that demonstrate Rezdiffra continues to improve key markers of MASH fibrosis out to two years in patients with compensated MASH cirrhosis (F4c). These results add to the growing body of evidence supporting Rezdiffra’s potential benefit in this high-risk patient population, for which there is no approved therapy. A positive read out in our fully enrolled Phase 3 MAESTRO-NASH OUTCOMES trial could make Rezdiffra the first and only treatment for F2 to F4c MASH, and the only therapy with outcomes data this decade.”\nNew Two-Year Data from the Active-Treatment Open-Label Compensated MASH Cirrhosis Arm of the Rezdiffra Phase 3 MAESTRO-NAFLD-1 Trial\nMAESTRO-NAFLD-1 was a double-blind placebo-controlled, randomized Phase 3 safety trial conducted to support regulatory approval of Rezdiffra. The trial includes an active-treatment open-label extension arm in patients with compensated MASH cirrhosis. Madrigal previously reported one-year results for this active treatment arm.\nToday, the Company is announcing, two-year results (n=101):\nThe patient cohort achieved a mean 6.7 kPa reduction in liver stiffness as measured by vibration-controlled transient elastography (VCTE); this represents the largest VCTE reduction reported in an F4c MASH patient population to date. This reduction was statistically significant as compared to baseline.\n51% of patients achieved a ≥ 25% reduction in liver stiffness as measured by VCTE. A reduction of this magnitude has been associated with reduced progression to end-stage liver disease.\nRezdiffra’s safety and tolerability profile was consistent with other Rezdiffra clinical trials with a low discontinuation rate due to adverse events.\nMadrigal plans to present these data and additional findings from the active-treatment open-label cirrhosis arm of the MAESTRO-NAFLD-1 trial at a future medical meeting.\nThe results further support the potential benefit of Rezdiffra in patients with compensated MASH cirrhosis and the potential success of the ongoing MAESTRO-NASH OUTCOMES trial, a double blind, placebo-controlled, event-driven trial in F4c, for which data are anticipated in 2027.\n2024 Highlights\nLandmark FDA approval of Rezdiffra\nIn February 2024, Rezdiffra Phase 3 MAESTRO-NASH trial 52-week results were published in\nThe New England Journal of Medicine\n; the paper was subsequently chosen as one of the journal’s 14 notable scientific research articles of 2024.\nIn March 2024, Madrigal announced FDA approval of Rezdiffra for the treatment of adults with noncirrhotic MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis).\nIn April 2024, Rezdiffra became commercially available as the first and only approved therapy for MASH.\nExpert guidelines recommend Rezdiffra as first-line therapy for MASH\nIn June 2024, the European Association for the Study of the Liver (EASL) Congress updated their practice guidelines to recommend Rezdiffra as a first-line therapy for MASH, subject to regulatory approval in Europe.\nIn October 2024, the American Association for the Study of Liver Diseases (AASLD), a leading organization of scientists and health care professionals committed to preventing and curing liver disease, updated their practice guidelines to recommend Rezdiffra as a first-line therapy for MASH and implemented recommendations regarding its use for clinicians.\nDriving future growth through European expansion\nIn March 2024, Madrigal announced that the marketing authorization application (MAA) for resmetirom for the treatment of MASH with liver fibrosis was validated and is under evaluation with the European Medicines Agency’s (EMA) Committee for Medicinal Products for Human Use (CHMP). The CHMP opinion and subsequent European Union (EU) decision is expected in mid-2025.\nMadrigal expects to launch Rezdiffra in Europe on a country-by-country basis commencing with Germany in the second half of 2025, pending EMA approval, which would make it the first approved therapy for patients with MASH liver fibrosis in Europe.\nDriving future growth through indication expansion\nIn October 2024, Madrigal announced completion of enrollment in the MAESTRO-NASH OUTCOMES trial, an event-driven trial evaluating Rezdiffra in patients with F4c, an advanced and underserved patient population. Positive results could position Rezdiffra to become the only treatment for F2 to F4c MASH and the only therapy with outcomes data in MASH this decade.\nStrong presence at key liver meetings\nIn June 2024, Madrigal presented 10 abstracts at the EASL congress, including noninvasive test (NIT) data that demonstrated 91% of patients achieved improvement or stabilization of liver stiffness out to three years.\nIn November 2024, Madrigal had a significant presence at the AASLD Liver Meeting. Eleven Madrigal abstracts were presented at the meeting, including two oral presentations of new analyses from the Phase 3 MAESTRO-NASH trial of Rezdiffra.\nFourth-Quarter and Full-Year 2024 Financial Results\nTotal revenues:\nThe Company generated fourth-quarter and full-year 2024 net revenues of $103.3 million and $180.1 million, respectively. No product sales were recognized during the comparable prior year period.\nOperating Expenses:\nFourth-quarter and full-year 2024 operating expenses were $170.3 million and $678.0 million, respectively, compared to $117.2 million and $380.5 million in the comparable prior year periods.\nCost of sales:\nFourth-quarter and full-year 2024 cost of sales were $3.4 million and $6.2 million, respectively. Cost of sales were not recognized during the comparable prior year periods given that no product sales were recorded.\nR&D Expense:\nFourth-quarter and full-year 2024 R&D expense was $25.6 million and $236.7 million, respectively, compared to $70.6 million and $272.4 million in the comparable prior year periods. Research and development expenses decreased by $35.6 million in 2024 due primarily to a reduction in clinical trial accruals and the change in accounting for inventory costs following FDA approval of Rezdiffra in March 2024, partially offset by increases in headcount.\nSG&A Expense:\nFourth-quarter and full-year 2024 SG&A expense was $141.2 million and $435.1 million, respectively, compared to $46.5 million and $108.1 million in the comparable prior year periods. Selling, general and administrative expenses increased by $326.9 million in 2024 due primarily to increases for commercial launch activities for Rezdiffra, including a corresponding increase in headcount, and an increase in stock compensation expense.\nInterest Income:\nFourth-quarter and full-year 2024 interest income was $11.1 million and $46.7 million, respectively, compared to $9.0 million and $19.6 million in the comparable prior year periods. The increase in interest income was due primarily to higher principal balances and interest rates in 2024.\nInterest Expense:\nFourth-quarter and full-year 2024 interest expense was $3.5 million and $14.7 million, respectively, compared to $4.0 million and $12.7 million in the comparable prior year periods. The increase in interest expense in 2024 was primarily the result of a higher average outstanding principal balance during the period under the Madrigal’s loan facility.\nCash, Cash Equivalents, Restricted Cash and Marketable Securities:\nAs of December 31, 2024, Madrigal had cash, cash equivalents, restricted cash and marketable securities of $931.3 million, compared to $634.1 million at December 31, 2023. This increase was primarily attributable to the $659.9 million of net proceeds we received from our underwritten public offering in March 2024.\nConference Call and Webcast\nAt 8 a.m. EST today, February 26, 2025, Madrigal will host a webcast to review its financial and operating results and provide a general business update. To access the webcast, please visit the investor relations section of the Madrigal website or\nclick here\nto register. An archived webcast will be available on the Madrigal website following the event.\nAbout MASH\nMetabolic dysfunction-associated steatohepatitis (MASH), formerly known as nonalcoholic steatohepatitis (NASH), is a serious liver disease that can progress to cirrhosis, liver failure, liver cancer, need for liver transplantation, and premature mortality. MASH is expected to become the leading cause of liver transplantation in the U.S. and is already the leading cause of liver transplantation among women.\nOnce patients progress to MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis), the risk of adverse liver outcomes increases dramatically: these patients have a 10-17 times higher risk of liver-related mortality as compared to patients without fibrosis. Those who progress to cirrhosis face a 42 times higher risk of liver-related mortality, underscoring the need to treat MASH before complications of cirrhosis develop. MASH is also an independent driver of cardiovascular disease, the leading cause of mortality for patients.\nAn estimated 1.5 million patients have been diagnosed with MASH in the U.S., and Madrigal is focused on reaching approximately 315,000 patients with moderate to advanced fibrosis who are under the care of liver specialists. As MASH disease awareness improves and disease prevalence increases, the number of diagnosed patients with MASH with moderate to advanced fibrosis is expected to grow.\nAbout Rezdiffra\nWhat is Rezdiffra?\nRezdiffra is a prescribed medicine used along with diet and exercise to treat adults with nonalcoholic steatohepatitis (NASH) with moderate to advanced liver scarring (fibrosis), but not with cirrhosis of the liver.\nIt is not known if Rezdiffra is safe and effective in children (under 18 years old).\nThis indication is approved based on improvement of NASH and liver scarring (fibrosis). There are ongoing studies to confirm the clinical benefit of Rezdiffra.\nBefore you take Rezdiffra, tell your healthcare provider about all of your medical conditions, including if you:\nhave any liver problems other than NASH.\nhave gallbladder problems or have been told you have gallbladder problems, including gallstones.\nare pregnant or plan to become pregnant. It is not known if Rezdiffra will harm your unborn baby.\nare breastfeeding or plan to breastfeed. It is not known if Rezdiffra passes into your breast milk. Talk to your healthcare provider about the best way to feed your baby if you take Rezdiffra.\nTell your healthcare provider about all the medicines you take,\nincluding prescription and over-the-counter medicines, vitamins, and herbal supplements.\nRezdiffra and other medicines may affect each other, causing side effects. Rezdiffra may affect the way other medicines work, and other medicines may affect how Rezdiffra works.\nEspecially tell your healthcare provider if you take medicines that contain gemfibrozil to help lower your triglycerides, or cyclosporine to suppress your immune system, because Rezdiffra is not recommended in patients taking these medicines.\nTell your healthcare provider if you are taking medicines such as clopidogrel to thin your blood or statin medicines to help lower your cholesterol.\nKnow the medicines you take. Keep a list of them to show your healthcare provider and pharmacist when you get a new medicine.\nWhat are the possible side effects of Rezdiffra?\nRezdiffra may cause serious side effects, including:\nliver injury (hepatotoxicity). Stop taking Rezdiffra and call your healthcare provider right away if you develop the following signs or symptoms of hepatotoxicity: tiredness, nausea, vomiting, fever, rash, your skin or the white part of your eyes turns yellow (jaundice), pain or tenderness in the upper middle or upper right area of your stomach (abdomen).\ngallbladder problems. Gallbladder problems such as gallstones, inflammation of the gallbladder, or inflammation of the pancreas from gallstones can occur with NASH and may occur if you take Rezdiffra. Call your healthcare provider right away if you develop any signs or symptoms of these conditions including nausea, vomiting, fever, or pain in your stomach area (abdomen) that is severe and will not go away. The pain may be felt going from your abdomen to your back and the pain may happen with or without vomiting.\nThe most common side effects of Rezdiffra include:\ndiarrhea, nausea, itching, stomach (abdominal) pain, vomiting, dizziness, constipation.\nThese are not all the possible side effects of Rezdiffra. For more information, ask your healthcare provider or pharmacist.\nCall your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088 or\nwww.fda.gov/medwatch\n. You may also report side effects to Madrigal at 1-800-905-0324.\nPlease see the full\nPrescribing Information\n, including\nPatient Information\n, for Rezdiffra.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward Looking Statements\nThis press release\nincludes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including statements related to the launch of Rezdiffra and its expected use for treating MASH with moderate to advanced fibrosis, Madrigal’s aspirations to be the leading company in the MASH sector and Rezdiffra’s role as a foundational therapy, the timing and potential impact of results from the MAESTRO-NASH OUTCOMES trial, the timing for a regulatory decision by the European Commission and the planned launch of Rezdiffra in Europe. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that does not have commercial experience; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical trials, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s trials; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; enrollment and trial conclusion uncertainties; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; our ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive trials; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the timing and outcomes of clinical trials of Rezdiffra (resmetirom); the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission(“SEC”), for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 28, 2024, and Part II, Item 1A of its Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, filed with the SEC on October 31, 2024, and as updated from time to time by Madrigal’s other filings with the SEC.\nMadrigal Pharmaceuticals, Rezdiffra™ and associated logos are trademarks of Madrigal Pharmaceuticals, Inc.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\n(tables follow)\nMadrigal Pharmaceuticals, Inc.\nCondensed Consolidated Statement of Operations\n(in thousands, except share and per share amounts)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2024\n2023\n2024\n2023\nRevenues:\nProduct revenue, net\n$\n103,320\n$\n-\n$\n180,133\n$\n-\nOperating expenses:\nCost of sales\n3,445\n-\n6,233\n-\nResearch and development\n25,648\n70,640\n236,718\n272,350\nSelling, general and administrative\n141,224\n46,536\n435,057\n108,146\nTotal operating expenses\n170,317\n117,176\n678,008\n380,496\nLoss from operations\n(66,997\n)\n(117,176\n)\n(497,875\n)\n(380,496\n)\nInterest income\n11,079\n8,953\n46,654\n19,578\nInterest expense\n(3,498\n)\n(3,971\n)\n(14,671\n)\n(12,712\n)\nNet loss\n$\n(59,416\n)\n$\n(112,194\n)\n$\n(465,892\n)\n$\n(373,630\n)\nBasic and diluted net loss per common share\n$\n(2.71\n)\n$\n(5.68\n)\n$\n(21.90\n)\n$\n(19.99\n)\nBasic and diluted weighted average number of common shares outstanding\n21,929,425\n19,760,842\n21,272,962\n18,687,774\nCondensed Consolidated Balance Sheets\n(in thousands)\nDecember 31,\n2024\n2023\nCash, cash equivalents, restricted cash and marketable securities\n$\n931,251\n$\n634,131\nTrade receivables, net\n53,822\n-\nOther current assets\n47,854\n3,150\nOther non-current assets\n9,320\n3,266\nTotal assets\n$\n1,042,247\n$\n640,547\nLiabilities and Equity\nCurrent liabilities\n$\n169,277\n$\n118,548\nLong-term liabilities\n118,587\n116,666\nStockholders’ equity\n754,383\n405,333\nTotal liabilities and stockholders’ equity\n$\n1,042,247\n$\n640,547\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Announces New Two-Year Data from the Compensated MASH Cirrhosis Arm of the MAESTRO-NAFLD-1 Trial Demonstrating Potential Benefit of Rezdiffra™ (resmetirom) in Patients with Compensated MASH Cirrhosis",
    "link": "https://www.globenewswire.com/news-release/2025/02/26/3032712/0/en/Madrigal-Announces-New-Two-Year-Data-from-the-Compensated-MASH-Cirrhosis-Arm-of-the-MAESTRO-NAFLD-1-Trial-Demonstrating-Potential-Benefit-of-Rezdiffra-resmetirom-in-Patients-with-C.html",
    "date": "February 26, 2025 06:30 ET",
    "text": "Madrigal Announces New Two-Year Data from the Compensated MASH Cirrhosis Arm of the MAESTRO-NAFLD-1 Trial Demonstrating Potential Benefit of Rezdiffra™ (resmetirom) in Patients with Compensated MASH Cirrhosis\nFebruary 26, 2025 06:30 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nPatients achieved a mean 6.7 kPa reduction in liver stiffness as measured by vibration-controlled transient elastography (VCTE); this represents the largest reduction in liver stiffness reported in a compensated MASH cirrhosis patient population\n51% of patients achieved a ≥25% reduction in liver stiffness; a reduction of this magnitude has been associated with reduced progression to end-stage liver disease\nCompany to review topline data during its fourth-quarter and full-year 2024 financial results conference call today, February 26, 2025, at 8 a.m. EST\nCONSHOHOCKEN, Pa., Feb.  26, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ:MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today reported positive two-year results from the open-label compensated MASH cirrhosis (F4c) arm of the Phase 3 MAESTRO-NAFLD-1 trial of Rezdiffra (resmetirom). Patients treated with Rezdiffra achieved marked reductions in liver stiffness, a surrogate for fibrosis, measured by vibration-controlled transient elastography (VCTE).\nThe Phase 3 MAESTRO-NAFLD-1 trial of Rezdiffra included an open-label active treatment arm of patients with compensated MASH cirrhosis. Madrigal previously reported one-year results from this cohort. Following two years of treatment, 101 patients had VCTE results for analysis. Mean liver stiffness at baseline was 25 kPa and patients achieved a mean 6.7 kPa reduction in liver stiffness at two years (6.1 kPa at one year), which was statistically significant compared to baseline. This represents the largest reduction in liver stiffness reported to date in an F4c MASH population.\nMazen Noureddin, M.D., M.H.Sc., Professor of Medicine, Director Houston Research Institute and C.S.O. Summit Clinical Research, stated, “These data demonstrating patients with compensated MASH cirrhosis achieved marked reductions in VCTE are highly encouraging. We use the ‘Baveno rule of 5 kPa’ to stratify risk of liver-related events in patients with MASH, so a mean 6.7 kPa reduction suggests that many patients are moving into a lower risk category. The results are particularly meaningful in light of recently published, multi-center, longitudinal studies\n1,2\ndemonstrating VCTE is a strong predictor of clinical outcomes and may be more predictive of clinical outcomes than fibrosis stage assessed by liver biopsy.”\nIn a responder analysis examining ≥25% improvement or worsening of liver stiffness, 51% of patients achieved improvement. An improvement of this magnitude has been associated with reduced progression to end-stage liver disease.\n1\nThe safety and tolerability profile of Rezdiffra in the compensated MASH cohort of MAESTRO-NAFLD-1 was consistent with other Rezdiffra clinical trials, with a low rate of discontinuations due to adverse events.\nBecky Taub, M.D., Chief Medical Officer and President of Research & Development of Madrigal, stated, “Patients with MASH who progress to cirrhosis face a 42 times higher risk of liver-related mortality, so there is an urgent need to improve care for this underserved population with no approved treatment options. The new two-year data from MAESTRO-NAFLD-1 reinforce our confidence in the ongoing, fully enrolled MAESTRO-NASH OUTCOMES trial of Rezdiffra in patients with compensated MASH cirrhosis. If our OUTCOMES trial is successful, Rezdiffra has the potential to become the first therapy for F2-F4c MASH. It is important to remember that Rezdiffra should not be used for the treatment of patients with compensated MASH cirrhosis until safety and efficacy are established in our Phase 3 trial and the medication receives approval for this indication from regulatory authorities.”\nDraft FDA guidance recommends that Phase 3 clinical trials in MASH cirrhosis use outcomes as an endpoint, as opposed to biopsy-based surrogate endpoints. This guidance, along with data from the open-label compensated MASH cirrhosis arm of MAESTRO-NAFLD-1, informed the design of the ongoing Phase 3 MAESTRO-NASH OUTCOMES trial.\nMadrigal plans to present additional results from the compensated MASH cirrhosis arm of the MAESTRO-NAFLD-1 trial at a future medical conference.\nRezdiffra is indicated in conjunction with diet and exercise for the treatment of adults with noncirrhotic MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis). Continued approval for this indication may be contingent upon verification and description of clinical benefit in ongoing confirmatory trials. Rezdiffra is not approved for the treatment of patients with MASH cirrhosis.\nAbout MASH\nMetabolic dysfunction-associated steatohepatitis (MASH), formerly known as nonalcoholic steatohepatitis (NASH), is a serious liver disease that can progress to cirrhosis, liver failure, liver cancer, need for liver transplantation, and premature mortality. MASH is expected to become the leading cause of liver transplantation in the U.S. and is already the leading cause of liver transplantation among women.\nOnce patients progress to MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis), the risk of adverse liver outcomes increases dramatically: these patients have a 10-17 times higher risk of liver-related mortality as compared to patients without fibrosis. Those who progress to cirrhosis face a 42 times higher risk of liver-related mortality, underscoring the need to treat MASH before complications of cirrhosis develop. MASH is also an independent driver of cardiovascular disease, the leading cause of mortality for patients.\nAn estimated 1.5 million patients have been diagnosed with MASH in the U.S., and Madrigal is focused on reaching approximately 315,000 patients with moderate to advanced fibrosis who are under the care of liver specialists. As MASH disease awareness improves and disease prevalence increases, the number of diagnosed patients with MASH with moderate to advanced fibrosis is expected to grow.\nAbout Rezdiffra\nWhat is Rezdiffra?\nRezdiffra is a prescribed medicine used along with diet and exercise to treat adults with nonalcoholic steatohepatitis (NASH) with moderate to advanced liver scarring (fibrosis), but not with cirrhosis of the liver.\nIt is not known if Rezdiffra is safe and effective in children (under 18 years old).\nThis indication is approved based on improvement of NASH and liver scarring (fibrosis). There are ongoing studies to confirm the clinical benefit of Rezdiffra.\nBefore you take Rezdiffra, tell your healthcare provider about all of your medical conditions, including if you:\nhave any liver problems other than NASH.\nhave gallbladder problems or have been told you have gallbladder problems, including gallstones.\nare pregnant or plan to become pregnant. It is not known if Rezdiffra will harm your unborn baby.\nare breastfeeding or plan to breastfeed. It is not known if Rezdiffra passes into your breast milk. Talk to your healthcare provider about the best way to feed your baby if you take Rezdiffra.\nTell your healthcare provider about all the medicines you take,\nincluding prescription and over-the-counter medicines, vitamins, and herbal supplements.\nRezdiffra and other medicines may affect each other, causing side effects. Rezdiffra may affect the way other medicines work, and other medicines may affect how Rezdiffra works.\nEspecially tell your healthcare provider if you take medicines that contain gemfibrozil to help lower your triglycerides, or cyclosporine to suppress your immune system, because Rezdiffra is not recommended in patients taking these medicines.\nTell your healthcare provider if you are taking medicines such as clopidogrel to thin your blood or statin medicines to help lower your cholesterol.\nKnow the medicines you take. Keep a list of them to show your healthcare provider and pharmacist when you get a new medicine.\nWhat are the possible side effects of Rezdiffra?\nRezdiffra may cause serious side effects, including:\nliver injury (hepatotoxicity). Stop taking Rezdiffra and call your healthcare provider right away if you develop the following signs or symptoms of hepatotoxicity: tiredness, nausea, vomiting, fever, rash, your skin or the white part of your eyes turns yellow (jaundice), pain or tenderness in the upper middle or upper right area of your stomach (abdomen).\ngallbladder problems. Gallbladder problems such as gallstones, inflammation of the gallbladder, or inflammation of the pancreas from gallstones can occur with NASH and may occur if you take Rezdiffra. Call your healthcare provider right away if you develop any signs or symptoms of these conditions including nausea, vomiting, fever, or pain in your stomach area (abdomen) that is severe and will not go away. The pain may be felt going from your abdomen to your back and the pain may happen with or without vomiting.\nThe most common side effects of Rezdiffra include:\ndiarrhea, nausea, itching, stomach (abdominal) pain, vomiting, dizziness, constipation.\nThese are not all the possible side effects of Rezdiffra. For more information, ask your healthcare provider or pharmacist.\nCall your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088 or\nwww.fda.gov/medwatch\n. You may also report side effects to Madrigal at 1-800-905-0324.\nPlease see the full\nPrescribing Information\n, including\nPatient Information\n, for Rezdiffra.\nAbout the Rezdiffra Phase 3 Program\nMadrigal is currently conducting multiple\nPhase 3 clinical trials\nto evaluate the safety and efficacy of Rezdiffra for the treatment of moderate to advanced fibrosis (consistent with fibrosis stages F2-F3) and compensated MASH cirrhosis (consistent with F4c):\nThe pivotal\nMAESTRO-NASH (Moderate to Advanced Fibrosis)\ntrial included a 52-week biopsy assessment that supported accelerated approval and an ongoing 54-month outcomes trial designed to generate confirmatory data that, if positive, will help verify the clinical benefit of Rezdiffra and support full approval. The primary results of the MAESTRO-NASH trial were published in the\nNew England Journal of Medicine\nin February 2024.\nMAESTRO-NASH OUTCOMES (Compensated Cirrhosis)\nevaluates progression to liver decompensation events in patients with compensated NASH cirrhosis treated with Rezdiffra versus placebo. A positive outcome is expected to support the full approval of Rezdiffra for noncirrhotic MASH and expand the eligible patient population for Rezdiffra with an additional indication in patients with compensated MASH cirrhosis.\nThe\nMAESTRO-NAFLD-1 (Safety)\ntrial was designed to noninvasively evaluate the safety and tolerability of Rezdiffra and provide a larger safety database to support regulatory benefit-risk assessment. The primary results from the MAESTRO-NAFLD-1 trial were published in\nNature Medicine\nin October 2023. MAESTRO-NAFLD-OLE, an open-label active treatment extension of MAESTRO-NAFLD-1, is ongoing to collect additional safety data in patients with noncirrhotic NASH and patients with compensated NASH cirrhosis.\nData from the 52-week portion of MAESTRO-NASH, together with data from MAESTRO-NAFLD-1, MAESTRO-NAFLD-OLE, Phase 2 and Phase 1 data, including safety parameters, formed the basis for accelerated approval of Rezdiffra for treatment of MASH with moderate to advanced liver fibrosis.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. Rezdiffra is the first and only medication approved by the FDA for the treatment of MASH with moderate to advanced fibrosis (consistent with stages F2 to F3). An ongoing Phase 3 outcomes trial is evaluating Rezdiffra for the treatment of compensated MASH cirrhosis (consistent with stage F4c). For more information, visit\nwww.madrigalpharma.com\n.\nForward Looking Statements\nThis press release\nincludes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including Rezdiffra’s potential ability to treat patients with compensated MASH cirrhosis, Madrigals intentions to present data from the MAESTRO-NAFLD-1 trial at a medical conference and expectations regarding the MAESTRO NASH OUTCOMES trial. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that does not have commercial experience; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical studies, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s studies; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; enrollment and trial conclusion uncertainties; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; the ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive studies; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the timing and outcomes of clinical studies of Rezdiffra (resmetirom); the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission, or SEC, for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 28, 2024, and Part II, Item 1A of its Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, filed with the SEC on October 31, 2024, and as updated from time to time by Madrigal’s other filings with the SEC.\n1. Lin H, Lee HW, Yip TC, et al. Vibration-Controlled Transient Elastography Scores to Predict Liver-Related Events in Steatotic Liver Disease. JAMA. 2024;331(15):1287–1297.\n2. Gawrieh, S, et al. Increases and Decreases in Liver Stiffness Measurement are independently associated with the risk of liver-related events in NAFLD. Journal of Hepatology. 2024;81(4):600–608.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals to Participate in the 45th Annual TD Cowen Health Care Conference",
    "link": "https://www.globenewswire.com/news-release/2025/02/21/3030423/0/en/Madrigal-Pharmaceuticals-to-Participate-in-the-45th-Annual-TD-Cowen-Health-Care-Conference.html",
    "date": "February 21, 2025 08:00 ET",
    "text": "Madrigal Pharmaceuticals to Participate in the 45th Annual TD Cowen Health Care Conference\nFebruary 21, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., Feb.  21, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) today announced that the company will participate in the 45th Annual TD Cowen Health Care Conference on Tuesday, March 4, 2025 at 11:10 A.M. ET.\nThe presentation will be webcast live and may be accessed\nhere\nor by visiting Madrigal’s Investor Relations Events\npage\n. A replay of the webcast will be available after the event.\nAbout Madrigal Pharmaceuticals\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. For more information, visit\nwww.madrigalpharma.com\n.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals to Release Fourth-Quarter and Full-Year 2024 Financial Results and Host Webcast on February 26, 2025",
    "link": "https://www.globenewswire.com/news-release/2025/02/12/3024964/0/en/Madrigal-Pharmaceuticals-to-Release-Fourth-Quarter-and-Full-Year-2024-Financial-Results-and-Host-Webcast-on-February-26-2025.html",
    "date": "February 12, 2025 08:00 ET",
    "text": "Madrigal Pharmaceuticals to Release Fourth-Quarter and Full-Year 2024 Financial Results and Host Webcast on February 26, 2025\nFebruary 12, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., Feb.  12, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) announced today that it will release its fourth-quarter and full-year 2024 financial results on Wednesday, Feb. 26, 2025, prior to the open of the U.S. financial markets.\nFollowing the announcement, Madrigal’s management will host a live webcast at 8 a.m. Eastern Time to review the Company’s financial and operating results.\nThe live webcast may be accessed at the Investor Relations section of the Madrigal Pharmaceuticals\nwebsite\n. To ensure a timely connection, it is recommended that participants register\nhere\nat least 15 minutes prior to the scheduled webcast.\nThe webcast will be available approximately two hours after the live webcast.\nAbout Madrigal Pharmaceuticals\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. For more information, visit\nwww.madrigalpharma.com\n.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nMASH\nbiotech\nNASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals Announces Preliminary* Fourth-Quarter and Full-Year 2024 Net Sales, Year-End Cash and Total Patients on Rezdiffra",
    "link": "https://www.globenewswire.com/news-release/2025/01/13/3008269/0/en/Madrigal-Pharmaceuticals-Announces-Preliminary-Fourth-Quarter-and-Full-Year-2024-Net-Sales-Year-End-Cash-and-Total-Patients-on-Rezdiffra.html",
    "date": "January 13, 2025 06:45 ET",
    "text": "Madrigal Pharmaceuticals Announces Preliminary* Fourth-Quarter and Full-Year 2024 Net Sales, Year-End Cash and Total Patients on Rezdiffra\nJanuary 13, 2025 06:45 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nPreliminary fourth-quarter and full-year 2024 Rezdiffra™ (resmetirom) net sales ranges of $100 million to $103 million and $177 million to $180 million, respectively\nPreliminary year-end 2024 cash, cash equivalents, restricted cash and marketable securities of approximately $931 million\nAs of year-end 2024, more than 11,800 patients on Rezdiffra\nMadrigal to present at the 43\nrd\nAnnual J.P. Morgan Healthcare Conference at 2:15 p.m. PST (5:15 p.m. EST) on Wednesday January 15, 2025\nCONSHOHOCKEN, Pa., Jan.  13, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (NASDAQ:MDGL), a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), today announced an update on its business performance, including preliminary* fourth-quarter and year-end net sales, year-end cash and patients on Rezdiffra.\nBill Sibold, Chief Executive Officer of Madrigal, stated, “2024 was a transformational year for Madrigal and the MASH field. Rezdiffra received U.S. FDA approval as the first and only treatment for MASH; we built an expert team for launch; and now more than 11,800 patients are on therapy. Our success reflects exceptional execution and the urgent need for treatments for this serious liver disease, expected to become the leading cause of liver transplants in the U.S.”\nSibold continued, “As we build momentum in the U.S., we are pursuing additional growth opportunities, including preparing for European expansion in the second half of 2025. Looking ahead, the MAESTRO-NASH OUTCOMES trial in compensated cirrhosis could unlock further growth, positioning Rezdiffra as the only treatment for F2 to F4 MASH and the only therapy with outcomes data this decade.”\nPreliminary Fourth-Quarter and Full-Year 2024 Financial Performance and Rezdiffra Patients\nPreliminary fourth-quarter and full-year 2024 Rezdiffra net sales ranges of $100 million to $103 million and $177 million to $180 million, respectively.\nPreliminary year-end 2024 cash, cash equivalents, restricted cash and marketable securities of approximately $931 million.\nMore than 11,800 patients on Rezdifrra as of year-end 2024.\n2024 Accomplishments\nOn February 8, the Rezdiffra Phase 3 MAESTRO-NASH trial results were published in\nThe New England Journal of Medicine\n; the paper was subsequently chosen as one of the journal’s 14 notable scientific research articles of 2024.\nOn March 5, announced EMA validation of the Marketing Authorization Application (MAA) for Rezdiffra; Company anticipates EMA decision mid-2025 with a country-by-country launch in Europe expected to commence with Germany in second-half 2025, subject to EMA approval.\nOn March 14, received U.S. FDA approval for Rezdiffra, the first and only approved MASH therapy, and subsequently launched the medicine.\nOn October 21, announced completion of enrollment in the MAESTRO-NASH OUTCOMES study, an event-driven trial evaluating Rezdiffra in patients with compensated MASH cirrhosis. Positive results could position Rezdiffra to become the first treatment available for this advanced and underserved population.\nJ.P. Morgan Healthcare Conference Presentation and Webcast\nBill Sibold, Chief Executive Officer of Madrigal, will discuss these updates as part of a webcast presentation at the 43\nrd\nannual J.P. Morgan Healthcare Conference in San Francisco on Wednesday, January 15 at 2:15 p.m. PST (5:15 p.m. EST). The event will be available via live webcast on Madrigal’s Investor Relations page [\nLINK HERE\n].\nAbout MASH\nMetabolic dysfunction-associated steatohepatitis (MASH), formerly known as nonalcoholic steatohepatitis (NASH), is a serious liver disease that can progress to cirrhosis, liver failure, liver cancer, need for liver transplantation, and premature mortality. MASH is expected to become the leading cause of liver transplantation in the U.S. and is already the leading cause of liver transplantation among women.\nOnce patients progress to MASH with moderate to advanced liver fibrosis (consistent with stages F2 to F3 fibrosis), the risk of adverse liver outcomes increases dramatically: these patients have a 10-17 times higher risk of liver-related mortality as compared to patients without fibrosis. Those who progress to cirrhosis face a 42 times higher risk of liver-related mortality, underscoring the need to treat MASH before complications of cirrhosis develop. MASH is also an independent driver of cardiovascular disease, the leading cause of mortality for patients.\nAn estimated 1.5 million patients have been diagnosed with MASH in the U.S., and Madrigal is focused on reaching approximately 315,000 patients with moderate to advanced fibrosis who are under the care of liver specialists. As MASH disease awareness improves and disease prevalence increases, the number of diagnosed patients with MASH with moderate to advanced fibrosis is expected to grow.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. For more information, visit\nwww.madrigalpharma.com\n.\nForward Looking Statements\nThis press release\nincludes “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended, including preliminary selected financial results, Madrigal’s ability to execute its strategy, the planned commercial launch of Rezdiffra in Europe and expectations regarding the MAESTRO NASH OUTCOMES trial. Forward-looking statements are subject to a number of risks and uncertainties including, but not limited to: the assumptions underlying the forward-looking statements; the finalization and audit of Madrigal’s fourth quarter and 2024 fiscal year financial results which could potentially result in changes or adjustments to the selected preliminary financial results presented herein; risks of obtaining and maintaining regulatory approvals, including, but not limited to, potential regulatory delays or rejections; the challenges with the commercial launch of a new product, particularly for a company that does not have commercial experience; our history of operating losses and the possibility that we may never achieve or maintain profitability; risks associated with meeting the objectives of Madrigal’s clinical studies, including, but not limited to Madrigal’s ability to achieve enrollment objectives concerning patient numbers (including an adequate safety database), outcomes objectives and/or timing objectives for Madrigal’s studies; any delays or failures in enrollment, and the occurrence of adverse safety events; risks related to the effects of Rezdiffra’s (resmetirom’s) mechanism of action; enrollment and trial conclusion uncertainties; market demand for and acceptance of Rezdiffra; the potential inability to raise sufficient capital to fund ongoing operations as currently planned or to obtain financing on acceptable terms; the ability to service indebtedness and otherwise comply with debt covenants; outcomes or trends from competitive studies; future topline data timing or results; our ability to prevent and/or mitigate cyber-attacks; the timing and outcomes of clinical studies of Rezdiffra (resmetirom); the uncertainties inherent in clinical testing; uncertainties concerning analyses or assessments outside of a controlled clinical trial; and changes in laws and regulations applicable to our business and our ability to comply with such laws and regulations. Undue reliance should not be placed on forward looking statements, which speak only as of the date they are made. Madrigal undertakes no obligation to update any forward-looking statements to reflect new information, events, or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Madrigal’s submissions filed with the U.S. Securities and Exchange Commission, or SEC, for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied. Madrigal specifically discusses these risks and uncertainties in greater detail in the sections appearing in Part I, Item 1A of its Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 28, 2024, and Part II, Item 1A of its Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, filed with the SEC on October 31, 2024, and as updated from time to time by Madrigal’s other filings with the SEC.\n*\nFourth quarter and full-year 2024 financial results are preliminary, unaudited, subject to adjustment, and provided as an approximation in advance of the Company’s announcement of complete financial results in February 2025. This information is based on currently available information. Madrigal has provided estimated ranges primarily because financial closing controls and procedures for the quarter are not yet completed and final results may therefore vary from these estimates. These preliminary estimates have not been audited by Madrigal’s independent registered public accounting firm.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nNASH\nMASH"
  },
  {
    "ticker": "MDGL",
    "title": "Madrigal Pharmaceuticals to Present at the 43rd Annual J.P. Morgan Healthcare Conference",
    "link": "https://www.globenewswire.com/news-release/2025/01/03/3003981/0/en/Madrigal-Pharmaceuticals-to-Present-at-the-43rd-Annual-J-P-Morgan-Healthcare-Conference.html",
    "date": "January 03, 2025 08:00 ET",
    "text": "Madrigal Pharmaceuticals to Present at the 43rd Annual J.P. Morgan Healthcare Conference\nJanuary 03, 2025 08:00 ET\n| Source:\nMadrigal Pharmaceuticals, Inc.\nFollow\nMadrigal Pharmaceuticals, Inc.\nShare\nCONSHOHOCKEN, Pa., Jan.  03, 2025  (GLOBE NEWSWIRE) -- Madrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) today announced that the Company will present at the 43\nrd\nAnnual J.P. Morgan Healthcare Conference on Wednesday, January 15, 2025 at 2:15 pm PT. The presentation will be webcast live and can be accessed\nhere\nor by visiting Madrigal’s\nInvestor Relations Site, Events and Presentations\n.\nAbout Madrigal\nMadrigal Pharmaceuticals, Inc. (Nasdaq: MDGL) is a biopharmaceutical company focused on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH), a liver disease with high unmet medical need. Madrigal’s medication, Rezdiffra (resmetirom), is a once-daily, oral, liver-directed THR-β agonist designed to target key underlying causes of MASH. For more information, visit\nwww.madrigalpharma.com\n.\nInvestor Contact\nTina Ventura,\nIR@madrigalpharma.com\nMedia Contact\nChristopher Frates,\nmedia@madrigalpharma.com\nTags\nbiotech\nNASH\nMASH"
  }
]