[
  {
    "ticker": "OVID",
    "title": "Draig Therapeutics Appoints Experienced Biotech Leader Douglas E. Williams, Ph.D. as Chair of its Board of Directors",
    "link": "https://www.globenewswire.com/news-release/2025/07/15/3115340/0/en/Draig-Therapeutics-Appoints-Experienced-Biotech-Leader-Douglas-E-Williams-Ph-D-as-Chair-of-its-Board-of-Directors.html",
    "date": "July 15, 2025 04:00 ET",
    "text": "Draig Therapeutics Appoints Experienced Biotech Leader Douglas E. Williams, Ph.D. as Chair of its Board of Directors\nJuly 15, 2025 04:00 ET\n| Source:\nDraig Therapeutics\nFollow\nDraig Therapeutics\nShare\nStrong track record at executive and board level of building company value across all stages of development including supporting the development of multiple blockbuster medicines\nCardiff, United Kingdom – 15 July 2025\n– Draig Therapeutics (“Draig”), a clinical-stage company aiming to transform the treatment of neuropsychiatric diseases, today announces the appointment of Douglas E. Williams, Ph.D. as independent Chair of its Board of Directors. He takes over from Ruth McKernan, who retains her role on the Board as a Director and Interim Chief Executive Officer (CEO).\nDr Williams brings more than 30 years of experience in the biopharmaceutical sector, having held executive leadership and board roles across some of the industry’s most innovative companies including Biogen, ZymoGenetics, Amgen and Seattle Genetics and contributed to the development of several blockbusters therapies, including Enbrel®, Tecfidera® and Spinraza®.\nRuth McKernan, Interim CEO and founder of Draig Therapeutics, said,\n“Douglas’s exceptional track record of developing innovative therapies and driving strategic growth makes him an ideal leader for our Board. I could not be more delighted. The Company looks forward to benefitting from his leadership and guidance in delivering transformative neuropsychiatric therapies.”\n“I am honoured to take on the role of Chair as Draig Therapeutics advances its exciting pipeline into the next phases of clinical development,”\nsaid Douglas E. Williams, incoming Chair of Draig Therapeutics\n. “More effective therapies for major depressive disorder and other neuropsychiatric disorders remain significant unmet needs for millions of people worldwide. Draig’s scientific approach to develop novel medicines for these patients is both compelling and differentiated, and I look forward to working closely with the board and its exceptional leadership team to support the Company achieve its goals.”\nMost recently, Dr Williams served as the President of R&D at Sana Biotechnology, a leading cell therapy company. Prior to joining Sana, he was the founding CEO of Codiak Biosciences, where he led the company through several private financing rounds as well as a successful initial public offering. Previously, Dr Williams was Executive Vice President (EVP) of Research and Development at Biogen where he played a key role in advancing multiple programmes. Before joining Biogen, he was CEO and a board member at ZymoGenetics, where he led the company through its acquisition by Bristol Myers Squibb in 2010.\nEarlier in his career, Dr Williams held senior leadership roles at several prominent biotech companies, including Chief Scientific Officer and EVP R&D at Seattle Genetics (Seagen, acquired by Pfizer in 2023 for $43 billion), and Senior VP and Washington Site Leader at Amgen. He spent over a decade at Immunex, where he served as EVP and Chief Technology Officer, and was a member of the Board of Directors.\nDr Williams currently serves on the boards of numerous biotechnology companies, including Climb Bio (Chair) and CAMP4 Therapeutics, eGenesis and Stablix (Director). He has also previously been Chair or Director on the boards of multiple private and public companies in the US and Europe over the past 30 years, including CytoImmune Therapeutics, Xenikos, Array Biopharma, AC Immune, Ovid Therapeutics, Ironwood Pharmaceuticals and Regulus Therapeutics, among others.\nENDS\nFor further information:\nMark Swallow, Sandi Greenwood\nE-mail:\ndraigtx@medistrava.com\nDraig Therapeutics\nE-mail:\nrmckernan@draigtherapeutics.com\nAbout Draig Therapeutics\nDraig Therapeutics is a clinical-stage company with a mission to transform treatments in Neuropsychiatry. The company is leveraging its founders’ unique scientific expertise in modulating the core glutamate / GABA pathways that play a critical role in neuropsychiatric diseases to advance a pipeline of groundbreaking therapies designed to address large unmet patient needs, including in Major Depressive Disorder (MDD).\nDraig is the Welsh word for ‘dragon’ and it reflects the company’s origins in Wales. The name and logo were inspired by this heritage, reflecting its scientific roots stemming from Cardiff University.\nDraig was co-founded by Cardiff University and SV Health Investors, which led the seed financing with ICG, and is backed by other leading healthcare venture firms including Access Biotechnology, Canaan Partners, SR One, Sanofi Ventures and Schroders Capital. For more information, please visit\nwww.draigtherapeutics.com\nAttachment\nDouglas E. Williams, Ph.D.\nDouglas E. Williams, Ph.D.\nChair of the Board of Directors\nTags\nappointment\nneuropsychiatric disease\nbiotech\nMajor Depressive Disorder\nBoard Chairman"
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics Enters Agreement with Immedica Pharma AB for Sale of Future Ganaxolone Royalties",
    "link": "https://www.globenewswire.com/news-release/2025/06/25/3105008/0/en/Ovid-Therapeutics-Enters-Agreement-with-Immedica-Pharma-AB-for-Sale-of-Future-Ganaxolone-Royalties.html",
    "date": "June 25, 2025 08:00 ET",
    "text": "Ovid Therapeutics Enters Agreement with Immedica Pharma AB for Sale of Future Ganaxolone Royalties\nNon-dilutive funding extends Ovid’s operational runway; Immedica assumes certain ganaxolone IP costs\nJune 25, 2025 08:00 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nNEW YORK and STOCKHOLM, Sweden, June  25, 2025  (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (Nasdaq: OVID), a biopharmaceutical company dedicated to developing small molecule medicines for brain conditions with significant unmet need, today announced that it has entered into a definitive agreement with Immedica Pharma AB (‘Immedica’), a leading global rare disease company, for the sale of its future royalties related to sales of ganaxolone outside of China. Under the terms of the agreement, Immedica will pay $7 million in cash to acquire 100% of the royalty rights held by Ovid, further strengthening Immedica’s focus on ganaxolone by acquiring control of additional intellectual property rights.\nThis transaction provides a non-dilutive capital infusion of $7 million to Ovid, which will support the Company’s ongoing operations. In 2024, Ovid recorded approximately $566,000 in ganaxolone royalty revenues. Ovid has not been pursuing development of ganaxolone, and the transaction has no impact to the Company’s current pipeline of programs.\nIn February 2022, Ovid entered into an exclusive patent license agreement with Marinus Pharmaceuticals, Inc.(‘Marinus’) related to the use of ganaxolone in CDKL5 deficiency disorder (CDD). Under that agreement, Ovid was eligible to receive royalties on the sales of ganaxolone for CDD in the United States and Europe. In addition to acquiring future royalty rights related to the use of ganaxolone in CDD, Immedica has entered into an agreement to acquire or license the global ganaxolone intellectual property (IP) portfolio from Ovid and to amend the license to include additional indications. Immedica will assume financial responsibility for all costs related to the licensed IP, when such amendment has been finalized.\nThe royalty rights being acquired by Immedica include royalties associated with the Marinus agreement. In February 2025, Immedica announced the completion of the acquisition of Marinus.\nGanaxolone\nGanaxolone is a medicine approved in the EU, Great Britain, the U.S and China for the adjunctive treatment of epileptic seizures associated with cyclin-dependent kinase-like 5 (CDKL5) deficiency disorder (‘CDD’) in patients 2 to 17 years of age. Ganaxolone may be continued in patients 18 years of age and older.\nAbout Immedica\nImmedica is a pharmaceutical company, headquartered in Stockholm, Sweden, focused on the commercialization of medicines for rare diseases and specialty care products. Immedica’s capabilities cover marketing and sales, compliance, pharmacovigilance, quality assurance, regulatory, medical affairs and market access, as well as a global distribution network serving patients in more than 50 countries. Immedica is fully dedicated to helping those living with diseases which have a large unmet medical need. Immedica’s therapeutic areas are within RARE metabolic, RARE hematology & oncology, RARE neurology and specialty care. Immedica was founded in 2018 and employs today around 140 people across Europe, the Middle East and the United States. Immedica is backed by the investment firms KKR and Impilo. For more information visit\nwww.immedica.com\n.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing small molecule medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, targeted small molecule candidates that modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, OV4071 and others within a library of compounds that directly activate the KCC2 transporter, for multiple CNS disorders. For more information about these and other Ovid research programs, please visit\nwww.ovidrx.com\n.\nForward-Looking Statements\nThis press release includes certain disclosures that contain “forward-looking statements” including, without limitation: statements regarding Ovid’s ongoing operations, its pipeline and finalizing an amendment of the license to include additional indications; and other statements that are not historical fact. You can identify forward-looking statements because they contain words such as “anticipates,” “believes,” “expects,” “intends,” “may,” “plan,” “potentially,” and “will,” and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances). Forward-looking statements are based on Ovid’s current expectations and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that may differ materially from those contemplated by the forward-looking statements, which are neither statements of historical fact nor guarantees or assurances of future performance. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, without limitation, uncertainties inherent in the preclinical and clinical development and regulatory approval processes, risks related to Ovid’s ability to achieve its financial objectives, the risk that Ovid may not be able to realize the intended benefits of its business strategy or unanticipated or greater than anticipated impacts or delays due to macroeconomic and geopolitical conditions. Additional risks that could cause actual results to differ materially from those in the forward-looking statements are set forth under the caption “Risk Factors” in Ovid’s most recently filed Annual Report on Form 10-K and Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission (“SEC”), and in subsequent and future filings Ovid makes with the SEC. Any forward-looking statements contained in this press release speak only as of the date hereof, and Ovid assumes no obligation to update any forward-looking statements contained herein, whether because of any new information, future events, changed circumstances or otherwise, except as otherwise required by law.\nOvid\nVictoria Fort, SVP Corporate Affairs and Corporate Strategy\nvfort@ovidrx.com\nImmedica\nLinda Holmström, Head of Communications\nlinda.holmstrom@immedica.com\nTags\nbiotech"
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics to Host Investor and Media Event Thursday, June 12, 2025",
    "link": "https://www.globenewswire.com/news-release/2025/06/05/3094269/0/en/Ovid-Therapeutics-to-Host-Investor-and-Media-Event-Thursday-June-12-2025.html",
    "date": "June 05, 2025 07:30 ET",
    "text": "Ovid Therapeutics to Host Investor and Media Event Thursday, June 12, 2025\nEmerging Biomarkers in the Clinical Development of Epilepsy Medicines and OV329 Program Highlights\nJune 05, 2025 07:30 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nNEW YORK, June 05, 2025 (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (NASDAQ: OVID), a biopharmaceutical company dedicated to developing medicines for brain conditions with significant unmet need, will host an investor and media event on Thursday, June 12, 2025, on the topic of applying\nBiomarkers in Epilepsy,\nincluding their strategic use to demonstrate the pharmacodynamic activity of the Company’s OV329 clinical development program. World-leading expert, Dr. Alexander Rotenberg will join company management to discuss the emerging use of a wide range of biomarkers for the study of anti-seizure medicines. The event will take place at Ovid’s headquarters in New York’s Hudson Yards from 9:30 to 10:30 am ET and will be webcast simultaneously.\nSophisticated imaging and radiological tools are increasingly enabling medicines developers to leverage biomarkers earlier in clinical development to identify signals of biological target engagement and pharmacodynamic activity. Discussion will focus on how these tools drive evidence informed approaches in drug development and provide insight into potential clinical outcomes. Ovid management will describe the exploratory biomarkers in use to measure its next-generation GABA-aminotransferase (GABA-AT) inhibitor program, OV329, which is anticipated to have a topline readout in Q3 2025.\nKeynote speaker:\nLeading pediatric neurologist and epileptologist Alexander Rotenberg, M.D., Ph.D.\nProfessor of Neurology at Boston Children’s Hospital and Harvard Medical School, and Director of the Epilepsy Monitoring Unit at Boston Children’s Hospital, and the Experimental Neurophysiology Core at F.M. Kirby Center of Neurobiology\nUnfortunately, nearly 40 percent of people living with epilepsy continue to experience seizures despite existing medicines. OV329 is a next-generation GABA-AT inhibitor, that was rationally designed to work differently from current medicines and may offer a novel approach for patients with treatment-resistant seizures. OV329 seeks to endogenously deliver optimal levels of GABA to reduce seizures and provide a preferable safety and tolerability profile relative to the first-generation, GABA-AT inhibitor, vigabatrin. OV329 is currently completing a Phase 1 study that is evaluating its effects on multiple pharmacodynamic biomarkers, safety, tolerability, and pharmacokinetics.\nInterested in attending or participating remotely:\nTo register, please visit:\nRegistration Link\nA live webcast of the presentation can be accessed through the Events & Presentations section of Ovid's website at\nhttps://investors.ovidrx.com\n.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing small molecule medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, targeted small molecule candidates that modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, OV4071 and others within a library of compounds that directly activate the KCC2 transporter, for multiple CNS disorders. For more information about these and other Ovid research programs, please visit\nwww.ovidrx.com\n.\nForward-Looking Statements\nThis press release includes certain disclosures by Ovid that contain “forward-looking statements” including, without limitation: statements regarding the expected timing of initiation, completion, and results and data of Ovid’s clinical studies; the potential use and development of OV329, OV350, OV4071 and other compounds from Ovid’s library of direct activators of KCC2; and other statements that are not historical fact. You can identify forward-looking statements because they contain words such as “anticipates,” “believes,” “expects,” “intends,” “may,” “plan,” “potentially,” and “will,” and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances). Forward-looking statements are based on Ovid’s current expectations and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that may differ materially from those contemplated by the forward-looking statements, which are neither statements of historical fact nor guarantees or assurances of future performance. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, without limitation, uncertainties inherent in the preclinical and clinical development and regulatory approval processes, risks related to Ovid’s ability to achieve its financial objectives, the risk that Ovid may not be able to realize the intended benefits of its business strategy or unanticipated or greater than anticipated impacts or delays due to macroeconomic and geopolitical conditions. Additional risks that could cause actual results to differ materially from those in the forward-looking statements are set forth under the caption “Risk Factors” in Ovid’s most recently filed Annual Report on Form 10-K and Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission (“SEC”), and in subsequent and future filings Ovid makes with the SEC. Any forward-looking statements contained in this press release speak only as of the date hereof, and Ovid assumes no obligation to update any forward-looking statements contained herein, whether because of any new information, future events, changed circumstances or otherwise, except as otherwise required by law.\nMedia and Investor Relations:\nVictoria Fort\nvfort@ovidrx.com\nTags\nbiotech"
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics Reports Business Updates and First Quarter 2025 Financial Results",
    "link": "https://www.globenewswire.com/news-release/2025/05/13/3080060/0/en/Ovid-Therapeutics-Reports-Business-Updates-and-First-Quarter-2025-Financial-Results.html",
    "date": "May 13, 2025 08:00 ET",
    "text": "Ovid Therapeutics Reports Business Updates and First Quarter 2025 Financial Results\nMay 13, 2025 08:00 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nTopline pharmacodynamic biomarker, safety and tolerability results from a Phase 1 study of OV329 are on track to readout in Q3 2025\nOvid’s first program in its KCC2 direct activator library, OV350, has been dosed in a Phase 1 study in Q1 2025; safety and tolerability results expected before year-end\nCash, cash equivalents and marketable securities of $43.0 million as of March 31, 2025 are expected to support currently planned operations and development programs into the 2H of 2026\nNEW YORK, May  13, 2025  (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (Nasdaq: OVID), a biopharmaceutical company dedicated to developing small molecule medicines for brain conditions with significant unmet need, today reported business updates and financial results for the first quarter ended March 31, 2025.\n“We’re off to a strong start across our pipeline and programs in what will be a defining year for Ovid,” said Dr. Jeremy Levin, D.Phil., MB BChir., Chairman and CEO of Ovid Therapeutics. “Our lead program, OV329, continues to show promise as a potential next-generation medicine for treatment resistant seizures, and we are on track to share key safety and biomarker data later this year. We’ve also initiated human trials of our first-in-class KCC2 direct activator—a long-sought biological target in central nervous system drug development because it is considered to be a “master switch” on neural hyperexcitability. We are excited for these readouts and anticipate that OV4071, our first oral KCC2 direct activator, will be submitted to initiate clinical development by year end.”\nCLINICAL PIPELINE\nOvid’s clinical pipeline of potential first-in-class and best-in-class small molecule programs is advancing in line with previously stated guidance. The programs are intended to restore neural excitatory:inhibitory balance and provide preferable tolerability and safety profiles. Active clinical-stage programs include: OV329, a potential best-in-class, next-generation GABA aminotransferase (GABA-AT) inhibitor, and OV350, the first-ever direct activator of the potassium chloride cotransporter 2 (KCC2). Both programs have broad applications across a number of neurological and neuropsychiatric indications in which excess neural excitation is implicated.\nOV329, a next-generation GABA-AT inhibitor, is anticipated to readout topline results in Q3 2025.\nOvid is developing OV329 for the potential treatment of drug-resistant epilepsies (DREs). OV329 was rationally designed to endogenously deliver optimal levels of GABA to reduce seizures and provide a preferable safety and tolerability profile relative to vigabatrin, a first-generation GABA-AT inhibitor. Ovid’s preclinical characterization suggests OV329 is 100- to 1,000-fold more potent than vigabatrin in animals, delivers synaptic and extrasynaptic inhibition, and has a therapeutic index without appearing to induce sedation at therapeutic doses.\nStatus\nOvid is actively conducting a high-dose SAD/MAD cohort in its ongoing Phase 1 trial of healthy volunteers with the goal of optimizing multiple dosing opportunities for future Phase 2 programs. Pharmacodynamic (PD), target engagement, pharmacokinetic (PK), safety and tolerability results are expected in late Q3 2025.\nBiomarker strategy\nThe Phase 1 trial applies biomarkers designed to measure OV329’s potential clinical effect and target engagement at various doses. These biomarker parameters are well-established measures for anti-seizure medicines and can demonstrate PD activity in healthy volunteers. Key biomarkers being evaluated leverage:\nTranscranial magnetic stimulation (TMS) to measure potential cortical inhibition and GABAergic (inhibitory) activity.\nMagnetic resonance spectroscopy (MRS) to evaluate if levels of GABA increase in the medial parietal lobe.\nQuantitative electroencephalography (QEEG) to assess changes to frequency bands associated with GABAergic activity.\nSafety\nIn cohorts completed to date, there have been no reported serious adverse events associated with OV329.\nIndication strategy\nPending the outcomes of the Phase 1 trial, Ovid intends to take up to two doses into an adaptive Phase 2a trial design in adults with treatment resistant focal seizures. Ovid believes this approach will provide the Company with maximal opportunities to pursue multiple indications for future clinical studies, such as adult drug resistant epilepsies (DREs) or pediatric and adult patients with select developmental epileptic encephalopathies (DEEs).\nOV350, a KCC2 direct activator, is being studied in a Phase 1 trial.\nIn March 2025, Ovid initiated dosing of healthy volunteers with an intravenous formulation of OV350. The Phase 1 SAD/MAD study is intended to potentially demonstrate safety, tolerability and PK parameters. Ovid intends to leverage PD/PK findings from OV350 to inform its oral KCC2 program, OV4071.\nIn preclinical and animal disease models, OV350 has demonstrated antipsychotic and anticonvulsant effects, suggesting that directly activating the cotransporter may offer broad therapeutic utility.\nPRECLINICAL PIPELINE\nOral candidates from KCC2 direct activator library advancing in IND-enabling studies\n. Ovid is conducting IND-enabling and formulation efforts for three unique KCC2 direct activator molecules from its larger library. These programs represent oral and subcutaneous formulations and are expected to yield successive regulatory submissions to initiate clinical development annually for the next three to four years. Ovid’s programs have discreet structures and may have therapeutic relevance across a range of conditions with symptoms driven by neural hyperexcitability, such as seizures and psychoses.\nOV4071 is an oral KCC2 direct activator on-track to initiate a proof-of-concept study in H1 2026.\nOV4071 is a potent, oral direct activator that has demonstrated strong anti-psychosis activity in animal studies. The initial indication intended for OV4071 is psychosis associated with neuronal-synuclein diseases (NSD), including Parkinson’s disease and Lewy body dementia (LBD). These conditions share a common underlying biology, have an established regulatory pathway and clinical development paradigm, and represent areas of substantial unmet need.\nBUSINESS STRATEGY & UPDATES\nOvid expects its cash runway to support operations and clinical development programs into the 2H of 2026, during which time multiple pipeline and regulatory milestones are anticipated.\nThese anticipated milestones include: results for OV329 PD biomarker and safety data (Q3 2025); initiation of a Phase 2a patient study for OV329 in drug resistant epilepsies (Q1 2026); results from the Phase 1 SAD/MAD study with OV350, the Company's first KCC2 direct activator (Q4 2025); and initiation of a proof-of-concept trial for the first oral KCC2 direct activator, OV4071 (Q2 2026).\nGiven the breadth and depth of its pipeline, and the broad therapeutic opportunity it may yield, the Company will continue to explore a range of options to accelerate development and offset costs, such as partnerships, co-development and regional opportunities for select programs; as well as monetizing equity positions, IP and non-CNS applications of its candidates. The Company will continue to manage its clinical development programs, operations, and cash expenditures with fiscal discipline to support the potential achievement of key value-creating clinical milestones.\nFirst Quarter 2025 financial results\nCash, cash equivalents and marketable securities as of March 31, 2025 totaled $43.0 million.\nRevenues from royalty agreements were $130,000 for the first quarter ended March 31, 2025, as compared to $148,000 in the same period in 2024.\nResearch and development expenses were $6.7 million for the first quarter ended March 31, 2025, compared to $10.4 million in the same period in 2024. The decrease is related to the organizational restructuring in Q2 2024 to reprioritize Ovid’s clinical and preclinical pipeline programs.\nGeneral and administrative expenses were $6.0 million for the first quarter ended March 31, 2025, as compared to $7.2 million for the same period in 2024. The decrease was driven by the organizational restructuring and related cost-reduction efforts.\nTotal operating expenses were $12.7 million for the first quarter ended March 31, 2025, as compared to $17.6 million for the same period last year.\nOvid reported a net loss of $10.2 million, or basic and diluted net loss per share attributable to common stockholders of $0.14, for the first quarter of 2025, as compared to a net loss of $11.7 million, or basic and diluted net loss per share attributable to common stockholders of $0.17, for the same period in 2024.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing small molecule medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, targeted small molecule candidates that modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, OV4071 and others within a library of compounds that directly activate the KCC2 transporter, for multiple CNS disorders. For more information about these and other Ovid research programs, please visit www.ovidrx.com.\nForward-Looking Statements\nThis press release includes certain disclosures by Ovid that contain “forward-looking statements” including, without limitation: statements regarding the expected timing of initiation, completion, and results and data of Ovid’s clinical studies; Ovid’s expectations regarding the duration of its cash runway and the expectation that it will support Ovid’s operations and development programs; the potential use and development of OV329, OV350, OV4071 and other compounds from Ovid’s library of direct activators of KCC2; the potential therapeutic opportunity of OV329, OV350, OV4071 and other compounds from Ovid’s library of direct activators of KCC2; the expected timing of initiation of a proof-of-concept trial for OV4071 and the submission to initiate clinical development; Ovid’s clinical pipeline strategy and plans for future clinical studies; the expected timing of IND-enabling and formulation efforts for molecules from its KCC2 direct activator library and related regulatory submissions; Ovid’s potential future business development opportunities; Ovid’s ability to achieve expected benefits of cost-saving efforts; and other statements that are not historical fact. You can identify forward-looking statements because they contain words such as “anticipates,” “believes,” “expects,” “intends,” “may,” “plan,” “potentially,” and “will,” and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances). Forward-looking statements are based on Ovid’s current expectations and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that may differ materially from those contemplated by the forward-looking statements, which are neither statements of historical fact nor guarantees or assurances of future performance. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, without limitation, uncertainties inherent in the preclinical and clinical development and regulatory approval processes, impediments to Ovid’s ability to achieve expected benefits of cost-savings efforts, risks related to Ovid’s ability to achieve its financial objectives, the risk that Ovid may not be able to realize the intended benefits of its business strategy, or risks related to Ovid’s ability to identify business development targets or strategic partners, to enter into strategic transactions on favorable terms, or to consummate and realize the benefits of any business development transactions or unanticipated or greater than anticipated impacts or delays due to macroeconomic and geopolitical conditions. Additional risks that could cause actual results to differ materially from those in the forward-looking statements are set forth under the caption “Risk Factors” in Ovid’s most recently filed Annual Report on Form 10-K and Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission (“SEC”), and in subsequent and future filings Ovid makes with the SEC. Any forward-looking statements contained in this press release speak only as of the date hereof, and Ovid assumes no obligation to update any forward-looking statements contained herein, whether because of any new information, future events, changed circumstances or otherwise, except as otherwise required by law.\nCondensed Consolidated Statements of Operations\nUnaudited\n(in thousands, except share and per share data)\nFor The Three Months Ended\nMarch 31, 2025\nFor The Three Months Ended\nMarch 31, 2024\nRevenue:\nLicense and other revenue\n$\n130\n$\n148\nTotal revenue\n130\n148\nOperating expenses:\nResearch and development\n6,659\n10,397\nGeneral and administrative\n6,021\n7,168\nTotal operating expenses\n12,680\n17,565\nLoss from operations\n(12,550\n)\n(17,417\n)\nOther income (expense), net\n2,315\n5,723\nLoss before provision for income taxes\n(10,235\n)\n(11,694\n)\nProvision for income taxes\n—\n—\nNet loss\n$\n(10,235\n)\n$\n(11,694\n)\nNet loss per share of Series A preferred stock, basic and diluted\n$\n(141.57\n)\n$\n(162.5\n)\nWeighted-average Series A preferred stock shares outstanding, basic and diluted\n1,250\n1,250\nNet loss per share of common stock, basic and diluted\n$\n(0.14\n)\n$\n(0.17\n)\nWeighted-average common stock shares outstanding, basic and diluted\n71,045,265\n70,716,929\nSelect Condensed Consolidated Balance Sheet Data\nUnaudited\n(in thousands)\nMarch 31, 2025\nDecember 31, 2024\nCash, cash equivalents and marketable securities\n$\n42,996\n$\n53,075\nWorking capital\n(1)\n36,614\n45,418\nTotal assets\n81,654\n92,167\nTotal stockholders’ equity\n59,276\n68,226\n(1)\nWorking capital defined as current assets less current liabilities\nContact Data\nContacts\n\nInvestor Relations & Media\nVictoria Fort\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics to Present at the 24th Annual Needham Virtual Healthcare Conference",
    "link": "https://www.globenewswire.com/news-release/2025/04/02/3054205/0/en/Ovid-Therapeutics-to-Present-at-the-24th-Annual-Needham-Virtual-Healthcare-Conference.html",
    "date": "April 02, 2025 08:00 ET",
    "text": "Ovid Therapeutics to Present at the 24th Annual Needham Virtual Healthcare Conference\nApril 02, 2025 08:00 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nNEW YORK, April  02, 2025  (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (NASDAQ: OVID), a biopharmaceutical company dedicated to developing medicines for brain conditions with significant unmet need, today announced that Meg Alexander, President and Chief Operating Officer, will present at the 24\nth\nAnnual Needham Virtual Healthcare Conference on Monday, April 7, 2025, at 8:45 AM. ET.\nA live webcast of the Needham Virtual Healthcare Conference presentation can be accessed through the Events & Presentations section of the company’s website at\ninvestors.ovidrx.com\n. An archived replay of the webcast will be available on the Company’s website following the live presentation for approximately 30 days.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, targeted small molecule candidates that have the potential to modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, and a library of compounds that directly activate the KCC2 transporter, for multiple CNS disorders; and OV888/GV101, a highly selective ROCK2 inhibitor, for undisclosed neurovascular and neuro-inflammatory conditions. For more information about these and other Ovid research programs, please visit\nwww.ovidrx.com\n.\nInvestor Relations:\nVictoria Fort\n202-361-445\nvfort@ovidrx.com"
  },
  {
    "ticker": "OVID",
    "title": "Applied Therapeutics Appoints Todd F. Baumgartner, MD, MPH as Chief Regulatory Officer",
    "link": "https://www.globenewswire.com/news-release/2025/03/19/3045236/0/en/Applied-Therapeutics-Appoints-Todd-F-Baumgartner-MD-MPH-as-Chief-Regulatory-Officer.html",
    "date": "March 19, 2025 07:00 ET",
    "text": "Applied Therapeutics Appoints Todd F. Baumgartner, MD, MPH as Chief Regulatory Officer\nDr. Baumgartner will advance Applied’s preparation for upcoming regulatory interactions\nMarch 19, 2025 07:00 ET\n| Source:\nApplied Therapeutics\nFollow\nApplied Therapeutics\nShare\nNEW YORK, March  19, 2025  (GLOBE NEWSWIRE) -- Applied Therapeutics, Inc. (Nasdaq: APLT), a biopharmaceutical company dedicated to creating transformative treatments for rare disease, today announced the appointment of Todd F. Baumgartner, MD, MPH as Chief Regulatory Officer. Dr. Baumgartner will serve as part of the Company’s executive leadership team and will be responsible for leading Applied’s global regulatory strategy.\nDr. Baumgartner joins Applied as an accomplished global drug development leader with over 35 years of experience in senior regulatory, clinical development, and medical affairs roles. He has held a diverse set of leadership roles over the course of his career, notably leading a total of 12 New Drug Applications and marketing authorizations through their approvals.\n“We are delighted to welcome Todd to Applied as we continue to prepare for regulatory interactions regarding govorestat,” said John H. Johnson, Executive Chairman of Applied Therapeutics. “We believe that Todd’s wealth of development experience and strong track record with regulators will be valuable to Applied as we remain committed to our mission of addressing the unmet needs of patients with rare diseases.”\n“I have been passionate about advancing important medical breakthroughs through clinical and regulatory development throughout my career, and I am excited to join Applied at this important time,” said Dr. Baumgartner. “I look forward to working with the Applied team as we seek to advance govorestat for the potential treatment of rare diseases.”\nPrior to joining Applied, Dr. Baumgartner served as Senior Vice President of Global Regulatory Affairs, Pharmacovigilance and Biometrics at Ovid Therapeutics from 2020 through 2024, where he oversaw multiple development functions for several pipeline programs, including Regulatory Affairs, Pharmacovigilance, Biometrics, Program Management and Quality Assurance, and served briefly as acting Chief Medical Officer. Prior to that, Dr. Baumgartner served as Senior Vice President of Regulatory Affairs at Acorda Therapeutics, where he led the Regulatory Affairs and Clinical Operations organizations, heading up the regulatory development and garnering regulatory marketing approvals in the US and Europe for Inbrija™ for Parkinson’s OFF episodes. Previously, he served as Chief Medical Officer of Purdue Pharma and, earlier in his career, held various leadership positions of increasing responsibility at AstraZeneca Pharmaceuticals and Bristol-Myers Squibb. Dr. Baumgartner obtained an MPH from the University of California-Berkeley, an MD from the University of Missouri-Columbia, and a BA from Duke University.\nAbout Applied Therapeutics\nApplied Therapeutics is a clinical-stage biopharmaceutical company committed to the development of novel drug candidates against validated molecular targets in rare diseases. The Company’s lead drug candidate, govorestat, is a novel central nervous system penetrant Aldose Reductase Inhibitor (ARI) for the treatment of CNS rare metabolic diseases, including Classic Galactosemia, Sorbitol Dehydrogenase (SORD) Deficiency and PMM2-congenital disorder glycosylation (CDG).\nTo learn more, please visit www.appliedtherapeutics.com.\nForward-Looking Statements\nThis press release contains “forward-looking statements” that involve substantial risks and uncertainties for purposes of the safe harbor provided by the Private Securities Litigation Reform Act of 1995. Any statements, other than statements of historical fact, included in this press release regarding the strategy, future operations, prospects, plans and objectives of management, including words such as “may,” “will,” “expect,” “anticipate,” “plan,” “intend,” “predicts” and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances) are forward-looking statements. Forward-looking statements in this release involve substantial risks and uncertainties that could cause actual results to differ materially from those expressed or implied by the forward-looking statements, and we, therefore cannot assure you that our plans, intentions, expectations or strategies will be attained or achieved. Factors that may cause actual results to differ from those expressed or implied in the forward-looking statements in this press release are discussed in our filings with the U.S. Securities and Exchange Commission, including the “Risk Factors” contained therein. Except as otherwise required by law, we disclaim any intention or obligation to update or revise any forward-looking statements, which speak only as of the date they were made, whether as a result of new information, future events or circumstances or otherwise.\nContacts\nInvestors:\nMaeve Conneighton / Andrew Vulis\n(212) 600-1902 or\nappliedtherapeutics@argotpartners.com\nMedia:\nmedia@appliedtherapeutics.com"
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics Reports Business Updates and Fourth Quarter and Full Year 2024 Financial Results",
    "link": "https://www.globenewswire.com/news-release/2025/03/11/3040509/0/en/Ovid-Therapeutics-Reports-Business-Updates-and-Fourth-Quarter-and-Full-Year-2024-Financial-Results.html",
    "date": "March 11, 2025 08:00 ET",
    "text": "Ovid Therapeutics Reports Business Updates and Fourth Quarter and Full Year 2024 Financial Results\nMarch 11, 2025 08:00 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nStelios Papadopolous, Ph.D., a pioneering leader in biotech, appointed to Board of Directors; two industry veterans joined management team as Ovid prepares to take OV329 into patient trials and move its first KCC2 direct activator into the clinic\nTopline results from Phase 1 study of OV329 expected in Q3 2025, which will include biomarkers that measure clinical effect and target engagement, safety, and tolerability\nOV350, Ovid’s first program in its KCC2 direct activator library, initiated a first-in-human study in Q1 2025\nCash, cash equivalents and marketable securities of $53.1 million as of December 31, 2024, are expected to support operations and development programs into the second half of 2026\nNEW YORK, March  11, 2025  (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (Nasdaq: OVID), a biopharmaceutical company dedicated to developing small molecule medicines for brain conditions with significant unmet need, today reported business updates and financial results for the fourth quarter and year ended December 31, 2024.\n“Ovid is at an exciting inflection point. Our pipeline programs are moving into the next stage of clinical development and I believe our team is the strongest that it has been since the founding of the Company,” said Dr. Jeremy Levin, D.Phil., MB BChir., Chairman and CEO of Ovid Therapeutics. “To support us in capturing the substantial potential therapeutic and financial value associated with OV329, our program for treatment-resistant epilepsies, and our portfolio of first-in-class KCC2 activators, Dr. Stelios Papadopoulos has joined our Board and two industry leaders, Dr. Manal Morsy and Victoria “Tori” Fort joined our management team. Stelios’s extensive industry expertise and strategic vision will be invaluable to Ovid through our next stage of growth. Manal and Tori will support our regulatory and investor strategy and engagement,” stated Levin.\nBusiness Strategy & Updates\nOvid expects its cash runway to support operations and clinical development programs into the second half of 2026, during which time multiple pipeline and regulatory milestones are anticipated. These anticipated milestones include: results for OV329 biomarker and safety data (Q3 2025); initiation of a Phase 2a patient study for OV329 in drug resistant epilepsies (Q1 2026); results from a first-in-human safety and exploratory biomarker study with OV350, our first KCC2 direct activator (Q4 2025); and initiation of human trials for the first oral KCC2 direct activator, OV4071 (Q2 2026). In the event the Company is unable to raise capital or enter into partnerships or co-development opportunities as and when needed, it will be required to delay, reduce the scope of or prioritize various research and development activities.\nThe Company will continue to manage its clinical development programs, operations and cash expenditures with fiscal discipline to support the potential achievement of key value-creating clinical milestones. Given the breadth and depth of its pipeline, and the broad therapeutic opportunity it may yield, Ovid will continue to explore partnerships and co-development opportunities for select programs and regions to accelerate development and offset costs. Additional pipeline updates follow below.\nOrganizational Updates\nOvid has strengthened its Board of Directors and leadership team with key appointments intended to support the Company’s pipeline, business development and financial strategies. These include:\nAppointed Stelios Papadopolous, Ph.D., to serve on Board of Directors.\nDr. Papadopolous is a scientist, investor and entrepreneur who has played a pivotal role in shaping the biotechnology industry for the last 30 years through bridging scientific discovery with financial strategy. His leadership, deal-making creativity, and ability to catalyze growth will be instrumental to Ovid as it seeks to capture the full potential value of its pipeline programs. Dr. Papadopoulos has served in roles including: the Vice Chairman of Cowen & Co., LLC; a leader in investment banking at PaineWebber, Chairman of PaineWebber Development Corp., a subsidiary focusing on biotechnology; and Vice President in the Equity Research Department of Drexel Burnham Lambert, covering the biotechnology industry. Dr. Papadopolous will serve on the Audit and Compensation Committees of Ovid’s Board of Directors.\nLeadership appointments.\nIn February 2025, Manal Morsy, M.D., Ph.D., MBA and Victoria Fort joined Ovid as Chief Regulatory Officer and Head of Corporate Affairs & Corporate Strategy, respectively. Dr. Morsy brings deep expertise from successful global regulatory strategies and submissions spanning three decades, including adult and pediatric development drug candidates at J&J, Merck, PTC, and Athersys. She is a trained scientist, clinician and geneticist whose work has been published in many leading scientific and medical journals. Ms. Fort joins Ovid from Frontier Medicines, where she led corporate strategy, guided the company’s transition to a clinical-stage organization and helped secure critical financing.\nPipeline Strategy & Updates\nOvid is advancing a differentiated pipeline of potential first-in-class and best-in-class small molecule medicines that are intended to bring hyperexcited neurons back to homeostasis. The Company seeks to become a leader in neurotherapeutics by addressing intractable brain disorders with significant unmet need. This includes treating conditions and symptoms that manifest from excessive neural excitation such as seizures and psychosis.\nCentral to the Company’s strategy is identifying and developing differentiated mechanisms of action to interdict unaddressed biological targets in the central nervous system (CNS) that are fundamental to disease pathology. This strategy includes developing a potential best-in-class, next-generation GABA aminotransferase (GABA-AT) inhibitor; translating the direct activation of the potassium chloride co-transporter 2 (KCC2) for a broad range of neurological and psychiatric conditions; and pioneering Rho-associated coiled-coil containing protein kinase 2 (ROCK2) inhibition for neurovascular and neuro-inflammatory conditions.\nOV329\nA next-generation GABA-AT inhibitor:\nOvid is developing OV329 as a next-generation GABA-AT inhibitor for the potential treatment of drug-resistant epilepsies (DREs) in adult and pediatric patients. OV329 seeks to endogenously deliver optimal levels of GABA to reduce seizures and provide a preferable safety and tolerability profile relative to the first-generation, GABA-AT inhibitor, vigabatrin. Ovid’s preclinical characterization suggests that OV329 is 100-fold more potent than vigabatrin in animals, delivers synaptic and extra-synaptic inhibition, and has a lasting pharmacodynamic effect despite rapid tissue clearance. In animal models, OV329 has been shown to have a therapeutic index and does not appear to induce sedation at therapeutic doses, whereas vigabatrin has no therapeutic window. A therapeutic dose of vigabatrin has been shown by independent researchers, and by Ovid, to preferentially accumulate in the retina.\nHuman safety & tolerability:\nOvid is completing a Phase 1 single- ascending dose (SAD) and multiple ascending dose (MAD) study evaluating OV329’s safety, tolerability, pharmacokinetics (PK) and biomarkers that may serve as a measure of clinical effect and target engagement. In the cohorts completed to-date, there have been no serious adverse events and no adverse events reported have been associated with OV329.\nTopline biomarker & safety data expected Q3 2025:\nOvid added a higher dose cohort to its Phase 1 study, to increase dosing opportunities for future Phase 2 programs. Topline results from this cohort is expected in Q3 2025, and will include findings regarding how OV329 performed in specific parameters of transcranial magnetic stimulation (TMS) and magnetic resonance spectroscopy (MRS). Collectively, Ovid believes TMS and MRS have the potential to detect GABAergic activity, target engagement and clinical effect.\nTMS is a proven protocol for focal non-invasive electrical cortical stimulation that can safely and non-invasively measure target engagement. TMS has been previously used to correlate anti-seizure activity with vigabatrin and other anti-seizure medications (“ASMs”). Ovid is utilizing a range of TMS parameters for OV329, which can measure cortical excitation, including GABA-ergic, GABA (A) and GABA (B) receptor activity\n1\n.\nMRS technology has been utilized with other ASMs, including vigabatrin, as a way to measure GABA levels in selected regions of the brain. Utilizing MRS, Ovid will be able to evaluate and quantify the change in GABA levels in the medial parietal lobe relative to an untreated baseline.\nOcular safety profile:\nTo evaluate OV329’s safety compared to vigabatrin, Ovid has conducted additional animal experiments to evaluate the risk of drug accumulating in the eye and causing retinal cell dysregulation. At the 2024 American Epilepsy Society meeting in December, Ovid presented the full results from an animal study, which demonstrated that OV329 did not accumulate in animal eyes, in contrast to vigabatrin, which was found to accumulate in less than 48 hours. OV329 was present in the brain and plasma of mice, then rapidly cleared the tissue and remained undetectable in the retina, eye, and brain. In contrast, vigabatrin was demonstrated to preferentially accumulate in the eye, retina and brain, which is consistent with previously published independent research.\nOV350 and KCC2 library\nInitiated a Phase 1, first-in-human study for a KCC2 direct activator, OV350:\nIn Q4 2024, Ovid successfully submitted a regulatory application for a Phase 1 trial of OV350 and initiated a first-in-human study for this class of molecule in Q1 2025. OV350 is the first of multiple anticipated programs from Ovid’s library of KCC2 direct activators. The Phase 1 trial intends to evaluate the safety, tolerability and pharmacokinetic parameters of an intravenous formulation of OV350 in healthy human volunteers. It will also include an exploratory biomarker using quantitative EEG. In preclinical and animal disease models, OV350 has demonstrated antipsychotic and anticonvulsant effects, indicating that it may have broad therapeutic utility. The initial indication intended for OV350, and the oral program to follow, is psychosis associated with neuronal-synuclein diseases (NSD), including Parkinson’s disease, and Lewy body dementia (LBD). These conditions have similar underlying biology, significant unmet need and an established regulatory pathway.\nKCC2 direct activator library.\nOvid has made significant progress with its KCC2 direct activator library and is progressing four programs toward clinical development, which are expected to yield successive regulatory submissions annually for the next three to four years. These programs are unique structures with discreet pharmacology and differentiated therapeutic attributes as characterized in phenotypic and disease biology models. Ovid believes these molecules may have relevance across a range of conditions that have symptoms driven by neural hyperexcitability such as seizures and psychoses. Based upon the bioavailability and potency characteristics, Ovid believes different programs in the library have amenability for oral and intramuscular or subcutaneous formulations to address clinical indications across the care continuum.\nOV4071, the first oral KCC2 direct activator:\nOvid has initiated IND-enabling studies of OV4071, the first oral direct activator of the biological target, KCC2. It anticipates initiating human studies with OV4071 in Q2 2026, with both healthy volunteer and patient cohorts. This oral program behaves similarly to OV350 in phenotypic and disease model screens and is similarly intended for the potential treatment of psychoses in NSD and LBD.\nOV888/GV101 & ROCK2 inhibitor programs\nOV888/GV101 Capsule for CCM:\nIn the third quarter of 2024, Ovid and Graviton Bioscience announced the decision to pause the initiation of the Phase 2 proof-of-concept study of OV888/ GV101 capsule, following the recent completion of long-duration competitor and academic trials in CCM, and after discussions with key stakeholders. Ovid and Graviton Bioscience are evaluating clinical design learnings and regulatory feedback from recently completed competitor Phase 2 programs. Ovid and Graviton Bioscience are confident of the potential therapeutic effects of ROCK2 inhibition for CCM and will seek to optimize future development approaches with the benefit of further insights on study duration, enrichment strategies, endpoints, and time-to-event measurements.\nFourth\nQuarter and Annual\n2024\nF\ninancial Results\nCash, cash equivalents and marketable securities as of December 31, 2024 totaled $53.1 million.\nRevenues from royalty agreements were $566,000 for the year ended December 31, 2024, as compared to $392,000 for the same period in 2023.\nResearch and development expenses were $5.9 million and $36.8 million for the three months and full year ended December 31, 2024, compared to $10.6 million and $28.6 million for the same periods in 2023. The overall increase is related to the advancement of Ovid’s clinical and preclinical pipeline programs as described above. The decrease between the three-month periods is the result of the organizational restructuring in the second quarter of 2024, which re-prioritized development programs.\nGeneral and administrative expenses were $4.9 million and $25.7 million for the three months and full year ended December 31, 2024, as compared to $7.7 million and $31.1 million for the same periods in 2023. The decrease was driven by the previous organizational restructuring and related cost-reduction efforts.\nTotal operating expenses were $10.8 million and $62.5 million for the three months and full year ended December 31, 2024, as compared to $18.3 million and $59.7 million for the same periods in 2023.\nOvid reported a net loss of $9.3 million, or basic and diluted net loss per share attributable to common stockholders of $0.13 for the three months ended December 31, 2024, as compared to a net loss of $15.3 million, or basic and diluted net loss per share attributable to common stockholders of $0.21 for the same period in 2023. Ovid reported a net loss of $26.4 million, or basic and diluted net loss per share attributable to common stockholders of $0.37 for the year ended December 31, 2024, as compared to a net loss of $52.3 million, or basic and diluted net loss per share attributable to common stockholders of $0.73 for the same period in 2023.\n1\nTsuboyama M, Lee Kaye H, Rotenberg A. Biomarkers Obtained by Transcranial Magnetic Stimulation of the Motor Cortex in Epilepsy.\nFront Integr Neurosci. 2019 Oct 30;13:57. doi: 10.3389/fnint.2019.00057. PMID: 31736722; PMCID: PMC6837164.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing small molecule medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, highly specific, small molecule candidates that modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, and a library of compounds that directly activate the KCC2 transporter, for multiple neurological and psychiatric conditions; and OV888/GV101, a highly selective ROCK2 inhibitor for undisclosed neurovascular and neuro-inflammatory conditions. For more information about these and other Ovid research programs, please visit www.ovidrx.com.\nForward-Looking Statements\nThis press release includes certain disclosures by Ovid that contain “forward-looking statements” including, without limitation: statements regarding the expected timing of initiation, completion, and results and data of Ovid’s clinical studies; Ovid’s expectations regarding the duration of its cash runway and the expectation that it will support Ovid’s operations and development programs; Ovid’s ability to achieve expected benefits of cost-savings efforts; Ovid’s ability to secure additional sources of funding; Ovid’s potential future business development opportunities; the potential use and development of OV329, OV350 and other compounds from Ovid’s library of direct activators of KCC2, and OV888/GV101; the potential therapeutic opportunity of OV329, OV350 and other compounds from Ovid’s library of direct activators of KCC2, and OV888/GV101; Ovid’s evaluation of the results of recently completed competitor trials to OV888/GV101 for CCM; and other statements that are not historical fact. You can identify forward-looking statements because they contain words such as “anticipates,” “believes,” “expects,” “intends,” “may,” “plan,” “potentially,” and “will,” and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances). Forward-looking statements are based on Ovid’s current expectations and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that may differ materially from those contemplated by the forward-looking statements, which are neither statements of historical fact nor guarantees or assurances of future performance. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, without limitation, uncertainties inherent in the preclinical and clinical development and regulatory approval processes, impediments to Ovid’s ability to achieve expected benefits of cost-savings efforts, risks related to Ovid’s ability to achieve its financial objectives, the risk that Ovid may not be able to realize the intended benefits of its business strategy, or risks related to Ovid’s ability to identify business development targets or strategic partners, to enter into strategic transactions on favorable terms, or to consummate and realize the benefits of any business development transactions. Additional risks that could cause actual results to differ materially from those in the forward-looking statements are set forth under the caption “Risk Factors” in Ovid’s most recently filed Annual Report on Form 10-K and Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission (“SEC”), and in subsequent and future filings Ovid makes with the SEC. Any forward-looking statements contained in this press release speak only as of the date hereof, and Ovid assumes no obligation to update any forward-looking statements contained herein, whether because of any new information, future events, changed circumstances or otherwise, except as otherwise required by law.\nCondensed Consolidated Statements of Operations\nUnaudited\n(in thousands, except share and per share data)\nFor the Three Months Ended\nDecember 31, 2024\nFor the Three Months Ended\nDecember 31, 2023\nFor the Year Ended\nDecember 31, 2024\nFor the Year Ended\nDecember 31, 2023\nRevenue:\nLicense and other revenue\n$\n76\n$\n142\n$\n566\n$\n392\nTotal revenue\n76\n142\n566\n392\nOperating expenses:\n—\n—\nResearch and development\n5,923\n10,642\n36,767\n28,588\nGeneral and administrative\n4,878\n7,688\n25,684\n31,085\nTotal operating expenses\n10,801\n18,330\n62,451\n59,673\nLoss from operations\n(10,725\n)\n(18,188\n)\n(61,885\n)\n(59,281\n)\nOther income (expense), net\n1,444\n2,866\n35,452\n6,943\nLoss before provision for income taxes\n(9,281\n)\n(15,322\n)\n(26,433\n)\n(52,339\n)\nProvision for income taxes\n—\n—\n—\n—\nNet loss\n$\n(9,281\n)\n$\n(15,322\n)\n$\n(26,433\n)\n$\n(52,339\n)\nNet loss per share of Series A preferred stock, basic and diluted\n$\n(128.44\n)\n$\n(212.99\n)\n$\n(366.33\n)\n$\n(728.64\n)\nWeighted-average Series A preferred stock shares outstanding, basic and diluted\n1,250\n1,250\n1,250\n1,250\nNet loss per share of common stock, basic and diluted\n$\n(0.13\n)\n$\n(0.21\n)\n$\n(0.37\n)\n$\n(0.73\n)\nWeighted-average common stock shares outstanding, basic and diluted\n71,009,866\n70,687,307\n70,905,422\n70,580,604\nSelect Condensed Consolidated Balance Sheet Data\nUnaudited\n(in thousands)\nDecember 31, 2024\nDecember 31, 2023\nCash, cash equivalents and marketable securities\n$\n53,075\n$\n105,834\nWorking capital\n(1)\n45,418\n98,125\nTotal assets\n92,167\n144,027\nTotal stockholders’ equity\n68,226\n87,797\n(1)\nWorking capital defined as current assets less current liabilities\nContacts\nInvestor Relations & Media\nVictoria Fort\nVFort@ovidrx.com\nTags\nbiotech\nearnings"
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics Appoints Pioneering Industry Leader Dr. Stelios Papadopoulos to Board of Directors",
    "link": "https://www.globenewswire.com/news-release/2025/03/03/3035548/0/en/Ovid-Therapeutics-Appoints-Pioneering-Industry-Leader-Dr-Stelios-Papadopoulos-to-Board-of-Directors.html",
    "date": "March 03, 2025 08:00 ET",
    "text": "Ovid Therapeutics Appoints Pioneering Industry Leader Dr. Stelios Papadopoulos to Board of Directors\nMarch 03, 2025 08:00 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nNEW YORK, March  03, 2025  (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (Nasdaq: OVID), a biopharmaceutical company dedicated to developing small-molecule medicines for brain conditions with significant unmet need, today announced the appointment of Stelios Papadopoulos, Ph.D. to its Board of Directors.\n“Stelios is a pioneering force in biotechnology. His vision and strategic acumen have shaped the landscape of our industry—building companies, financing breakthroughs, and enabling transformative medicines. We are honored to welcome him to our Board at a defining moment for Ovid,” said Jeremy Levin, D.Phil, MB BChir, Chairman and CEO of Ovid Therapeutics. “With our advancing pipeline, including our novel KCC2 direct activators and OV329 epilepsy program, Ovid stands on the cusp of delivering real change for neurological and psychiatric diseases. Stelios’s leadership, deal-making creativity, and ability to catalyze growth will be instrumental in propelling Ovid forward.”\n“Ovid’s unique research and development programs and talented team stand out in the field of CNS therapeutics, which will continue to be an area of significant interest and activity in the biopharmaceutical sector,” said Dr. Papadopoulos. “Novel and precise, small-molecule medicines for major disorders of the brain will continue to be deeply needed. I look forward to serving on the Board and working with the management team as they pioneer a class of neurotherapeutics and pursue broad scientific and business opportunities associated with restoring neural homeostasis.”\nDr. Papadopoulos is a scientist, investor and entrepreneur who has played a pivotal role in shaping the biotechnology industry by bridging scientific discovery with financial strategy. Dr. Papadopoulos has helped build and guide numerous biotech companies through critical phases of growth. He has deep expertise from a career spanning more than four decades in biotechnology. This includes serving as an investment banker at Cowen & Co., LLC and PaineWebber, Incorporated and, prior to that, in equity research at Drexel Burnham Lambert and Donaldson, Lufkin and Jenrette. Before coming to Wall Street in 1985, Dr. Papadopoulos was on the faculty of the Department of Cell Biology at New York University Medical Center. He has served on many boards, including as the recent past Chairman of the Board for Biogen. Dr. Papadopoulos is currently the Chairman of Exelixis, Inc., which he co-founded, and Regulus Therapeutics Inc. He is a co-founder and chairman of Fondation Santé, a nonprofit organization dedicated to advancing biomedical research. Dr. Papadopoulos has earned an MS in physics, a PhD in biophysics and an MBA in finance, all from New York University.\nDr. Papadopoulos will be a member of Ovid’s Audit and Compensation Committees.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing novel medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, targeted small molecule candidates that have the potential to modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, and a library of compounds that directly activate the KCC2 transporter, for multiple CNS disorders; and OV888/GV101, a highly selective ROCK2 inhibitor, for undisclosed neurovascular and neuro-inflammatory conditions. For more information about these and other Ovid research programs, please visit\nwww.ovidrx.com\n.\nForward-Looking Statements\nThis press release includes certain disclosures by Ovid that contain “forward-looking statements,” including, without limitation, statements regarding the potential use and development of OV329, OV350 and compounds from Ovid’s library of direct activators of KCC2, and OV888/GV101. You can identify forward-looking statements because they contain words such as “advances,” “anticipates,” “believes,” “could,” “intends,” “may,” “potential,” “progress,” and “will” and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances). Forward-looking statements are based on Ovid’s current expectations and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that may differ materially from those contemplated by the forward-looking statements, which are neither statements of historical fact nor guarantees or assurances of future performance. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, without limitation, uncertainties inherent in the preclinical and clinical development and regulatory approval processes. Additional risks that could cause actual results to differ materially from those in the forward-looking statements are set forth under the caption “Risk Factors” in Ovid’s Quarterly on Form 10-Q filed with the Securities and Exchange Commission (“SEC”) on November 12, 2024, and in future filings Ovid makes with the SEC. Any forward-looking statements contained in this press release speak only as of the date hereof, and Ovid assumes no obligation to update any forward-looking statements contained herein, whether because of any new information, future events, changed circumstances or otherwise, except as otherwise required by law.\nContact:\nVictoria Fort\nvfort@ovidrx.com"
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics to Present at the TD Cowen 45th Annual Health Care Conference",
    "link": "https://www.globenewswire.com/news-release/2025/02/27/3033769/0/en/Ovid-Therapeutics-to-Present-at-the-TD-Cowen-45th-Annual-Health-Care-Conference.html",
    "date": "February 27, 2025 08:00 ET",
    "text": "Ovid Therapeutics to Present at the TD Cowen 45th Annual Health Care Conference\nFebruary 27, 2025 08:00 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nNEW YORK, Feb.  27, 2025  (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (NASDAQ: OVID), a biopharmaceutical company dedicated to developing medicines for brain conditions with significant unmet need, today announced that Meg Alexander, President and Chief Operating Officer, will present at the TD Cowen 45\nth\nAnnual Health Care Conference on Monday, March 3, 2025, at 3:10 p.m. ET in Boston, Massachusetts.\nA live webcast of the TD Cowen presentation can be accessed through the Events & Presentations section of the company’s website at investors.ovidrx.com. An archived replay of the webcast will be available on the Company’s website following the live presentation for approximately 30 days.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, targeted small molecule candidates that have the potential to modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, and a library of compounds that directly activate the KCC2 transporter, for multiple CNS disorders; and OV888/GV101, a highly selective ROCK2 inhibitor, for undisclosed neurovascular and neuro-inflammatory conditions. For more information about these and other Ovid research programs, please visit\nwww.ovidrx.com\n.\nInvestor Relations:\nGarret Bonney\n617-735-6093\ngbonney@ovidrx.com"
  },
  {
    "ticker": "OVID",
    "title": "Ovid Therapeutics to Present at the Oppenheimer 35th Annual Healthcare Life Sciences Conference",
    "link": "https://www.globenewswire.com/news-release/2025/02/05/3021099/0/en/Ovid-Therapeutics-to-Present-at-the-Oppenheimer-35th-Annual-Healthcare-Life-Sciences-Conference.html",
    "date": "February 05, 2025 08:00 ET",
    "text": "Ovid Therapeutics to Present at the Oppenheimer 35th Annual Healthcare Life Sciences Conference\nFebruary 05, 2025 08:00 ET\n| Source:\nOvid Therapeutics Inc.\nFollow\nOvid Therapeutics Inc.\nShare\nNEW YORK, Feb.  05, 2025  (GLOBE NEWSWIRE) -- Ovid Therapeutics Inc. (Nasdaq: OVID), a biopharmaceutical company dedicated to developing medicines for brain conditions with significant unmet need, today announced that management will participate in a virtual presentation at the Oppenheimer 35\nth\nAnnual Healthcare Life Sciences Conference on Wednesday, February 12, 2025, at 4:00 p.m. ET.\nA live webcast of the presentation can be accessed through the Events & Presentations section of the Company’s website at investors.ovidrx.com. An archived replay of the webcast will be available on the Company’s website following the live presentation.\nAbout Ovid Therapeutics\nOvid Therapeutics Inc. is a New York-based biopharmaceutical company dedicated to developing medicines for brain conditions with significant unmet need. The Company is advancing a pipeline of novel, targeted small molecule candidates that modulate the intrinsic and extrinsic factors involved in neuronal hyperexcitability causative of multiple neurological and neuropsychiatric disorders. Ovid is developing: OV329, a next-generation GABA-aminotransferase inhibitor, as a potential therapy for treatment-resistant seizures and other undisclosed indications; OV350, and a library of compounds that directly activate the KCC2 transporter, for multiple CNS disorders; and OV888/GV101, a highly selective ROCK2 inhibitor, for undisclosed neurovascular and neuro-inflammatory conditions. For more information about these and other Ovid research programs, please visit\nwww.ovidrx.com\n.\nInvestor Relations:\nGarret Bonney\n617-735-6093\ngbonney@ovidrx.com"
  }
]