[
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines Receives FDA Breakthrough Therapy Designation for Relutrigine for the Treatment of Seizures Associated with SCN2A and SCN8A Developmental and Epileptic Encephalopathies",
    "link": "https://www.globenewswire.com/news-release/2025/07/17/3117145/0/en/Praxis-Precision-Medicines-Receives-FDA-Breakthrough-Therapy-Designation-for-Relutrigine-for-the-Treatment-of-Seizures-Associated-with-SCN2A-and-SCN8A-Developmental-and-Epileptic-E.html",
    "date": "July 17, 2025 08:00 ET",
    "text": "Praxis Precision Medicines Receives FDA Breakthrough Therapy Designation for Relutrigine for the Treatment of Seizures Associated with SCN2A and SCN8A Developmental and Epileptic Encephalopathies\nJuly 17, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nThe Breakthrough Therapy Designation (BTD) was granted based on the highly compelling results from the Phase 2 EMBOLD trial in SCN2A and SCN8A developmental and epileptic encephalopathies (DEEs)\nThe EMBOLD cohort 2 pivotal trial is on track for topline results in H1 2026 with NDA filing to follow\nPraxis has recently initiated the EMERALD study investigating relutrigine broadly in DEEs\nBOSTON, July  17, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that the U.S. Food and Drug Administration (FDA) has granted BTD for relutrigine, a sodium channel functional state modulator for pediatric use for the treatment of patients with SCN2A and SCN8A DEEs.\n“This BTD represents a significant milestone for our relutrigine program and further validates its potential. The EMBOLD cohort 1 study supporting our application enrolled the most severe DEE population ever studied and included patients that failed three treatments on average before joining the study. The results from the open-label extension are remarkable, showing an average of both approximately 90% reduction in seizures and over two months between seizures. These extremely encouraging clinical results translate to tangible improvement in quality of life for patients and their caregivers. We continue to execute on the registrational EMBOLD cohort 2 study and expect to share the topline results no later than the first half of 2026. We are excited that this BTD, in addition to the Rare Pediatric Disease Designation in SCN2A and SCN8A DEEs, further supports expedited development of relutrigine,” commented Marcio Souza, president and chief executive officer. “In addition to this exciting update for the SCN2A and SCN8A population, we are looking forward to results from the EMERALD study which has recently been initiated for DEE patients, regardless of etiology.”\nThe BTD enables expedited development and regulatory review for drugs that are intended to treat a serious condition, and preliminary clinical evidence indicates that relutrigine may demonstrate substantial improvement on a clinically significant endpoint(s) over existing therapies. The BTD for relutrigine was supported by the positive data from cohort 1 in the Phase 2 EMBOLD study, as well as 11-month data from the open-label extension (OLE) period of the trial. Data from the double-blind period (16 weeks of treatment) showed a placebo-adjusted monthly motor seizure reduction of 46% during the double-blind period and seizure freedom in over 30% of patients while on relutrigine. Additionally, meaningful gains were observed in alertness, communication and seizure severity as noted by both clinicians and caregivers. In May 2025, Praxis provided a data update from the ongoing OLE part of the trial during a\nvirtual investor event\n. At month 11, an average of approximately 90% seizure reduction was observed in patients, and a sustained and continuous improvement in seizure-free periods was observed, with a mean of 67 days without seizures compared to 3 days in the baseline period. There were no new safety signals, drug related serious adverse events or dose reductions needed.\nThe EMBOLD registrational cohort 2 is currently ongoing and continues to enroll, with topline results expected no later than the first half of 2026, followed by a potential NDA filing.\nPraxis has recently initiated the EMERALD study evaluating relutrigine in patients across all DEEs. EMERALD is a registrational, 16-week, placebo-controlled study evaluating seizure reduction in patients diagnosed with developmental epilepsies.\nAbout Relutrigine (PRAX-562)\nRelutrigine is a first-in-class small molecule in development for the treatment of developmental and epileptic encephalopathies (DEEs) as a preferential inhibitor of persistent sodium current, shown to be a key driver of seizure symptoms in severe DEEs. Relutrigine’s mechanism of precision sodium channel (NaV) modulation is consistent with superior selectivity for disease-state NaV channel hyperexcitability. In vivo studies of relutrigine have demonstrated dose-dependent inhibition of seizures up to complete control of seizure activity in SCN2A, SCN8A and other DEE mouse models. Relutrigine has been generally well-tolerated in three Phase 1 studies and has demonstrated biomarker changes indicative of NaV channel modulation. Data from cohort 1 of the Phase 2 EMBOLD study demonstrated a well-tolerated, robust, short- and long-term improvement in motor seizures in a heavily pre-treated population alongside maintained seizure freedom in some patients with SCN2A- and SCN8A-DEE. Relutrigine has received Orphan Drug Designation (ODD) and Rare Pediatric Disease Designation from the FDA for the treatment of SCN2A-DEE, SCN8A-DEE and Dravet syndrome, as well as Breakthrough Therapy Designation (BTD), and ODD from the European Medicines Agency for the treatment of SCN2A-DEE and SCN8A-DEE. To learn more about the EMERALD and EMBOLD studies, please visit\nResilienceStudies.com\n.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995 and other federal securities laws, including express or implied statements regarding Praxis’ future expectations, plans and prospects, including, without limitation, statements regarding the anticipated timing of our clinical trials, the development of our product candidates and the anticipated timing of regulatory submissions and interactions, as well as other statements containing the words “anticipate,” “believe,” “continue,” “could,” “endeavor,” “estimate,” “expect,” “anticipate,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “target,” “will” or “would” and similar expressions that constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995.\nThe express or implied forward-looking statements included in this press release are only predictions and are subject to a number of risks, uncertainties and assumptions, including, without limitation: uncertainties inherent in clinical trials; the expected timing of clinical trials, data readouts and the results thereof, and submissions for regulatory approval or review by governmental authorities; regulatory approvals to conduct trials; and other risks concerning Praxis’ programs and operations as described in its Annual Report on Form 10-K for the year ended December 31, 2024 and other filings made with the Securities and Exchange Commission. Although Praxis’ forward-looking statements reflect the good faith judgment of Its management, these statements are based only on information and factors currently known by Praxis. As a result, you are cautioned not to rely on these forward-looking statements. Any forward-looking statement made in this press release speaks only as of the date on which it is made. Praxis undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/07/02/3109563/0/en/Praxis-Precision-Medicines-Inc-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "July 02, 2025 17:00 ET",
    "text": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)\nJuly 02, 2025 17:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, July  02, 2025  (GLOBE NEWSWIRE) -- Praxis Precision Medicines, Inc. (Nasdaq: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that on July 1, 2025, the Compensation Committee of Praxis’ Board of Directors granted restricted stock unit awards covering an aggregate of 2,100 shares of its common stock to three new non-executive employees under the Praxis Precision Medicines, Inc. 2024 Inducement Plan (the 2024 Inducement Plan). The restricted stock unit awards were granted as inducements material to the employees’ entering into employment with Praxis in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe 2024 Inducement Plan is used exclusively for the grant of equity awards to individuals who were not previously employees of Praxis, or following a bona fide period of non-employment, as an inducement material to such individuals’ entering into employment with Praxis, pursuant to Nasdaq Listing Rule 5635(c)(4).\nThe restricted stock units will vest in four equal annual installments, subject to the employee’s continued employment with Praxis on each vesting date.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/06/04/3094026/0/en/Praxis-Precision-Medicines-Inc-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "June 04, 2025 17:00 ET",
    "text": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)\nJune 04, 2025 17:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, June  04, 2025  (GLOBE NEWSWIRE) -- Praxis Precision Medicines, Inc. (Nasdaq: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that on June 2, 2025, the Compensation Committee of Praxis’ Board of Directors granted a restricted stock unit award covering 750 shares of its common stock to one new non-executive employee under the Praxis Precision Medicines, Inc. 2024 Inducement Plan (the 2024 Inducement Plan). The restricted stock unit award was granted as inducement material to the employee’s entering into employment with Praxis in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe 2024 Inducement Plan is used exclusively for the grant of equity awards to individuals who were not previously employees of Praxis, or following a bona fide period of non-employment, as an inducement material to such individuals’ entering into employment with Praxis, pursuant to Nasdaq Listing Rule 5635(c)(4).\nThe restricted stock units will vest in four equal annual installments, subject to the employee’s continued employment with Praxis on each vesting date.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines to Participate in Upcoming Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/05/20/3084804/0/en/Praxis-Precision-Medicines-to-Participate-in-Upcoming-Conferences.html",
    "date": "May 20, 2025 08:00 ET",
    "text": "Praxis Precision Medicines to Participate in Upcoming Conferences\nMay 20, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, May  20, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that it will be participating in three upcoming investor conferences:\nPraxis management will be participating in a fireside chat at the\nH.C. Wainwright 3\nrd\nAnnual BioConnect Investor Conference\n, taking place at NASDAQ on Tuesday, May 20\nth\n, at 9:30am ET. A webcast of the fireside chat will be available through this\nlink\n.\nPraxis management will also be participating in the Mizuho Neuro & Ophthalmology Summit, taking place in New York City on Wednesday, May 21\nst\n.\nPraxis management will also be presenting a corporate overview at the\nJefferies Global Healthcare Conference\n, taking place at the Marriott Marquis in New York City on Wednesday, June 4\nth\n, at 8:10am ET. A live webcast of the presentation will be available through this\nlink\n.\nThe Company will be available for one-on-one meetings during all events. Interested investors should contact their respective representatives to request meetings.\nReplays of the webcasted events will also be available through the “\nEvents & Presentations\n” page under the “\nInvestors + Media\n” section of the company’s website for 90 days.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nInstagram\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines Highlights DEE Clinical Program Updates at Virtual Investor Event",
    "link": "https://www.globenewswire.com/news-release/2025/05/05/3074004/0/en/Praxis-Precision-Medicines-Highlights-DEE-Clinical-Program-Updates-at-Virtual-Investor-Event.html",
    "date": "May 05, 2025 08:00 ET",
    "text": "Praxis Precision Medicines Highlights DEE Clinical Program Updates at Virtual Investor Event\nMay 05, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, May  05, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, hosted a virtual investor event on its clinical programs in developmental and epileptic encephalopathies (DEEs) on Friday, May 2, 2025.\n“We were excited to highlight the significant opportunity in DEEs and progress Praxis is making in this field,” said Marcio Souza, president and chief executive officer of Praxis. “Relutrigine continues to show tremendous promise to broadly address the DEE market opportunity, supported by robust pre-clinical results in multiple DEE models and further strengthened by new data from the EMBOLD study showing increasing seizure control over time. We also presented the EMBRAVE3 design for elsunersen in SCN2A gain-of-function (GoF) patients. This is not only the shortest known trial for an antisense oligonucleotide (ASO) but also supports a potential regulatory pathway for early intervention with treatment starting at birth when symptoms of this devastating disease first appear. We are also thrilled to see great progress in our ASO portfolio, with PRAX-100 in mono-genetic autism on track to declare a development candidate by mid-year. This is truly an exciting period for the DEE community and Praxis, and we look forward to continue sharing our progress with multiple upcoming catalysts.”\nThe slide presentation and a replay of the event are available on Praxis’ website on the “\nEvents and Presentations\n” page under the investor section.\nKey Event Topics and Highlights:\nRelutrigine\nPraxis shared updated data from the initial cohort of patients in the EMBOLD study, highlighting results through 11 months of patient dosing. The open-label extension (OLE) includes 12 patients who continued on relutrigine following completion of the initial four-month double-blind period:\nPatients achieved a mean seizure reduction of approximately 90% from baseline.\nThe mean longest period without seizures for patients is 67 days after 11 months of exposure, compared to 3 days at baseline. The EMBOLD registrational study for SCN2A and SCN8A-DEEs continues to enroll strongly with topline results expected no later than the first half of 2026.\nPraxis presented a comprehensive set of pre-clinical data spanning 10 different DEE disease models, providing compelling evidence that relutrigine’s anti-seizure mechanism is well suited for broad DEEs. Praxis plans to initiate the EMERALD registrational study in mid-2025.\nEMERALD will recruit 160 patients in a randomized, placebo-controlled study with a 16-week treatment period to evaluate seizure reduction.\nPatients will be selected based on clinical phenotype, irrespective of genetic etiology.\nWith a target population exceeding 200,000 patients in the US and precedent from other approved DEE therapies, Praxis conservatively estimates a US market potential of at least $3 billion.\nThe company also shared its expectation that relutrigine could potentially be used in combination with any of its DEE ASO programs (elsunersen, PRAX-080, PRAX-090) allowing patients to receive both therapies together for broader clinical benefit.\nElsunersen\nEMBRAVE Part A is enrolling up to 16 patients on a 3:1 drug to sham ratio with once-monthly intrathecal dosing for six months. Recruitment is expected to be complete by mid-year with topline results in the first half of 2026.\nThe EMBRAVE3 registrational trial, initiating in mid-2025, will initially enroll patients ages 2-18. Subsequent cohorts will support treatment initiation from birth, reflecting the early onset of SCN2A GoF DEE which can present in-utero or shortly after birth and is often diagnosed within the first three weeks of life.\nWith a global addressable population estimated at 5,000 patients, and pricing analogs for other approved ASOs, Praxis conservatively estimates a global market potential of $1 billion.\nSolidus pre-clinical pipeline\nPraxis plans to nominate a development candidate for its early-stage ASO program PRAX-100 in mid-2025.\nPRAX-100 is targeting SCN2A loss-of-function (LoF) mutations, a leading cause of monogenetic autism.\nPraxis shared pre-clinical data from four candidate ASOs showing significant increase in protein levels versus control in a humanized SCN2A mouse model, believed to be sufficient to offset the naturally occurring protein reduction seen in patients with SCN2A LoF mutations.\nPraxis remains on track to nominate development candidates for PRAX-080 and PRAX-090 by the end of 2025. PRAX-080 is targeting PCDH19 mosaic expression and PRAX-090 is designed to address SYNGAP1 LoF mutations.\nAbout Relutrigine (PRAX-562)\nRelutrigine is a first-in-class small molecule in development for the treatment of developmental and epileptic encephalopathies (DEEs) as a preferential inhibitor of persistent sodium current, shown to be a key driver of seizure symptoms in severe DEEs. Relutrigine’s mechanism of precision sodium channel (NaV) modulation is consistent with superior selectivity for disease-state NaV channel hyperexcitability. In vivo studies of relutrigine have demonstrated dose-dependent inhibition of seizures up to complete control of seizure activity in SCN2A, SCN8A and other DEE mouse models. Relutrigine has been generally well-tolerated in three Phase 1 studies and has demonstrated biomarker changes indicative of NaV channel modulation. Data from Cohort 1 of the Phase 2 EMBOLD study demonstrated a well-tolerated, robust, short- and long-term improvement in motor seizures in a heavily pre-treated population alongside maintained seizure freedom in some patients with SCN2A- and SCN8A-DEE. Relutrigine has received Orphan Drug Designation (ODD) and Rare Pediatric Disease Designation from the FDA for the treatment of SCN2A-DEE, SCN8A-DEE and Dravet syndrome, and ODD from the European Medicines Agency for the treatment of SCN2A-DEE and SCN8A-DEE. To learn more about the EMBOLD study, please visit\nhttps://www.emboldstudy.com/\n.\nAbout Elsunersen (PRAX-222)\nElsunersen is an antisense oligonucleotide (ASO) designed to selectively decrease SCN2A gene expression, directly targeting the underlying cause of early-onset SCN2A-DEE to treat seizures and other symptoms in patients with gain-of-function SCN2A mutations. In vitro studies of elsunersen have demonstrated reduction in both SCN2A gene expression and protein levels. In vivo, elsunersen has demonstrated significant, dose-dependent reduction in seizures, improvement in behavioral and locomotor activity and increased survival in SCN2A mouse models. Data from the Part 1 of the EMBRAVE study demonstrated well-tolerated, significant and sustained seizure reduction in patients with SCN2A-DEE. Elsunersen has received Orphan Drug Designation (ODD) and Rare Pediatric Disease Designation (RPD) from the FDA, and ODD and PRIME designations from the European Medicines Agency (EMA) for the treatment of SCN2A-DEE. The Elsunersen program is ongoing under a collaboration with Ionis Pharmaceuticals, Inc. (NASDAQ: IONS), and RogCon, Inc. To learn more about the EMBRAVE study, please visit\nhttps://www.embravestudy.org/\n.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nInstagram\n,\nLinkedIn\nand\nTwitter/X\n.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995 and other federal securities laws, including express or implied statements regarding Praxis’ future expectations, plans and prospects, including, without limitation, statements regarding the anticipated timing of our clinical trials, the development of our product candidates and plans to initiate new clinical programs and the anticipated timing of regulatory submissions and interactions, as well as other statements containing the words “anticipate,” “believe,” “continue,” “could,” “endeavor,” “estimate,” “expect,” “anticipate,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “target,” “will” or “would” and similar expressions that constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995.\nThe express or implied forward-looking statements included in this press release are only predictions and are subject to a number of risks, uncertainties and assumptions, including, without limitation: uncertainties inherent in clinical trials; the expected timing of clinical trials, data readouts and the results thereof, and submissions for regulatory approval or review by governmental authorities; regulatory approvals to conduct trials; and other risks concerning Praxis’ programs and operations as described in its Annual Report on Form 10-K for the year ended December 31, 2024 and other filings made with the Securities and Exchange Commission. Although Praxis’ forward-looking statements reflect the good faith judgment of Its management, these statements are based only on information and factors currently known by Praxis. As a result, you are cautioned not to rely on these forward-looking statements. Any forward-looking statement made in this press release speaks only as of the date on which it is made. Praxis undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/05/02/3073573/0/en/Praxis-Precision-Medicines-Inc-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "May 02, 2025 17:00 ET",
    "text": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)\nMay 02, 2025 17:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, May  02, 2025  (GLOBE NEWSWIRE) -- Praxis Precision Medicines, Inc. (Nasdaq: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that on May 1, 2025, the Compensation Committee of Praxis’ Board of Directors granted restricted stock unit awards covering an aggregate of 3,688 shares of its common stock to five new non-executive employees under the Praxis Precision Medicines, Inc. 2024 Inducement Plan (the 2024 Inducement Plan). The restricted stock units were granted as inducements material to the employees’ entering into employment with Praxis in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe 2024 Inducement Plan is used exclusively for the grant of equity awards to individuals who were not previously employees of Praxis, or following a bona fide period of non-employment, as an inducement material to such individuals’ entering into employment with Praxis, pursuant to Nasdaq Listing Rule 5635(c)(4).\nThe restricted stock units will vest in four equal annual installments, subject to each employee’s continued employment with Praxis on each vesting date.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines Provides Corporate Update and Reports First Quarter 2025 Financial Results",
    "link": "https://www.globenewswire.com/news-release/2025/05/02/3073273/0/en/Praxis-Precision-Medicines-Provides-Corporate-Update-and-Reports-First-Quarter-2025-Financial-Results.html",
    "date": "May 02, 2025 08:30 ET",
    "text": "Praxis Precision Medicines Provides Corporate Update and Reports First Quarter 2025 Financial Results\nMay 02, 2025 08:30 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nOn track for six major study readouts across four programs over the next 12 months\nReady to initiate pivotal studies in two developmental and epileptic encephalopathy (DEE) programs in mid-year 2025: EMERALD for broad DEEs with relutrigine and EMBRAVE3 for SCN2A GoF with elsunersen\nVormatrigine continues to generate a best-in-class safety profile with new data demonstrating no food effect and higher dosing tolerability\nPraxis to host a virtual investor event on Friday, May 2, 2025 to discuss its DEE portfolio\n[registration link]\nCash and investments of $472 million as of March 31, 2025, maintains runway into 2028\nBOSTON, May  02, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today provided a corporate update and reported financial results for the first quarter 2025.\n“We have made substantial progress in advancing our promising late-stage epilepsy portfolio and are firing on all cylinders through this unpredictable time in the industry,” said Marcio Souza, president and chief executive officer of Praxis. “With multiple upcoming catalysts and data readouts, we expect a transformative year at Praxis. In the near-term, we anticipate topline results for vormatrigine from the RADIANT study in epilepsy by mid-2025, and from the POWER1 study in the second half of 2025. Vormatrigine continues to demonstrate an ideal profile and strong competitive differentiation”\nMr. Souza continued, “The registrational cohort of the EMBOLD study is recruiting strongly and is on-track for topline results no later than the first half of 2026, and we will soon initiate the registrational EMERALD study to investigate relutrigine more broadly in DEEs. The EMBRAVE study with elsunersen is progressing very well, with topline results expected in the first half of next year to support the registrational package, and we will initiate the Phase 3 EMBRAVE3 trial for elsunersen by mid-2025. While the interim analysis of Essential3 study 1 for ulixacaltamide was not what we expected, we are on track to complete both study 1 and study 2 for topline readout in the third quarter of this year. Our solid financial position ensures we have sufficient funding for all studies supporting our late-stage programs, with runway into 2028.”\nRecent Highlights and Anticipated Milestones\nCerebrum™ Small Molecule Platform\nVormatrigine for Focal Onset Seizures (FOS) and Generalized Epilepsy:\nAn estimated 3.5 million people in the U.S. suffer from common epilepsies. Sodium channel therapy is the cornerstone of treatment for patients with epilepsy yet the currently approved drugs have significant safety and efficacy limitations. Vormatrigine is the most potent sodium-channel modulator ever designed to precisely target the hyperexcitable state of sodium-channels in adult common epilepsies.\nAt the American Association of Neurology (AAN) conference earlier this quarter, Praxis presented further data from recently completed Phase 1 studies\n[link]\n, where vormatrigine continued to demonstrate an ideal profile with strong competitive differentiation.\nResults from an additional 45 mg multiple ascending dose (MAD) cohort demonstrated a 20x exposure on the MES EC\n50\nscale achieved in subjects, the most of any anti-seizure medicine, with a tolerable safety profile.\nThe Phase 1 food effect study demonstrated that food intake does not significantly impact vormatrigine absorption and therefore vormatrigine can be administered with or without food, which increases flexibility in dosing and ease of use for patients.\nEnrollment and progress across the ENERGY program continues to advance\nPraxis provided an update on the EMPOWER registrational study\n[link]\nat AAN, which continues to attract epilepsy patients and be a source for identifying candidate patients for the RADIANT and POWER1 studies, with over 3,000 patients registered to date\nThe RADIANT Phase 2 study in FOS and generalized epilepsy is progressing, with topline results expected mid-year 2025\nThe POWER1 Phase 2/3 registrational study for treatment resistant FOS is enrolling, with topline results expected in the second half of 2025\nThe POWER2 Phase 2/3 registrational study for treatment resistant FOS is on track to initiate in the second half of 2025\nRelutrigine for DEEs:\nRelutrigine is a sodium channel modulator with therapeutic potential across developmental epilepsies. Relutrigine is currently being evaluated in the EMBOLD study in SCN2A and SCN8A DEEs, and we will be initiating the EMERALD study in a broader, pan-DEE patient population. Relutrigine has Rare Pediatric Disease Designation in three indications: SCN1A epilepsy (Dravet syndrome), SCN2A and SCN8A DEEs\nThe EMBOLD registrational cohort 2 continues to enroll strongly, with topline results expected no later than the first half of 2026, followed by potential NDA filing.\nPraxis has completed discussions with the FDA on a trial for broad DEEs and will initiate the EMERALD registrational study in mid-2025. The study design will be shared at today’s DEE virtual analyst event.\nUlixacaltamide for Essential Tremor (ET)\n: ET is an inadequately managed, undertreated and high burden disease with a prevalence of seven million patients in the U.S. The Essential3 program is the first Phase 3 study in the disease and includes two registrational studies: Study 1 is a parallel design, placebo-controlled study (N=400) and Study 2 is a randomized withdrawal study (N=200). Since beginning recruitment in November 2023, over 200,000 patients have demonstrated interest in participating in the study.\nOn February 28, Praxis shared the results of a pre-planned interim analysis of Study 1. The Independent Data Monitoring Committee recommended that the study be stopped for futility, due to the results being unlikely to meet the primary efficacy endpoint under the parameters set by the statistical model.\nPraxis has decided to continue the studies to completion and will share topline results in the third quarter of 2025. After reviewing the results of both studies, Praxis will make a decision if there is sufficient evidence to support an NDA filing.\nSolidus™ Antisense Oligonucleotide (ASO) Platform\nElsunersen for early-seizure-onset SCN2A DEE:\nSCN2A GoF-DEE is a rare, genetic epilepsy characterized by early-onset seizures and severe impact on development. Praxis has two studies supporting its registrational filing.\nThe EMBRAVE Part A Phase 1/2 study is continuing to enroll. Patients are randomized 3:1 drug to sham for a six-month period on a once-monthly dose, with the potential to escalate from 1 mg to 8 mg. Topline results are expected in the first half of 2026.\nThe EMBRAVE3 registrational study for SCN2A GoF-DEE is on track to initiate in mid-2025. Cohort 1 of the study will enroll up to 40 patients ages 2 to 18 years, 1:1 between drug and sham for a six-month period with once monthly intrathecal dosing of 1 mg per visit, with a primary endpoint measuring reduction in seizure frequency. Cohorts 2 and 3 will evaluate patients from ages 1 to 2 and 0 to 1 years, respectively.\nIn April 2025, the experience of an emergency-use patient dosed on elsunersen was published in Nature Medicine\n[linkl\nproviding preliminary insights on the safety and efficacy of elsunersen in a preterm infant with early-onset SCN2A developmental and epileptic encephalopathy.\nPraxis remains on track to nominate a development candidate for each of its early stage ASO therapeutic initiatives in 2025\nPRAX-080: Focused on targeting PCDH19 mosaic expression\nPRAX-090: Designed to address SYNGAP1 loss-of-function (LoF) mutations, a leading cause of severe intellectual disability and epilepsy in DEEs.\nPRAX-100: Targeting SCN2A LoF mutations, the predominant genetic link to de novo autism spectrum disorders (ASD).\nFirst Quarter 2025 Financial Results:\nAs of March 31, 2025, Praxis had $472.0 million in cash, cash equivalents and marketable securities, compared to $469.5 million in cash, cash equivalents and marketable securities as of December 31, 2024. The increase of $2.5 million is primarily attributable to net proceeds from at-the-market offerings of common stock offset by cash used in operating activities. The Company’s cash, cash equivalents and marketable securities as of March 31, 2025 are expected to fund operations into 2028.\nPraxis did not recognize any collaboration revenue during the three months ended March 31, 2025, compared to $0.4 million during the three months ended March 31, 2024. The decrease of $0.4 million is related to its Option and License Agreement with UCB. In December 2024, UCB exercised its option to in-license global development and commercialization rights for a KCNT1 small molecule development candidate, and as such, Praxis has no further research service obligations under the terms of the Option and License Agreement.\nResearch and development expenses were $60.8 million for the three months ended March 31, 2025, compared to $27.0 million for the three months ended March 31, 2024. The increase in research and development expenses of $33.8 million was primarily attributable to $29.9 million in increased expenses related to the Company’s Cerebrum™ platform, $1.9 million in increased personnel expenses, and $1.9 million in increased indirect expenses.\nGeneral and administrative expenses were $13.9 million for the three months ended March 31, 2025, compared to $15.3 million for the three months ended March 31, 2024. The decrease in general and administrative expenses of approximately $1.4 million was primarily due to $2.8 million in decreased personnel-related expenses, partially offset by a $1.4 million increase in indirect expenses.\nPraxis reported a net loss of $69.3 million for the three months ended March 31, 2025, including $8.8 million of stock-based compensation expense, compared to $39.6 million for the three months ended March 31, 2024, including $14.5 million of stock-based compensation.\nAs of March 31, 2025, Praxis had 20.3 million shares of common stock outstanding.\nAbout Vormatrigine (PRAX-628)\nVormatrigine is a next-generation, functionally selective small molecule targeting the hyperexcitable state of sodium-channels in the brain that is currently being developed as a once daily, oral treatment for adult focal onset seizures and generalized epilepsy. Preclinical data demonstrates vormatrigine is differentiated from standard of care, with the potential to be best-in-class for focal epilepsy. In vitro, vormatrigine has demonstrated superior selectivity for disease-state Na\nV\nchannel hyperexcitability. In vivo studies of vormatrigine have demonstrated unprecedented potency in the maximal electroshock seizure (MES) model, a highly predictive translational model for efficacy in focal epilepsy. Data from the study demonstrated that vormatrigine can be safely dosed in healthy subjects to greater than 20 times the predicted human equivalent of the rodent MES EC\n50\n. To learn more about the POWER1 study please visit\nPOWER1 study\n.\nAbout Relutrigine (PRAX-562)\nRelutrigine is a first-in-class small molecule in development for the treatment of developmental and epileptic encephalopathy (DEE) as a preferential inhibitor of persistent sodium current, shown to be a key driver of seizure symptoms in early onset SCN2A-DEE and SCN8A-DEE. Relutrigine’s mechanism of sodium channel blocking is consistent with superior selectivity for disease state sodium channel (NaV) channel hyperexcitability. In vivo studies of relutrigine have demonstrated dose-dependent inhibition of seizures up to complete control of seizure activity in SCN2A, SCN8A and other DEE mouse models. Relutrigine has been generally well-tolerated in three Phase 1 studies and has demonstrated biomarker changes indicative of NaV channel blocking effects. Relutrigine has received ODD and RPDD from the FDA, and ODD from the European Medicines Agency for the treatment of SCN2A-DEE and SCN8A-DEE and RPDD for Dravet Syndrome from the FDA. To learn more about the EMBOLD study, please visit\nEMBOLD study\n.\nAbout Ulixacaltamide\nUlixacaltamide is a differentiated and highly selective small molecule inhibitor of T-type calcium channels designed to block abnormal neuronal burst firing in the Cerebello-Thalamo-Cortical (CTC) circuit correlated with tremor activity. Ulixacaltamide, the most advanced program within Praxis’ Cerebrum™ small molecule platform, is currently in late-stage development for the treatment of essential tremor,\nEssential3 study\n.\nAbout Elsunersen (PRAX-222)\nElsunersen is an antisense oligonucleotide (ASO) designed to selectively decrease SCN2A gene expression, directly targeting the underlying cause of early-seizure-onset SCN2A-DEE to treat seizures and other symptoms in patients with gain-of-function SCN2A mutations. In vitro studies of elsunersen have demonstrated reduction in both SCN2A gene expression and protein levels. In vivo, elsunersen has demonstrated significant, dose-dependent reduction in seizures, improvement in behavioral and locomotor activity and increased survival in SCN2A mouse models, with potential to be the first disease-modifying treatment for SCN2A-DEE. Elsunersen has received ODD and RPD from the FDA, and ODD and PRIME designations from the European Medicines Agency for the treatment of SCN2A-DEE. The elsunersen program is ongoing under a collaboration with Ionis Pharmaceuticals, Inc., and RogCon, Inc. To learn more about the EMBRAVE study, please visit\nhttps://www.embravestudy.com/\n.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995 and other federal securities laws, including express or implied statements regarding Praxis’ future expectations, plans and prospects, including, without limitation, statements regarding the anticipated timing of our clinical trials, the development of our product candidates and plans to initiate new clinical programs, the anticipated timing of regulatory submissions and interactions and our projected cash runway, as well as other statements containing the words “anticipate,” “believe,” “continue,” “could,” “endeavor,” “estimate,” “expect,” “anticipate,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “target,” “will” or “would” and similar expressions that constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995.\nThe express or implied forward-looking statements included in this press release are only predictions and are subject to a number of risks, uncertainties and assumptions, including, without limitation: uncertainties inherent in clinical trials; preliminary analyses from ongoing studies differing materially from final data from preclinical studies and completed clinical trials; the expected timing of clinical trials, data readouts and the results thereof, and submissions for regulatory approval or review by governmental authorities; regulatory approvals to conduct trials; and other risks concerning Praxis’ programs and operations as described in its Annual Report on Form 10-K for the year ended December 31, 2024 and other filings made with the Securities and Exchange Commission. Although Praxis’ forward-looking statements reflect the good faith judgment of its management, these statements are based only on information and factors currently known by Praxis. As a result, you are cautioned not to rely on these forward-looking statements. Any forward-looking statement made in this press release speaks only as of the date on which it is made. Praxis undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.\nPRAXIS PRECISION MEDICINES, INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(Amounts in thousands)\n(Unaudited)\nMarch 31,\n2025\nDecember 31,\n2024\nAssets\nCash and cash equivalents\n$\n165,567\n$\n215,372\nMarketable securities\n306,456\n254,156\nPrepaid expenses and other current assets\n5,584\n11,805\nProperty and equipment, net\n247\n230\nOperating lease right-of-use assets\n882\n1,131\nOther non-current assets\n—\n416\nTotal assets\n$\n478,736\n$\n483,110\nLiabilities and stockholders’ equity\nAccounts payable\n$\n22,909\n$\n12,528\nAccrued expenses\n15,547\n23,763\nOperating lease liabilities\n1,066\n1,369\nCommon stock\n14\n14\nAdditional paid-in capital\n1,344,577\n1,281,522\nAccumulated other comprehensive gain\n659\n654\nAccumulated deficit\n(906,036\n)\n(836,740\n)\nTotal liabilities and stockholders' equity\n$\n478,736\n$\n483,110\nPRAXIS PRECISION MEDICINES, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(Amounts in thousands, except share and per share amounts)\n(Unaudited)\nThree Months Ended\nMarch 31,\n2025\n2024\nCollaboration revenue\n$\n—\n$\n431\nOperating expenses:\nResearch and development\n60,806\n26,984\nGeneral and administrative\n13,922\n15,333\nTotal operating expenses\n74,728\n42,317\nLoss from operations\n(74,728\n)\n(41,886\n)\nOther income:\nOther income, net\n5,432\n2,333\nTotal other income\n5,432\n2,333\nNet loss\n$\n(69,296\n)\n$\n(39,553\n)\nNet loss per share attributable to common stockholders, basic and diluted\n$\n(3.29\n)\n$\n(2.84\n)\nWeighted average common shares outstanding, basic and diluted\n21,055,834\n13,904,374\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines to Hold Virtual Investor Event to Discuss Clinical Programs in Developmental and Epileptic Encephalopathies",
    "link": "https://www.globenewswire.com/news-release/2025/04/08/3057521/0/en/Praxis-Precision-Medicines-to-Hold-Virtual-Investor-Event-to-Discuss-Clinical-Programs-in-Developmental-and-Epileptic-Encephalopathies.html",
    "date": "April 08, 2025 08:00 ET",
    "text": "Praxis Precision Medicines to Hold Virtual Investor Event to Discuss Clinical Programs in Developmental and Epileptic Encephalopathies\nApril 08, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, April  08, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that it will be hosting a virtual investor event on Friday, May 2, 2025 from 10:00 a.m. to 11:30 a.m. EDT.\nThe webinar, hosted by the Praxis management team, will focus on the company’s clinical programs in developmental and epileptic encephalopathies (DEEs) including:\nThe EMBOLD study evaluating relutrigine for SCN2A and SCN8A DEEs\nThe EMERALD study evaluating relutrigine for broader DEEs\nThe EMBRAVE3 study evaluating elsunersen for SCN2A gain-of-function DEE\nTo RSVP and attend the live event, you may click\nhere\n.   A replay of the webinar will also be available through the “\nEvents & Presentations\n” page under the “\nInvestors + Media\n” section of the company’s website for 90 days.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nInstagram\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines to Participate in Upcoming April Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/04/03/3055641/0/en/Praxis-Precision-Medicines-to-Participate-in-Upcoming-April-Conferences.html",
    "date": "April 03, 2025 17:00 ET",
    "text": "Praxis Precision Medicines to Participate in Upcoming April Conferences\nApril 03, 2025 17:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, April  03, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that it will be participating in two upcoming investor conferences this April:\nPraxis management will be presenting a corporate overview at the\n24\nth\nAnnual Needham Virtual Healthcare Conference\n, taking place virtually on Monday, April 7, 2025 at 11:00a.m. EDT. A live webcast of the event will be available through this\nlink\n.\nPraxis management will also be participating in the\nPiper Sandler Spring Biopharma Symposium\n, taking place at One Boston Place in Boston on Thursday, April 17, 2025.\nThe Company will be available for one-on-one meetings during both events. Interested investors should contact their respective Needham and/or Piper Sandler representatives to request meetings.\nReplays of the webcasted events will also be available through the “\nEvents & Presentations\n” page under the “\nInvestors + Media\n” section of the company’s website for 90 days.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nInstagram\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/04/03/3055567/0/en/Praxis-Precision-Medicines-Inc-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "April 03, 2025 16:00 ET",
    "text": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)\nApril 03, 2025 16:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, April  03, 2025  (GLOBE NEWSWIRE) -- Praxis Precision Medicines, Inc. (Nasdaq: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that on April 1, 2025, the Compensation Committee of Praxis’ Board of Directors granted restricted stock unit awards covering an aggregate of 8,763 shares of its common stock to four new non-executive employees under the Praxis Precision Medicines, Inc. 2024 Inducement Plan (the 2024 Inducement Plan). The restricted stock units were granted as inducements material to the employees’ entering into employment with Praxis in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe 2024 Inducement Plan is used exclusively for the grant of equity awards to individuals who were not previously employees of Praxis, or following a bona fide period of non-employment, as an inducement material to such individuals’ entering into employment with Praxis, pursuant to Nasdaq Listing Rule 5635(c)(4).\nThe restricted stock units will vest in four equal annual installments, subject to each employee’s continued employment with Praxis on each vesting date.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines to Present on Late-Stage Programs across Epilepsy and Movement Disorders at the American Academy of Neurology 2025 Annual Meeting",
    "link": "https://www.globenewswire.com/news-release/2025/03/24/3047808/0/en/Praxis-Precision-Medicines-to-Present-on-Late-Stage-Programs-across-Epilepsy-and-Movement-Disorders-at-the-American-Academy-of-Neurology-2025-Annual-Meeting.html",
    "date": "March 24, 2025 08:00 ET",
    "text": "Praxis Precision Medicines to Present on Late-Stage Programs across Epilepsy and Movement Disorders at the American Academy of Neurology 2025 Annual Meeting\nMarch 24, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, March  24, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that that it will present data from its four late-stage programs in epilepsy and movement disorders at the American Academy of Neurology (AAN) 2025 Annual Meeting taking place from April 5 to 9, 2025 in San Diego, California.\n“Praxis’s innovative pipeline continues to rapidly advance, with four late-stage programs poised to transform patient care,” said Steven Petrou, Chief Scientific Officer and Co-Founder of Praxis. “At this year’s AAN, we’re excited to present the latest developments across our diverse portfolio, including key clinical updates from the vormatrigine ENERGY program and newly initiated clinical trials actively enrolling patients across the U.S., Europe, and Latin America. We are especially pleased to host an engaging In-Booth Speaker Showcase featuring renowned experts and collaborators who share our mission of revolutionizing therapies for CNS disorders.”\nPraxis will have multiple opportunities for visitors to learn more about its portfolio:\nExhibiting\nat\nbooth #2113\nwhere visitors can interact with members of the Praxis team including a dedicated networking event, detailed below\nHosting\nan In-Booth Speaker Showcase covering three of its clinical-stage assets, and featuring an exciting line up of leading epilepsy and movement disorders experts, detailed below\nPresenting\nfour unique posters covering two of its clinical-stage assets, detailed below\nPraxis Booth\nConnect with members of our team at booth #2113 during exhibit hours or join us for the following:\nIn-Booth Networking Crawl\n–\nrefreshments served\nMonday, April 7 | 4:00 PM – 6:00 PM PT | Booth 2113 | Exhibit Hall A-D\nIn Booth Speaker Showcase\n–\nPraxis Precision Medicines: Revolutionizing CNS Therapies\nSunday 6 April – Wednesday 9 April | 1:30 PM – 3:30 PM PT | Exhibit Hall A-D\nPraxis Poster Presentations\nP5-011\n:\nSpotlight on Essential Tremor Management and Impact: Results from an Online Survey Capturing HCP and Patient Perspectives of Disease Burden\nSaturday, April 5 | 11:45 AM – 12:45 PM PT | Exhibit Hall A\nP5-012\n:\nCharacteristics of Adult Essential Tremor Patients Seeking Participation in a Decentralized US Clinical Trial: Pre-screener Findings from the Essential3 Program Evaluating Efficacy and Safety of Ulixacaltamide\nSaturday, April 5 | 11:45 AM – 12:45 PM PT | Exhibit Hall A\nP9-012\n: Epilepsy Monitoring of Prospective Seizure Observations with Electronic Records (EMPOWER): An Observational Study Designed to Better Understand the Patient Journey\nMonday, April 7 | 8:00 AM – 9:00 AM PT | Exhibit Hall A\nP4-006\n: Updates from the First-in-human Phase 1 Clinical Trial Evaluating the Safety, Tolerability, Pharmacokinetics and Food Effect of Vormatrigine in Healthy Participants\nWednesday, April 9 | 8:00 AM – 9:00 AM PT | Exhibit Hall A\nMaterials will be made available on the Resources page of the Praxis website following presentation at AAN 2025:\nhttps://praxismedicines.com/resources/\n.\nAbout Relutrigine (PRAX-562)\nRelutrigine is a first-in-class small molecule in development for the treatment of developmental and epileptic encephalopathies (DEEs) as a preferential inhibitor of persistent sodium current, shown to be a key driver of seizure symptoms in severe DEEs. Relutrigine’s mechanism of precision sodium channel (NaV) modulation is consistent with superior selectivity for disease-state NaV channel hyperexcitability. In vivo studies of relutrigine have demonstrated dose-dependent inhibition of seizures up to complete control of seizure activity in SCN2A, SCN8A and other DEE mouse models. Relutrigine has been generally well-tolerated in three Phase 1 studies and has demonstrated biomarker changes indicative of NaV channel modulation. Data from the Phase 2 EMBOLD study demonstrated in a heavily pre-treated population a well-tolerated, robust, short- and long-term improvement in motor seizures alongside maintained seizure freedom in some patients with SCN2A- and SCN8A-DEE. Relutrigine has received Orphan Drug Designation (ODD) and Rare Pediatric Disease Designation from the FDA, and ODD from the European Medicines Agency for the treatment of SCN2A-DEE and SCN8A-DEE. To learn more about the EMBOLD study, please visit\nhttps://www.emboldstudy.com/\n.\nAbout Vormatrigine (PRAX-628)\nVormatrigine is a next-generation, functionally selective small molecule targeting the hyperexcitable state of NaV channels in the brain that is currently being developed as a once daily, oral treatment for adult focal onset seizures and generalized epilepsy. Preclinical data demonstrates vormatrigine is differentiated from standard of care, with the potential to be best-in-class for focal onset seizures. In vitro, vormatrigine has demonstrated superior selectivity for disease-state NaV channel hyperexcitability. In vivo studies of vormatrigine have demonstrated unprecedented potency in the maximal electroshock seizure (MES) model, a highly predictive translational model for efficacy in focal epilepsy. Data from the PRAX-628-101 study demonstrated that vormatrigine can be safely dosed in healthy subjects to greater than 15 times the predicted human equivalent of the rodent MES EC50, a translational indicator that suggests a therapeutic window with unprecedented magnitude relative to approved therapies.\nepilepsy-research.com\nAbout Elsunersen (PRAX-222)\nElsunersen is an antisense oligonucleotide (ASO) designed to selectively decrease SCN2A gene expression, directly targeting the underlying cause of early-onset SCN2A-DEE to treat seizures and other symptoms in patients with gain-of-function SCN2A mutations. In vitro studies of elsunersen have demonstrated reduction in both SCN2A gene expression and protein levels. In vivo, elsunersen has demonstrated significant, dose-dependent reduction in seizures, improvement in behavioral and locomotor activity and increased survival in SCN2A mouse models. Data from the EMBRAVE study demonstrated well-tolerated, significant and sustained seizure reduction in patients with SCN2A-DEE. Elsunersen has received Orphan Drug Designation (ODD) and Rare Pediatric Disease Designation (RPD) from the FDA, and ODD and PRIME designations from the European Medicines Agency (EMA) for the treatment of SCN2A-DEE. The Elsunersen program is ongoing under a collaboration with Ionis Pharmaceuticals, Inc. (NASDAQ: IONS), and RogCon, Inc. To learn more about the EMBRAVE study, please visit\nhttps://www.embravestudy.org/\n.\nAbout Ulixacaltamide\nUlixacaltamide is a differentiated and highly selective small molecule inhibitor of T-type calcium channels designed to block abnormal neuronal burst firing in the cerebello-thalamo-cortical (CTC) circuit correlated with tremor activity. Ulixacaltamide, the most advanced program within Praxis’ Cerebrum™ small molecule platform, is currently in development for the treatment of essential tremor.\nwww.praxisessentialtremor.com\n.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nInstagram\n,\nLinkedIn\nand\nTwitter/X\n.\nTags\nAAN\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/03/04/3037013/0/en/Praxis-Precision-Medicines-Inc-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "March 04, 2025 17:00 ET",
    "text": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)\nMarch 04, 2025 17:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, March  04, 2025  (GLOBE NEWSWIRE) -- Praxis Precision Medicines, Inc. (Nasdaq: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that on March 3, 2025, the Compensation Committee of Praxis’ Board of Directors granted non-qualified stock option awards to purchase an aggregate of 2,000 shares of its common stock and restricted stock unit awards covering an aggregate of 7,288 shares of its common stock to six new non-executive employees under the Praxis Precision Medicines, Inc. 2024 Inducement Plan (the 2024 Inducement Plan). The stock options and restricted stock units were granted as inducements material to the employees’ entering into employment with Praxis in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe 2024 Inducement Plan is used exclusively for the grant of equity awards to individuals who were not previously employees of Praxis, or following a bona fide period of non-employment, as an inducement material to such individuals’ entering into employment with Praxis, pursuant to Nasdaq Listing Rule 5635(c)(4).\nThe options have an exercise price of $33.55 per share, which is equal to the closing price of Praxis’ common stock on the Nasdaq Global Select Market on the date of grant. The options will vest over four years, with 25% of the options vesting on the first anniversary of the vesting commencement date and the remaining options vesting in equal monthly installments over the three years thereafter, subject to each employee’s continued employment with Praxis on each vesting dates. The restricted stock units will vest in four equal annual installments, subject to each employee’s continued employment with Praxis on each vesting date.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across movement disorders and epilepsy, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines to Participate in Five Upcoming Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/03/04/3036474/0/en/Praxis-Precision-Medicines-to-Participate-in-Five-Upcoming-Investor-Conferences.html",
    "date": "March 04, 2025 08:00 ET",
    "text": "Praxis Precision Medicines to Participate in Five Upcoming Investor Conferences\nMarch 04, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, March  04, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that it will be participating in five upcoming investor conferences:\nPraxis management will be presenting a corporate overview at the\n45\nth\nAnnual TD Cowen Health Care Conference\n, taking place at the Boston Marriott Copley Place in Boston on Wednesday, March 5, 2025 at 9:10a.m. EDT. A live webcast of the event will be available through this\nlink\n.\nPraxis management will also be participating in a fireside chat at the\nLeerink Partners Global Healthcare Conference\n, taking place at the W South Beach Hotel in Miami on Monday, March 10, 2025 at 3:40p.m. EDT. A live webcast of the event will be available through this\nlink\n.\nPraxis management will also be participating in one-on-one investor meetings at the\nJefferies Biotech on the Bay Summit\n, taking place at the Ritz Carlton South Beach Hotel in Miami on Tuesday, March 11, 2025.\nPraxis management will also be participating in a fireside chat at the\nBarclays 27\nth\nAnnual Global Healthcare Conference\n, taking place at the Loews Miami South Beach Hotel in Miami on Wednesday, March 12, 2025 at 2:30p.m. EDT. A live webcast of the event will be available through this\nl\nink\n.\nPraxis management will also be participating in a fireside chat at the\nUBS Virtual CNS Day\n, taking place on March 17, 2025 at 9:30a.m. EDT. A live webcast of the event will be available through this\nlink\n.\nThe Company will be available for one-on-one meetings during all events. Interested investors should contact their respective representatives to request meetings.\nReplays of the webcasted events will also be available through the “\nEvents & Presentations\n” page under the “\nInvestors + Media\n” section of the company’s website for 90 days.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across movement disorders and epilepsy, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines Provides Update on Essential3 and Corporate Update",
    "link": "https://www.globenewswire.com/news-release/2025/02/28/3034690/0/en/Praxis-Precision-Medicines-Provides-Update-on-Essential3-and-Corporate-Update.html",
    "date": "February 28, 2025 08:00 ET",
    "text": "Praxis Precision Medicines Provides Update on Essential3 and Corporate Update\nFebruary 28, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, Feb.  28, 2025  (GLOBE NEWSWIRE) -- Praxis Precision Medicines, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today provided an update on the interim analysis for Study 1 of the Essential3 program of ulixacaltamide in essential tremor (ET), an update on other therapies in development and a financial update.\nResults of the Planned Interim Analysis and Update on Topline Read-out for the Essential3 Program:\nThe Independent Data Monitoring Committee (IDMC) overseeing the interim analysis of Study 1 of the Essential3 program has provided Praxis with the outcome of such analysis. Based on the predefined decision framework for Study 1, the IDMC has recommended that the study be stopped for futility, due to the results being unlikely to meet the primary efficacy endpoint under the parameters set by the statistical model. The committee also indicated that some underlying assumptions of the statistical model might have influenced this outcome and encouraged Praxis to explore alternative analysis methods.\nGiven the advanced state of enrollment for both Study 1 and Study 2 in the Essential3 program, and in the context of the advice received by the IDMC, Praxis has decided to continue both studies to completion, with topline results expected in the third quarter of 2025. The decision about whether the data supports the submission of an NDA will be made after analyzing the final results for Study 1 and Study 2.\n“We are disappointed with and surprised by the outcome of the interim analysis for Study 1. Following the advice of the committee, we will explore different analysis methods for the final dataset, which is expected in the third quarter of 2025,” said Marcio Souza, president and chief executive officer of Praxis. “We remain focused on delivering on major near-term milestones in our other development programs, including the topline results from the RADIANT and POWER1 studies in focal onset seizures (FOS) and generalized epilepsy with vormatrigine, and the initiation of our EMERALD registrational study of relutrigine in developmental epilepsies and encephalopathies (DEEs) by mid-year 2025. We maintain a robust financial position that supports our continued investment in this exciting pipeline.”\nCorporate Updates, Recent Highlights and Anticipated Milestones:\nCerebrum™ Small Molecule Platform\nVormatrigine (PRAX-628) for Focal Onset Seizures and Generalized Epilepsy:\nThe ENERGY program continues to progress, with multiple topline readouts expected in 2025.\nThe\nEMPOWER observational study\n, in partnership with the Epilepsy Study Consortium, characterizing seizure burden, is ongoing with over 3,000 patients consented.\nEarly results\nwere shared during the Praxis scientific exhibit at the December 2024 American Epilepsy Society (AES) Annual Meeting, demonstrating significant disease burden compounded by persistent, uncontrolled, often untracked seizures alongside profound psychosocial impact.\nPraxis has initiated the RADIANT Phase 2, open-label, single-arm study for FOS and generalized epilepsy assessing seizure burden with vormatrigine treatment, with topline results expected by mid-year 2025.\nPraxis has also initiated the POWER1 Phase 2/3 registrational study of vormatrigine for treatment resistant FOS, with topline results anticipated in the second half of 2025.\nPOWER2, the second registrational study for FOS, is on track to begin enrollment in the second half of 2025.\nRelutrigine (PRAX-562) for Developmental and Epileptic Epilepsies (DEEs):\nEMBOLD is currently enrolling patients with SCN2A and SCN8A DEEs in the registrational cohort 2, with topline results anticipated in the first half of 2026, followed by a potential NDA filing in 2026.\nIn December 2024, Praxis received Rare Pediatric Disease Designation (RPDD) from the U.S. Food and Drug Administration (FDA) for relutrigine for Dravet Syndrome. This is the third RPDD for relutrigine, in addition to SCN2A and SCN8A DEEs.\nFollowing recent regulatory interactions, Praxis anticipates initiating the EMERALD study for DEEs by mid-year 2025.\nSolidus™ Antisense Oligonucleotide (ASO) Platform\nElsunersen (PRAX-222) for early-seizure-onset SCN2A-DEE:\nFollowing discussions with global regulatory agencies, Praxis has finalized the registrational trial design. EMBRAVE3 will be a global, 24-week, double-blind, sham-procedure controlled study, with approximately 40 early-onset SCN2A-DEE patients, and is anticipated to start enrolling patients by mid-year 2025.\nThe second cohort of the EMBRAVE study evaluating safety and efficacy of elsunersen versus sham procedure continues enrolling patients in Brazil, with topline readout anticipated in the first half of 2026.\nAdditional Pipeline Updates:\nUCB exercised its option to in-license global development and commercialization rights for a KCNT1 small molecule development candidate. Praxis has earned an option exercise fee and is eligible to receive future success-based development and commercialization milestone payments, for a total of up to approximately $100 million, in addition to tiered royalties on net sales of any resulting products from the collaboration.\nPraxis remains on track to nominate a development candidate for each of its early stage ASO therapeutic initiatives in 2025\nPRAX-080: Focused on targeting PCDH19 mosaic expression which represents a pioneering approach to treating PCDH19-related epilepsy, a rare but devastating genetic disorder characterized by early-onset seizures and cognitive impairment, disproportionately affecting females.\nPRAX-090: Designed to address SYNGAP1 loss-of-function (LoF) mutations, a leading cause of severe intellectual disability and epilepsy in DEEs.\nPRAX-100: Targeting SCN2A LoF mutations, the predominant genetic link to de novo autism spectrum disorders (ASD).\nFourth Quarter and Full-Year 2024 Financial Results:\nAs of December 31, 2024, Praxis had $469.5 million in cash, cash equivalents and marketable securities, compared to $81.3 million in cash and cash equivalents as of December 31, 2023. This increase of $388.2 million was primarily due to net proceeds from Praxis’ January 2024 and April 2024 follow-on public offerings and net proceeds from at-the-market sales of common stock, offset by cash used in operating activities. The Company’s cash, cash equivalents and marketable securities as of December 31, 2024 are expected to fund operations into 2028.\nPraxis recognized $7.5 million and $8.6 million in collaboration revenue during the three months and year ended December 31, 2024, respectively, related to its Option and License Agreement with UCB which was entered into in December 2022.\nResearch and development expenses were $56.3 million for the fourth quarter of 2024, compared to $18.4 million for the fourth quarter of 2023. Research and development expenses were $152.4 million for the year ended December 31, 2024, compared to $86.8 million for the year ended December 31, 2023. The increase in research and development expenses for full year 2024 of $65.6 million was primarily attributable to a $61.9 million increase in expense related to Praxis’ Cerebrum™ platform, a $14.5 million increase in personnel-related costs and a $2.5 million increase in indirect expenses, partially offset by a $13.3 million decrease in expense related to Praxis’ Solidus™ platform.\nGeneral and administrative expenses were $15.1 million for the fourth quarter of 2024, compared to $9.9 million for the fourth quarter of 2023. General and administrative expenses were $56.3 million for the year ended December 31, 2024, compared to $42.1 million for the year ended December 31, 2023. The increase in general and administrative expenses for full year 2024 of $14.2 million was primarily attributable to an $11.7 million increase in personnel-related costs, a $1.7 million increase in professional fees and a $0.9 million increase in other expenses.\nPraxis incurred a net loss of $58.7 million for the fourth quarter of 2024, including $8.6 million of stock-based compensation expense, compared to $26.9 million for the fourth quarter of 2023, including $5.7 million of stock-based compensation expense. Praxis reported a net loss of $182.8 million for the year ended December 31, 2024, including $41.4 million of stock-based compensation expense, compared to a net loss of $123.3 million for the year ended December 31, 2023, including $24.9 million of stock-based compensation expense.\nAs of December 31, 2024, Praxis had 19.4 million shares of common stock outstanding.\nAbout Ulixacaltamide\nUlixacaltamide is a differentiated and highly selective small molecule inhibitor of T-type calcium channels designed to block abnormal neuronal burst firing in the Cerebello-Thalamo-Cortical (CTC) circuit correlated with tremor activity. Ulixacaltamide, the most advanced program within Praxis’ Cerebrum™ small molecule platform, is currently in late-stage development for the treatment of essential tremor,\nEssential3 study\n.\nAbout Vormatrigine (PRAX-628)\nVormatrigine is a next-generation, functionally selective small molecule targeting the hyperexcitable state of sodium-channels in the brain that is currently being developed as a once daily, oral treatment for adult focal onset seizures and generalized epilepsy. Preclinical data demonstrates vormatrigine is differentiated from standard of care, with the potential to be best-in-class for focal epilepsy. In vitro, vormatrigine has demonstrated superior selectivity for disease-state Na\nV\nchannel hyperexcitability. In vivo studies of vormatrigine have demonstrated unprecedented potency in the maximal electroshock seizure (MES) model, a highly predictive translational model for efficacy in focal epilepsy. Data from the study demonstrated that vormatrigine can be safely dosed in healthy subjects to greater than 15 times the predicted human equivalent of the rodent MES EC\n50\n. To learn more about the POWER1 study please visit\nPOWER1 study\n.\nAbout Relutrigine (PRAX-562)\nRelutrigine is a first-in-class small molecule in development for the treatment of developmental and epileptic encephalopathy (DEE) as a preferential inhibitor of persistent sodium current, shown to be a key driver of seizure symptoms in early onset SCN2A-DEE and SCN8A-DEE. Relutrigine’s mechanism of sodium channel blocking is consistent with superior selectivity for disease state sodium channel (NaV) channel hyperexcitability. In vivo studies of relutrigine have demonstrated dose-dependent inhibition of seizures up to complete control of seizure activity in SCN2A, SCN8A and other DEE mouse models. Relutrigine has been generally well-tolerated in three Phase 1 studies and has demonstrated biomarker changes indicative of NaV channel blocking effects. Relutrigine has received ODD and RPDD from the FDA, and ODD from the European Medicines Agency for the treatment of SCN2A-DEE and SCN8A-DEE and RPDD for Dravet Syndrome from the FDA. To learn more about the EMBOLD study, please visit\nEMBOLD study\n.\nAbout Elsunersen (PRAX-222)\nElsunersen is an antisense oligonucleotide (ASO) designed to selectively decrease SCN2A gene expression, directly targeting the underlying cause of early-seizure-onset SCN2A-DEE to treat seizures and other symptoms in patients with gain-of-function SCN2A mutations. In vitro studies of elsunersen have demonstrated reduction in both SCN2A gene expression and protein levels. In vivo, elsunersen has demonstrated significant, dose-dependent reduction in seizures, improvement in behavioral and locomotor activity and increased survival in SCN2A mouse models, with potential to be the first disease-modifying treatment for SCN2A-DEE. Elsunersen has received ODD and RPD from the FDA, and ODD and PRIME designations from the European Medicines Agency for the treatment of SCN2A-DEE. The Elsunersen program is ongoing under a collaboration with Ionis Pharmaceuticals, Inc., and RogCon, Inc. To learn more about the EMBRAVE study, please visit\nhttps://www.embravestudy.com/\n.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across epilepsy and movement disorders, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995 and other federal securities laws, including express or implied statements regarding Praxis’ future expectations, plans and prospects, including, without limitation, statements regarding the anticipated timing of our clinical trials, the development of our product candidates and plans to initiate new clinical programs, the anticipated timing of regulatory submissions and interactions and our projected cash runway, as well as other statements containing the words “anticipate,” “believe,” “continue,” “could,” “endeavor,” “estimate,” “expect,” “anticipate,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “target,” “will” or “would” and similar expressions that constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995.\nThe express or implied forward-looking statements included in this press release are only predictions and are subject to a number of risks, uncertainties and assumptions, including, without limitation: uncertainties inherent in clinical trials; preliminary analyses from ongoing studies differing materially from final data from preclinical studies and completed clinical trials; the expected timing of clinical trials, data readouts and the results thereof, and submissions for regulatory approval or review by governmental authorities; regulatory approvals to conduct trials; and other risks concerning Praxis’ programs and operations as described in its Annual Report on Form 10-K for the year ended December 31, 2024 to be filed and other filings made with the Securities and Exchange Commission. Although Praxis’ forward-looking statements reflect the good faith judgment of Its management, these statements are based only on information and factors currently known by Praxis. As a result, you are cautioned not to rely on these forward-looking statements. Any forward-looking statement made in this press release speaks only as of the date on which it is made. Praxis undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.\nPRAXIS PRECISION MEDICINES, INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(Amounts in thousands)\n(Unaudited)\nDecember 31, 2024\nDecember 31, 2023\nAssets\nCash and cash equivalents\n$\n215,372\n$\n81,300\nMarketable securities\n254,156\n—\nPrepaid expenses and other current assets\n11,805\n3,580\nProperty and equipment, net\n230\n588\nOperating lease right-of-use assets\n1,131\n2,064\nOther non-current assets\n416\n416\nTotal assets\n$\n483,110\n$\n87,948\nLiabilities and stockholders’ equity\nAccounts payable\n$\n12,528\n$\n5,815\nAccrued expenses\n23,763\n7,416\nOperating lease liabilities\n1,369\n2,495\nDeferred revenue\n—\n2,553\nCommon stock\n14\n13\nAdditional paid-in capital\n1,281,522\n723,577\nAccumulated other comprehensive loss\n654\n—\nAccumulated deficit\n(836,740\n)\n(653,921\n)\nTotal liabilities and stockholders' equity\n$\n483,110\n$\n87,948\nPRAXIS PRECISION MEDICINES, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(Amounts in thousands, except share and per share amounts)\n(Unaudited)\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n2024\n2023\n2024\n2023\nCollaboration revenue\n$\n7,463\n$\n515\n$\n8,553\n$\n2,447\nOperating expenses:\nResearch and development\n56,288\n18,388\n152,413\n86,766\nGeneral and administrative\n15,131\n9,933\n56,305\n42,054\nTotal operating expenses\n71,419\n28,321\n208,718\n128,820\nLoss from operations\n(63,956\n)\n(27,806\n)\n(200,165\n)\n(126,373\n)\nOther income:\nOther income, net\n5,277\n928\n17,346\n3,096\nTotal other income\n5,277\n928\n17,346\n3,096\nNet loss\n$\n(58,679\n)\n$\n(26,878\n)\n$\n(182,819\n)\n$\n(123,277\n)\nNet loss per share attributable to common stockholders, basic and diluted\n$\n(2.94\n)\n$\n(2.97\n)\n$\n(10.21\n)\n$\n(18.69\n)\nWeighted average common shares outstanding, basic and diluted\n19,980,179\n9,060,813\n17,906,794\n6,594,316\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2025/02/04/3020833/0/en/Praxis-Precision-Medicines-Inc-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "date": "February 04, 2025 17:00 ET",
    "text": "Praxis Precision Medicines, Inc. Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)\nFebruary 04, 2025 17:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, Feb.  04, 2025  (GLOBE NEWSWIRE) -- Praxis Precision Medicines, Inc. (Nasdaq: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that on February 3, 2025, the Compensation Committee of Praxis’ Board of Directors granted non-qualified stock option awards to purchase an aggregate of 4,050 shares of its common stock and restricted stock unit awards covering an aggregate of 3,038 shares of its common stock to three new non-executive employees under the Praxis Precision Medicines, Inc. 2024 Inducement Plan (the 2024 Inducement Plan). The stock options and restricted stock units were granted as inducements material to the employees’ entering into employment with Praxis in accordance with Nasdaq Listing Rule 5635(c)(4).\nThe 2024 Inducement Plan is used exclusively for the grant of equity awards to individuals who were not previously employees of Praxis, or following a bona fide period of non-employment, as an inducement material to such individuals’ entering into employment with Praxis, pursuant to Nasdaq Listing Rule 5635(c)(4).\nThe options have an exercise price of $80.26 per share, which is equal to the closing price of Praxis’ common stock on the Nasdaq Global Select Market on the date of grant. The options will vest over four years, with 25% of the options vesting on the first anniversary of the vesting commencement date and the remaining options vesting in equal monthly installments over the three years thereafter, subject to each employee’s continued employment with Praxis on each vesting dates. The restricted stock units will vest in four equal annual installments, subject to each employee’s continued employment with Praxis on each vesting date.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across movement disorders and epilepsy, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines to Present at Two February Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/02/03/3019908/0/en/Praxis-Precision-Medicines-to-Present-at-Two-February-Investor-Conferences.html",
    "date": "February 03, 2025 17:00 ET",
    "text": "Praxis Precision Medicines to Present at Two February Investor Conferences\nFebruary 03, 2025 17:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, Feb.  03, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that it will be participating in two upcoming investor conferences:\nPraxis management will be participating in a fireside chat at the\nGuggenheim Securities SMID Cap Biotechnology Conference\n, taking place in New York City on February 6, 2025, at 2:30 p.m. EST. A live webcast of the event will be available through this\nlink\n.\nPraxis management will also be participating in a fireside chat at the\nOppenheimer 35\nth\nAnnual Healthcare Life Sciences Conference\n, taking place virtually on February 11, 2025, at 11:20 a.m. EST. A live webcast of the event will be available through this\nlink\n.\nThe Company will be available for one-on-one meetings during both conferences. Interested investors should contact their respective Guggenheim and/or Oppenheimer representatives to request meetings.\nBoth webcasts will also be available on the “\nEvents and Presentations\n” page under the “\nInvestors + Media\n” section of the company’s website. A replay of the webcasts will be available for 90 days.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across movement disorders and epilepsy, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines Highlights 2025 Corporate Strategy and Business Priorities",
    "link": "https://www.globenewswire.com/news-release/2025/01/13/3008084/0/en/Praxis-Precision-Medicines-Highlights-2025-Corporate-Strategy-and-Business-Priorities.html",
    "date": "January 12, 2025 21:00 ET",
    "text": "Praxis Precision Medicines Highlights 2025 Corporate Strategy and Business Priorities\nJanuary 12, 2025 21:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nThree blockbuster-potential assets in late-stage clinical trials and four pivotal readouts expected in 2025; anticipate four commercial assets by 2028\nStudy 1 of Essential3 program for ulixacaltamide in essential tremor (ET) on track for Q1 2025 interim analysis; NDA filing for ulixacaltamide expected in 2025\nEnrollment in EMBOLD study of relutrigine cohort 2 is on track; targeting NDA filing in 2026\nVormatrigine ENERGY program advancing with read-outs of RADIANT in first half of 2025 and POWER1 by year-end 2025\nUCB has exercised its option to license KCNT1 small molecule candidate for global development and commercialization\nCash and investments ~ $470 million at the end of 2024 support runway into 2028\nBOSTON, Jan.  12, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today highlighted its portfolio progress and provided its business priorities for 2025.\n“2024 was a landmark year for Praxis with positive topline results from the Phase 2 photoparoxysmal response (PPR) trial of vormatrigine that led to initiating our ENERGY program in common epilepsies. Additional highlights this year were the unprecedented efficacy in cohort 1 of the EMBOLD study of relutrigine in developmental and epileptic encephalopathies (DEEs), followed by the initiation of the registrational cohort 2, and the continued overwhelming interest in the Essential3 program. Together, this progress has led to three blockbuster programs in late stage, with the potential for four product launches between 2026 and 2028,” said Marcio Souza, president and chief executive officer.\nMr. Souza continued, “We are now well positioned for a readout-rich 2025, with results anticipated for ulixacaltamide in the Essential3 program in ET followed by our first NDA filing, as well as topline results for vormatrigine from the RADIANT study in focal onset seizures (FOS) and generalized epilepsy, and the POWER1 study in FOS. We are also thrilled to have received a third rare pediatric drug designation (RPDD) for relutrigine in Dravet Syndrome, and with strong interest in cohort 2 of the EMBOLD study, we expect to file the NDA in 2026. With regulatory feedback on the elsunersen program, we expect to initiate the pivotal trial in the first half of 2025. We are sufficiently funded to advance all programs through their topline readouts, with runway into 2028. We look forward to providing a thorough update across our portfolio at the planned Investor R&D Day in the second quarter of 2025.”\nPortfolio updates and anticipated milestones\nCerebrum™ Small Molecule Platform\nUlixacaltamide for Essential Tremor\nET is an inadequately managed, undertreated and high burden disease with a prevalence of seven million patients in the U.S. The Essential3 program includes two Phase 3, registrational studies: Study 1 is a parallel design, placebo-controlled study (N=400) and Study 2 is a randomized withdrawal study (N=200). Since beginning recruitment in November 2023, over 100,000 patients have demonstrated interest in participating in the study.\nA pre-planned interim analysis of Study 1 is anticipated in the first quarter of 2025.\nAt the time of the interim analysis update, Praxis will provide further detail on timing for the full readouts of Study 1 and Study 2.\nPraxis anticipates filing the NDA for ulixacaltamide in 2025.\nFollowing positive results from Essential3, the Company plans to re-initiate a study of ulixacaltamide in Parkinson’s disease, where there is significant and unmet need for non-dopaminergic treatment options.\nVormatrigine (PRAX-628) for Common Epilepsies (Focal Onset Seizures and Generalized Epilepsy)\nAn estimated 3.5 million people in the U.S. suffer from common epilepsies. Sodium channel therapy is the cornerstone of treatment for patients with epilepsy yet currently approved drugs have significant safety and efficacy limitations. Vormatrigine is the most potent sodium-channel modulator ever designed to precisely target the hyperexcitable state of sodium-channels in adult common epilepsies.\nIn recently completed Phase 1 studies, vormatrigine continued to demonstrate an ideal profile with strong competitive differentiation. Full results will be shared at an upcoming medical conference and highlights include:\nResults from an additional 45 mg multiple ascending dose (MAD) cohort showed a dose proportional increase in exposure with excellent tolerability, similar to the 20 and 30 mg MAD cohorts completed previously.\nA Phase 1 food effect study demonstrated that food intake does not affect vormatrigine absorption and therefore there is no need to take vormatrigine with food, which increases flexibility in dosing and ease of use.\nPraxis continues to make progress on the ENERGY program to advance vormatrigine through efficacy and registrational trials.\nThe\nEMPOWER observational study\n, in partnership with the Epilepsy Study Consortium, is aiming to better characterize seizure burden started enrolling patients in 2024 and has enrolled over 2,000 patients.\nEarly\nresults\nwere shared during the Praxis scientific exhibit at the December 2024 American Epilepsy Society (AES) Annual Meeting. The RADIANT Phase 2 study for FOS and generalized epilepsy is currently enrolling patients, with topline results expected in the first half of 2025. RADIANT is an open-label study recruiting up to 50 patients with FOS or generalized epilepsy, who will be treated with a 30 mg dose over an 8-week period to evaluate the impact of vormatrigine on seizure burden.\nEnrollment for the POWER1 Phase 2/3 registrational study in patients with treatment resistant FOS is progressing as planned, with topline results anticipated in the second half of 2025. POWER1 is assessing adjunctive treatment, allowing dosing of vormatrigine on top of 1 to 3 antiseizure medications (ASMs), and aims to enroll approximately 250 patients in a parallel-arm study, comparing a treatment arm of 20 mg for 6 weeks followed by 30 mg for 6 weeks versus a placebo arm for 12 weeks.\nPOWER2 will be the second registrational study for vormatrigine and is expected to begin enrollment in the second half of 2025 as a three-arm, 12-week study.\nPraxis continues to evaluate the potential for expansion of one of its highly functionally selective compounds into pain indications. The program will be discussed at Praxis’ planned R&D Day in the second quarter of 2025.\nRelutrigine (PRAX-562) for Developmental and Epileptic Encephalopathies\nDEEs cover a wide range of genetically and phenotypically defined epileptic conditions that are often characterized by onset of seizures at or shortly after birth and occur in approximately 200,000 patients in the U.S. Relutrigine is a sodium channel modulator with therapeutic potential across developmental epilepsies. Relutrigine is currently being evaluated in the EMBOLD study in SCN2A and SCN8A DEEs, with future plans for the EMERALD study in a broader, pan-DEE patient population.\nIn cohort 1 of the EMBOLD study assessing relutrigine versus placebo in SCN2A gain-of-function (GoF) and SCN8A patients,\nrelutrigine showed\nunparalleled results\n, with an update on the open-label extension (OLE) shared at the 2024 AES Annual Meeting . Key results included:\n46% placebo-adjusted reduction in monthly motor seizures from baseline over a 16-week period.\nPatients continuing into the ongoing OLE (n=13) saw a 77% reduction in motor seizures from baseline through nine months of treatment.\nOver 30% of patients (n=5) achieved seizure freedom status while on relutrigine.\nPatients achieving seizure freedom had a median of 46 days of seizure freedom, inclusive of OLE period, compared to 3 days at baseline.\nMeaningful gains observed in alertness, communication and seizure severity suggest relutrigine has a disease modifying effect.\nRelutrigine was generally well-tolerated with no drug-related serious adverse events or dose reductions required.\nEMBOLD is currently enrolling 80 patients with SCN2A and SCN8A DEEs in registrational cohort 2, with topline results anticipated in the first half of 2026, to be followed by an NDA filing later in 2026.\nIn December 2024, Praxis received RPDD for relutrigine for Dravet Syndrome. This is the third RPDD for relutrigine, in addition to SCN2A and SCN8A DEEs.\nPraxis remains on track to initiate the EMERALD registrational study in the first half of 2025.\nAt the 2024 AES Annual Meeting, Praxis shared\nan update\nfor an emergency use patient\nwith extended benefit achieved after receiving relutrigine\nSolidus™ Antisense Oligonucleotide (ASO) Platform\nElsunersen (PRAX-222) for early-seizure-onset SCN2A-DEE\nSCN2A GoF-DEE is a rare, genetic epilepsy characterized by early-onset and severe impact on development. The disease, as with all DEEs, affects not only the patient but also the entire caregiver ecosystem. In a Part 1 analysis of the EMBRAVE study, four patients receiving elsunersen over a four-month period achieved a 43% reduction in seizure burden compared to baseline.\nPraxis has completed discussions with global regulatory agencies to harmonize a registrational study design for elsunersen and will share the trial design and expected timelines in the first quarter of 2025.\nThe second cohort of the EMBRAVE study continues to enroll patients in Brazil, evaluating safety and efficacy of elsunersen versus sham procedure.\nAt the 2024 AES Annual Meeting, Praxis shared an\nupdate on four emergency access patient\ns\n, including updates from the first-in-patient case who has received elsunersen for over 15 months.\nAdditional Pipeline Updates\nIn December 2024, UCB exercised its option to in-license global development and commercialization rights for a KCNT1 small molecule development candidate as part of the strategic research collaboration established in December 2022. Praxis has earned an option exercise fee and is eligible to receive future success-based development and commercialization milestone payments, for a total of up to approximately $100 million, in addition to tiered royalties on net sales of any resulting products from the collaboration.\nPraxis remains on track to nominate a development candidate for each of its early stage ASO therapeutic initiatives in 2025\nPRAX-080: Focused on targeting PCDH19 mosaic expression which represents a pioneering approach to treating PCDH19-related epilepsy, a rare but devastating genetic disorder characterized by early-onset seizures and cognitive impairment, disproportionately affecting females.\nPRAX-090: Designed to address SYNGAP1 loss-of-function (LoF) mutations, a leading cause of severe intellectual disability and epilepsy in DEEs.\nPRAX-100: Targeting SCN2A LoF mutations, the predominant genetic link to de novo autism spectrum disorders (ASD).\nAbout Ulixacaltamide\nUlixacaltamide is a differentiated and highly selective small molecule inhibitor of T-type calcium channels designed to block abnormal neuronal burst firing in the Cerebello-Thalamo-Cortical (CTC) circuit correlated with tremor activity. Ulixacaltamide, the most advanced program within Praxis’ Cerebrum™ small molecule platform, is currently in late-stage development for the treatment of essential tremor,\nEssential3 study\n.\nAbout Vormatrigine (PRAX-628)\nVormatrigine is a next-generation, functionally selective small molecule targeting the hyperexcitable state of sodium-channels in the brain that is currently being developed as a once daily, oral treatment for adult focal onset seizures and generalized epilepsy. Preclinical data demonstrates vormatrigine is differentiated from standard of care, with the potential to be best-in-class for focal epilepsy. In vitro, vormatrigine has demonstrated superior selectivity for disease-state Na\nV\nchannel hyperexcitability. In vivo studies of vormatrigine have demonstrated unprecedented potency in the maximal electroshock seizure (MES) model, a highly predictive translational model for efficacy in focal epilepsy. Data from the study demonstrated that vormatrigine can be safely dosed in healthy subjects to greater than 15 times the predicted human equivalent of the rodent MES EC\n50\n. To learn more about the POWER1 study please visit\nPOWER1 study\n.\nAbout Relutrigine (PRAX-562)\nRelutrigine is a first-in-class small molecule in development for the treatment of developmental and epileptic encephalopathy (DEE) as a preferential inhibitor of persistent sodium current, shown to be a key driver of seizure symptoms in early onset SCN2A-DEE and SCN8A-DEE. Relutrigine’s mechanism of sodium channel blocking is consistent with superior selectivity for disease state sodium channel (NaV) channel hyperexcitability. In vivo studies of relutrigine have demonstrated dose-dependent inhibition of seizures up to complete control of seizure activity in SCN2A, SCN8A and other DEE mouse models. Relutrigine has been generally well-tolerated in three Phase 1 studies and has demonstrated biomarker changes indicative of NaV channel blocking effects. Relutrigine has received ODD and RPDD from the FDA, and ODD from the European Medicines Agency for the treatment of SCN2A-DEE and SCN8A-DEE and RPDD for Dravet Syndrome from the FDA. To learn more about the EMBOLD study, please visit\nEMBOLD study\n.\nAbout Elsunersen (PRAX-222)\nElsunersen is an antisense oligonucleotide (ASO) designed to selectively decrease SCN2A gene expression, directly targeting the underlying cause of early-seizure-onset SCN2A-DEE to treat seizures and other symptoms in patients with gain-of-function SCN2A mutations. In vitro studies of elsunersen have demonstrated reduction in both SCN2A gene expression and protein levels. In vivo, elsunersen has demonstrated significant, dose-dependent reduction in seizures, improvement in behavioral and locomotor activity and increased survival in SCN2A mouse models, with potential to be the first disease-modifying treatment for SCN2A-DEE. Elsunersen has received ODD and RPD from the FDA, and ODD and PRIME designations from the European Medicines Agency for the treatment of SCN2A-DEE. The Elsunersen program is ongoing under a collaboration with Ionis Pharmaceuticals, Inc. (NASDAQ: IONS), and RogCon, Inc. To learn more about the EMBRAVE study, please visit\nhttps://www.embravestudy.com/\n.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across movement disorders and epilepsy, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995 and other federal securities laws, including express or implied statements regarding Praxis’ future expectations, plans and prospects, including, without limitation, statements regarding the anticipated timing of our clinical trials, the development of our product candidates and plans to initiate new clinical programs, the anticipated timing of regulatory submissions and interactions and our projected cash runway, as well as other statements containing the words “anticipate,” “believe,” “continue,” “could,” “endeavor,” “estimate,” “expect,” “anticipate,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “target,” “will” or “would” and similar expressions that constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995. The express or implied forward-looking statements included in this press release are only predictions and are subject to a number of risks, uncertainties and assumptions, including, without limitation: uncertainties inherent in clinical trials; preliminary analyses from ongoing studies differing materially from final data from preclinical studies and completed clinical trials; the expected timing of clinical trials, data readouts and the results thereof, and submissions for regulatory approval or review by governmental authorities; regulatory approvals to conduct trials; and other risks concerning Praxis’ programs and operations as described in its Annual Report on Form 10-K for the year ended December 31, 2023 and other filings made with the Securities and Exchange Commission. Although Praxis’ forward-looking statements reflect the good faith judgment of its management, these statements are based only on information and factors currently known by Praxis. As a result, you are cautioned not to rely on these forward-looking statements. Any forward-looking statement made in this press release speaks only as of the date on which it is made. Praxis undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  },
  {
    "ticker": "PRAX",
    "title": "Praxis Precision Medicines to Present at J.P. Morgan Healthcare Conference",
    "link": "https://www.globenewswire.com/news-release/2025/01/06/3004585/0/en/Praxis-Precision-Medicines-to-Present-at-J-P-Morgan-Healthcare-Conference.html",
    "date": "January 06, 2025 08:00 ET",
    "text": "Praxis Precision Medicines to Present at J.P. Morgan Healthcare Conference\nJanuary 06, 2025 08:00 ET\n| Source:\nPraxis Precision Medicines, Inc.\nFollow\nPraxis Precision Medicines, Inc.\nShare\nBOSTON, Jan.  06, 2025  (GLOBE NEWSWIRE) --\nPraxis Precision Medicines\n, Inc. (NASDAQ: PRAX), a clinical-stage biopharmaceutical company translating genetic insights into the development of therapies for central nervous system (CNS) disorders characterized by neuronal excitation-inhibition imbalance, today announced that it will be presenting a corporate overview at the 43rd Annual J.P. Morgan Healthcare Conference taking place in San Francisco, CA at the Westin St. Francis Hotel on Wednesday, January 15, 2025 at 2:15pm PST.\nA live webcast of the event will be available through this\nlink\n. A replay of the event will also be available through the “Upcoming & Recent Events” page of the Investors + Media section of the company’s website at\nwww.praxismedicines.com\n, for 30 days.\nAbout Praxis\nPraxis Precision Medicines is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into the development of therapies for CNS disorders characterized by neuronal excitation-inhibition imbalance. Praxis is applying genetic insights to the discovery and development of therapies for rare and more prevalent neurological disorders through our proprietary small molecule platform, Cerebrum™, and antisense oligonucleotide (ASO) platform, Solidus™, using our understanding of shared biological targets and circuits in the brain. Praxis has established a diversified, multimodal CNS portfolio including multiple programs across movement disorders and epilepsy, with four clinical-stage product candidates. For more information, please visit\nwww.praxismedicines.com\nand follow us on\nFacebook\n,\nLinkedIn\nand\nTwitter/X\n.\nContact Data\nContact\nclose\nContact\nWith a Reader Account, it's easy to send email directly to the contact for this release.\nSign up today for your free Reader Account!\nAlready have an account?\nLog in here."
  }
]