[
  {
    "ticker": "TARS",
    "title": "Tarsus to Participate in Upcoming Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/05/29/3090751/0/en/Tarsus-to-Participate-in-Upcoming-Investor-Conferences.html",
    "date": "May 29, 2025 17:00 ET",
    "text": "Tarsus to Participate in Upcoming Investor Conferences\nMay 29, 2025 17:00 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., May  29, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS), today announced that management plans to participate in the following upcoming investor conferences:\nWilliam Blair 45\nth\nAnnual Growth Stock Conference on Tuesday, June 3\nrd\n, at 6:00 a.m. PT / 8:00 a.m. CT\nJefferies Global Healthcare Conference on Wednesday, June 4\nth\n, at 12:45 p.m. PT / 3:45 p.m. ET\nGoldman Sachs 46\nth\nAnnual Global Healthcare Conference on Monday, June 9\nth\n, at 10:20 a.m. PT / 1:20 p.m. ET\nLive webcasts and additional information can be accessed on the events section of the Tarsus\nwebsite\n. Replays will be available on the Tarsus website within 48 hours and will be archived for a limited time.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY\n®\n(lotilaner ophthalmic solution) 0.25% is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea, and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nAKemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus to Participate in Upcoming Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/05/08/3077826/0/en/Tarsus-to-Participate-in-Upcoming-Investor-Conferences.html",
    "date": "May 08, 2025 17:00 ET",
    "text": "Tarsus to Participate in Upcoming Investor Conferences\nMay 08, 2025 17:00 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., May  08, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS) today announced that management plans to participate in the following upcoming investor conferences:\nBank of America Securities 2025 Health Care Conference on Tuesday, May 13\nth\n, at 3:40 p.m. PT / 6:40 p.m. ET\nH.C. Wainwright & Co. 3\nrd\nAnnual BioConnect Nasdaq Investor Conference on Tuesday, May 20\nth\n, at 12:00 p.m. PT / 3:00 p.m. ET\nStifel Virtual Ophthalmology Forum on Tuesday, May 27\nth\n, at 7:30 a.m. PT / 10:30 a.m. ET\nLive webcasts and additional information can be accessed on the events section of the Tarsus\nwebsite\n. Replays will be available on the Tarsus website within 48 hours and will be archived for a limited time.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY (lotilaner ophthalmic solution) 0.25% is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the prevention of Lyme disease.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nAKemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus Reports First Quarter 2025 Financial Results and Recent Business Achievements",
    "link": "https://www.globenewswire.com/news-release/2025/05/01/3072792/0/en/Tarsus-Reports-First-Quarter-2025-Financial-Results-and-Recent-Business-Achievements.html",
    "date": "May 01, 2025 16:05 ET",
    "text": "Tarsus Reports First Quarter 2025 Financial Results and Recent Business Achievements\nMay 01, 2025 16:05 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nGenerated $78.3 million\nin net product sales of XDEMVY\n®\n, an increase of 217% year over year and 18% over Q4 2024, and dispensed approximately 72,000 bottles to patients\nStrengthened financial position with approximately $135 million raised in public equity offering; cash, cash equivalents and marketable securities of approximately $408 million as of March 31, 2025\nOn-track to initiate a Phase 2 trial of TP-04 (lotilaner ophthalmic gel) for the potential treatment of Ocular Rosacea in H2 2025\nManagement to host conference call today,\nMay 1, 2025\n, at 1:30 p.m. P.T. / 4:30 p.m. E.T.\nIRVINE, Calif., May  01, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS), today announced financial results for the first quarter ended March 31, 2025.\n“Tarsus has entered 2025 with incredible momentum, driven by strong execution of our category-creating strategic blueprint for success and a focused commitment to leadership in eye care. The XDEMVY launch is continuing to exceed our expectations and is on track to potentially become one of the best-selling anterior segment medicines,” said Bobak Azamian, M.D., Ph.D., Chief Executive Officer and Chairman of Tarsus. “Building on a foundation of strong commercial performance and the success of our recent equity offering, we believe we are well positioned to accelerate the growth of XDEMVY, create another new category in Ocular Rosacea and continue to advance our pipeline.”\nRecent Business and Clinical Highlights\nXDEMVY is on track to potentially be one of the fastest growing and best-selling anterior segment medicines. In the first quarter, the Company:\nGenerated $78.3 million in XDEMVY net product sales, an increase of 217% year over year and 18% over Q4 2024.\nDispensed approximately 72,000 bottles of XDEMVY to patients, an increase of 23% over Q4 2024.\nBroad commercial, Medicare and Medicaid reimbursement of XDEMVY now extends to more than 90% of covered lives.\nRecognized a gross-to-net discount of approximately 47%.\nSubstantially increased the depth of prescribing among our target Eye Care Professionals (ECPs).\nAt the end of Q1 2025, the number of ECPs writing more than one prescription per week increased by nearly 110% compared to Q3 2024.\nDirect-To-Consumer (DTC) advertising drove a 140% increase in the average weekly website visits in March 2025 compared to December 2024.\nOngoing investment expected to increase alongside leading indicators of utilization.\nPresented new data showing the global prevalence and real-world patient burden of\nDemodex\nblepharitis (DB).\nThe Elara study showed the high prevalence and significant impact of DB in Japan, consistent with the U.S.\nResults of the Orion registry showed XDEMVY-treated patients experienced meaningful improvements in some of the most impactful symptoms of disease, including fluctuating vision, redness, itchy eyelids, burning or stinging, dryness and crusted eyes.\nThe combined data from the Ersa and Rhea studies in DB patients with Meibomian Gland Disease (MGD) showed statistically significant and clinically meaningful improvements of the meibomian glands, with at least three times more glands secreting normal or clear liquid in XDEMVY-treated patients compared to vehicle at day 43.\nStrengthened financial position with a $134.8 million upsized public equity offering which will continue to fund the launch of XDEMVY and ongoing pipeline investment.\nContinued to advance a robust pipeline with multiple catalysts expected in 2025.\nOn-track to initiate a Phase 2 study of TP-04 (lotilaner ophthalmic gel) for Ocular Rosacea, a highly prevalent and underserved eye disease with no FDA-approved therapy, in H2 2025.\nAnticipated to meet with regulatory authorities in Japan in H2 2025 to help determine a regulatory path forward for XDEMVY in Japan.\nOn-track for potential European regulatory approval in 2027 of a preservative-free formulation of XDEMVY.\nOn-track to initiate a Phase 2 study of TP-05 (an investigational oral tablet) for the potential prevention of Lyme disease in 2026.\nFirst\nQuarter\n2025\nFinancial Results\nProduct sales, net:\nwere $78.3 million compared to $24.7 million for the same period in 2024, driven by approximately 72,000 bottles of XDEMVY delivered to patients compared to approximately 26,000 bottles delivered in the prior year period.\nCost of sales:\nwere $5.2 million compared to $1.7 million for the same period in 2024, due to manufacturing costs incurred after the approval of XDEMVY, the royalty we pay on net product sales, and the amortization of the milestones paid to our licensor, which is being amortized over its remaining useful life of 8.4 years.\nResearch and development (R&D) expenses:\nwere $14.4 million compared to $12.1 million for the same period in 2024. The increase was primarily due to $0.5 million of increased TP-04 program expenses, $0.9 million of increased payroll and personnel-related costs, $0.9 million of increased early-stage programs, and $0.3 million of increased other indirect expenses. These increases were partially offset by $0.4 million of decreased TP-03 program expenses. Total R&D non-cash stock compensation expense was $1.5 million, which was consistent with $1.5 million in the same period in 2024.\nSelling, general and administrative (SG&A) expenses:\nwere $85.0 million compared to $51.6 million for the same period in 2024. The increase was due primarily to $9.6 million of increased payroll and personnel-related costs (including non-cash stock-based compensation), and $25.6 million of increased commercial and marketing costs, including direct-to-consumer advertising costs, as we continued our commercial expansion of XDEMVY. These increases were partially offset by $1.9 million of decreased information technology applications, legal, professional and other corporate expenses. Total SG&A non-cash stock compensation expense was $5.3 million, compared with $3.9 million in the same period in 2024.\nNet loss:\nwas $25.1 million, compared to $35.7 million for the same period in 2024. Basic and diluted net loss per share for the quarter ended March 31, 2025 was $(0.64), compared with $(1.01) for the same period in 2024.\nCash position:\nAs of March 31, 2025, cash, cash equivalents and marketable securities were $407.9 million.\nConference Call and Webcast\nTarsus will host a conference call and webcast to discuss its first quarter 2025 financial results and business highlights today, May 1, 2025, at 1:30 p.m. P.T. / 4:30 p.m. ET. A live webcast will be available on the events section of the Tarsus\nwebsite\n. A recorded version of the call will be available on the website shortly after the completion of the call and will be archived there for at least 90 days.\nAbout XDEMVY\n®\nXDEMVY (lotilaner ophthalmic solution) 0.25%, formerly known as TP-03, is a novel prescription eye drop designed to treat\nDemodex\nblepharitis by targeting and eradicating the root cause of the disease –\nDemodex\nmite infestation. XDEMVY was evaluated in two pivotal trials collectively involving more than 800 patients. Both trials met the primary endpoint and all secondary endpoints, with statistical significance and no serious treatment-related adverse events. Most patients found the XDEMVY eye drop to be neutral to very comfortable. The most common ocular adverse reactions observed in the studies were instillation site stinging and burning which was reported in 10% of patients. Other ocular adverse reactions reported by less than 2% of patients were chalazion/hordeolum (stye) and punctate keratitis.\nXDEMVY Indication and Important Safety Information\nINDICATIONS AND USAGE\nXDEMVY is indicated for the treatment of\nDemodex\nblepharitis.\nMost common side effects\n: The most common side effect in clinical trials was stinging and burning in 10% of patients. Other side effects in less than 2% of patients were chalazion/hordeolum and punctate keratitis.\nFor additional information, please see full prescribing information available at:\nhttps://xdemvy.com/\n.\nAbout TP-03\nTP-03 (lotilaner ophthalmic solution) 0.25% is a novel therapeutic designed to treat\nDemodex\nblepharitis by targeting and eradicating the root cause of disease –\nDemodex\nmite infestation. It was approved by the FDA in 2023 under the brand name XDEMVY® for the treatment of\nDemodex\nblepharitis. Lotilaner is a well-characterized anti-parasitic agent that paralyzes and eradicates\nDemodex\nmites by selectively inhibiting parasite-specific gamma-aminobutyric acid-gated chloride (GABA-Cl) channels. It is a highly lipophilic molecule, which may promote its uptake in the oily sebum of the eye lash follicles where the mites reside.\nAbout TP-04\nTP-04 is an investigational aqueous gel formulation of lotilaner, a well-characterized anti-parasitic agent that paralyzes and kills mites by selectively inhibiting parasite-specific GABA-Cl channels. Tarsus is studying TP-04 for the treatment of Ocular Rosacea (OR).\nAbout TP-05\nTP-05 is an investigational oral systemic formulation of lotilaner, a well-characterized anti-parasitic agent that selectively inhibits parasite-specific GABA-Cl channels. TP-05 is believed to be the only non-vaccine, drug-based, preventative therapeutic in development designed to kill ticks to potentially prevent Lyme disease transmission.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care, dermatology, and infectious disease prevention. XDEMVY (lotilaner ophthalmic solution) 0.25% is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the prevention of Lyme disease, all of which are in Phase 2.\nForward-Looking Statements\nStatements in this press release about future expectations, plans and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements.” These statements include statements regarding the potential commercial success and growth of XDEMVY in\nDemodex\nblepharitis, including market size, acceptance, demand, prescription fill rate and adoption rate for XDEMVY; our ability to successfully implement and continue our new direct-to-consumer campaign; our ability to achieve and maintain distribution and patient access for XDEMVY and timing and breadth of payer coverage; our ability to continue to educate the market about\nDemodex\nblepharitis; our ability to initiate planned clinical studies; anticipated regulatory and development milestones including potential Europe and Japan regulatory pathways and approval for XDEMVY; the results of our clinical studies; the test results of our pipeline formulations; our ability to continue investing in our business, and the quotations of Tarsus’ management. The words, without limitation, “believe,” “contemplate,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” or “would,” or the negative of these terms or other similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these or similar identifying words. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors. Important factors that could cause actual results to differ materially from those in the forward-looking statements include: Tarsus is heavily dependent on the successful commercialization of its lead product, XDEMVY for the treatment of\nDemodex\nblepharitis and the development and regulatory approval and commercialization of its current and future product candidates; Tarsus’ ability to obtain and maintain regulatory approval for and successfully commercialize its products, including XDEMVY for the treatment of\nDemodex\nblepharitis, and its product candidates to meet existing and future regulatory standards; Tarsus has incurred significant losses and negative cash flows from operations since inception and anticipates that it will continue to incur significant expenses and losses for the foreseeable future; Tarsus’ capital requirements are difficult to predict and may change; Tarsus may need to obtain additional funding to achieve its goals and a failure to obtain this necessary capital when needed on acceptable terms, or at all, could force Tarsus to delay, reduce, or eliminate its product development programs, commercialization efforts or other operations; Tarsus may not be successful in educating healthcare professionals and the market about the need for treatments specifically for\nDemodex\nblepharitis and other diseases targeted by XDEMVY or our product candidates; the development and commercialization of Tarsus products is dependent on intellectual property it licenses from Elanco Tiergesundheit AG; Tarsus expects to expand its development, regulatory, operational, sales, and marketing capabilities and Tarsus may encounter difficulties in managing its growth, which could disrupt its operations; the sizes of the market opportunity for XDEMVY and Tarsus’ product candidates, particularly TP-04 for the treatment of Ocular Rosacea, as well as TP-05 for the prevention of Lyme disease, have not been established with precision and may be smaller than estimated; the results of Tarsus’ earlier studies and trials may not be predictive of future results; any termination or suspension of, or delays in the commencement or completion of, Tarsus’ planned clinical trials could result in increased costs, delay or limit its ability to generate revenue and adversely affect its commercial prospects; if Tarsus is unable to obtain and maintain sufficient intellectual property protection for its product candidates, or if the scope of the intellectual property protection is not sufficiently broad, Tarsus’ competitors could develop and commercialize products similar or identical to Tarsus’ products; and if Tarsus is unable to access capital (including but not limited to cash, cash equivalents, and credit facilities) and/or loses capital, as a result of potential failure of any financial institutions that Tarsus does business with directly or indirectly. Further, there are other risks and uncertainties that could cause actual results to differ from those set forth in the forward-looking statements and they are detailed from time to time in the reports Tarsus files with the Securities and Exchange Commission, including Tarsus’ Form 10-K for the year ended December 31, 2024 filed on February 25, 2025 and the most recent Form 10-Q quarterly filing filed with the SEC on May 1, 2025, which Tarsus incorporates by reference into this press release, copies of which are posted on its website and are available from Tarsus without charge. However, new risk factors and uncertainties may emerge from time to time, and it is not possible to predict all risk factors and uncertainties. Accordingly, readers are cautioned not to place undue reliance on these forward-looking statements. Any forward-looking statements contained in this earnings release are based on the current expectations of Tarsus’ management team and speak only as of the date hereof, and Tarsus specifically disclaims any obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nakemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com\nTARSUS PHARMACEUTICALS, INC.\nCONDENSED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\n(In thousands, except share and per share amounts)\n(unaudited)\nThree Months Ended\nMarch 31,\n2025\n2024\nRevenues:\nProduct sales, net\n$\n78,335\n$\n24,720\nLicense fees and collaboration revenue\n—\n2,894\nTotal revenues\n78,335\n27,614\nOperating expenses:\nCost of sales\n5,211\n1,654\nResearch and development\n14,409\n12,066\nSelling, general and administrative\n84,995\n51,578\nTotal operating expenses\n104,615\n65,298\nLoss from operations before other income (expense)\n(26,280\n)\n(37,684\n)\nOther income (expense):\nInterest income\n3,454\n3,117\nInterest expense\n(2,213\n)\n(983\n)\nOther income (expense), net\n(81\n)\n(181\n)\nTotal other income (expense), net\n1,160\n1,953\nNet loss\n$\n(25,120\n)\n$\n(35,731\n)\nUnrealized gain (loss) on marketable securities and cash equivalents\n(94\n)\n(61\n)\nComprehensive loss\n$\n(25,214\n)\n$\n(35,792\n)\nNet loss per share, basic and diluted\n$\n(0.64\n)\n$\n(1.01\n)\nWeighted-average shares outstanding, basic and diluted\n39,345,359\n35,300,655\nTARSUS PHARMACEUTICALS, INC.\nCONDENSED BALANCE SHEETS\n(In thousands, except share and par value amounts)\nMarch 31, 2025\nDecember 31, 2024\n(unaudited)\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n175,787\n$\n94,819\nMarketable securities\n232,129\n196,557\nAccounts receivable, net\n62,426\n46,760\nInventory\n2,705\n2,620\nOther receivables\n1,727\n1,299\nPrepaid expenses\n5,999\n14,650\nTotal current assets\n480,773\n356,705\nRestricted cash, non-current\n2,563\n2,562\nInventory, non-current\n2,532\n2,533\nProperty and equipment, net\n2,787\n2,314\nIntangible assets, net\n8,086\n8,326\nOperating lease right-of-use assets\n393\n552\nLong-term investments\n3,000\n3,000\nOther assets\n616\n999\nTotal assets\n$\n500,750\n$\n376,991\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable and other accrued liabilities\n$\n76,375\n$\n64,789\nAccrued payroll and benefits\n9,933\n15,823\nTotal current liabilities\n86,308\n80,612\nLong-term debt, net\n71,984\n71,845\nTotal liabilities\n158,292\n152,457\nCommitments and contingencies\nStockholders’ equity:\nPreferred stock, $0.0001 par value; 10,000,000 authorized; no shares issued and outstanding\n—\n—\nCommon stock, $0.0001 par value; 200,000,000 shares authorized; 41,995,537 shares issued and outstanding at March 31, 2025 (unaudited); 38,349,826 shares issued and outstanding at December 31, 2024\n6\n6\nAdditional paid-in capital\n727,697\n584,559\nAccumulated other comprehensive income (loss)\n85\n179\nAccumulated deficit\n(385,330\n)\n(360,210\n)\nTotal stockholders’ equity\n342,458\n224,534\nTotal liabilities and stockholders’ equity\n$\n500,750\n$\n376,991"
  },
  {
    "ticker": "TARS",
    "title": "Aduro Engages Siemens to Deliver Advanced Automation for Hydrochemolytic™ Pilot Plant",
    "link": "https://www.globenewswire.com/news-release/2025/05/01/3072228/0/en/Aduro-Engages-Siemens-to-Deliver-Advanced-Automation-for-Hydrochemolytic-Pilot-Plant.html",
    "date": "May 01, 2025 07:00 ET",
    "text": "Aduro Engages Siemens to Deliver Advanced Automation for Hydrochemolytic™ Pilot Plant\nThis project focuses on integrating Siemens’ advanced control and data systems into Aduro’s Next Generation Pilot Plant, supporting the advancement of Hydrochemolytic™ Technology toward industrial readiness\nMay 01, 2025 07:00 ET\n| Source:\nAduro Clean Technologies Inc.\nFollow\nAduro Clean Technologies Inc.\nLondon, Ontario\nShare\nLONDON, Ontario, May  01, 2025  (GLOBE NEWSWIRE) --\nAduro Clean Technologies Inc.\n(“\nAduro\n” or the “\nCompany\n”) (Nasdaq:\nADUR\n) (CSE:\nACT\n) (FSE:\n9D5\n), a clean technology company using the power of chemistry to transform lower-value feedstocks, like waste plastics, heavy bitumen, and renewable oils, into resources for the 21\nst\ncentury, announced today a strategic collaboration with\nSiemens Canada\n,\na leader in industrial automation and digitalization, to supply advanced control systems and engineering services for Aduro’s Next Generation Process Pilot Plant (the “\nPilot Plant\n”), scheduled for commissioning in Q3 2025.\n“At Siemens, we are committed to supporting advanced recycling technologies that enable circularity and reduce environmental impact. Aduro’s Hydrochemolytic™…”\n“Our vision to deliver a modular, scalable chemical recycling solution with Hydrochemolytic™ Technology takes another step forward today,”\n“Partnering with Siemens—an organization recognized globally for engineering excellence and industrial innovation—enhances the foundation we’re building.…”\n“At Siemens, we are committed to supporting advanced recycling technologies that enable circularity and reduce environmental impact. Aduro’s Hydrochemolytic™…”\n“Our vision to deliver a modular, scalable chemical recycling solution with Hydrochemolytic™ Technology takes another step forward today,”\n“Partnering with Siemens—an organization recognized globally for engineering excellence and industrial innovation—enhances the foundation we’re building.…”\n“At Siemens, we are committed to supporting advanced recycling technologies that enable circularity and reduce environmental impact. Aduro’s Hydrochemolytic™…”\nAt the core of the solution is\nSiemens’ SIMATIC PCS neo\ndistributed control system—an advanced, web-based platform that will provide centralized, secure, and scalable process control for the continuous operation of the Pilot Plant. Siemens will also provide instrumentation, operator interfaces, and engineering services to support the plant’s commissioning and performance optimization. Siemens is providing the automation and controls scope in alignment with Zeton Inc., the builder of the Pilot Plant, to ensure seamless system integration and efficient commissioning. Additionally, Siemens will contribute technical input as Aduro begins preparing for the design of a demonstration plant (the “\nDemonstration Plant\n”).\n“Our vision to deliver a modular, scalable chemical recycling solution with Hydrochemolytic™ Technology takes another step forward today,” commented Ofer Vicus, CEO of Aduro. “Partnering with Siemens—an organization recognized globally for engineering excellence and industrial innovation—enhances the foundation we’re building. Their technologies will help ensure our Pilot Plant operates safely and reliably while generating the high-quality process data needed to optimize performance and support Demonstration Plant planning. This collaboration strengthens our path to commercialisation and supports our ability to scale with confidence.”\nHydrochemolytic™ Technology (HCT), developed by Aduro, uses water as a reactive medium at moderate temperatures to selectively cleave carbon–carbon and carbon–heteroatom bonds in polymers. Unlike pyrolysis, which relies on extreme heat and broad thermal cracking, HCT operates under catalytic conditions that enable greater controls over reaction pathways. This selective chemistry enables in higher conversion rate of polymers into lighter, more valuable hydrocarbons that are stable and do not require further hydrogenation. The process also reduces energy input and minimal formation of undesired by-products such as gases, char or heavy tars. The Pilot Plant, currently under construction by Zeton Inc., is a fully instrumented, continuous-flow unit designed to validate the HCT process under real-world operating conditions. As a key scale-up from the earlier R2 continuous flow reactor, the Pilot Plant will provide engineering data, system learnings, and process insights necessary to inform the design and deployment of future demonstration and commercial facilities.\nSiemens brings valuable experience from its work with chemical recycling companies, supporting the scale-up of emerging processes through advanced automation, control, and digitalization technologies. Its collaboration with Aduro reflects an interest in helping enable the next generation of recycling platforms—solutions that are differentiated, energy-efficient, and aligned with the principles of a circular economy.\nSiemens’ PCS neo system allows for seamless automation across plant modules, secure remote access, and centralized data acquisition, giving Aduro precise control over key variables in the Hydrochemolytic™ process. The platform also supports digital twin development—helping simulate, test, and optimize process conditions virtually before implementing physical changes. These tools will be essential as Aduro prepares to move from the Pilot Plant to future commercial-scale operations. While the immediate focus is on delivering automation and control systems for the Pilot Plant, Siemens will also provide engineering services to support scale-up planning for the Demonstration Plant. These contributions include insights into process optimization, digital infrastructure, and plant design—drawing on Siemens’ global experience with innovative recycling projects.\nJoris Myny, Senior Vice President, Digital Industries, Siemens Canada, said: “At Siemens, we are committed to supporting advanced recycling technologies that enable circularity and reduce environmental impact. Aduro’s Hydrochemolytic™ process offers a compelling alternative to conventional methods, and we’re proud to bring our automation and digitalization expertise to help scale it. With our PCS neo platform, we’re enabling real-time visibility, control, and flexibility—key factors in optimizing plant performance and supporting long-term growth. This collaboration reflects our support of innovators who are redefining how materials are recovered and reused.”\nAbout Aduro Clean Technologies\nAduro Clean Technologies is a developer of patented water-based technologies to chemically recycle waste plastics; convert heavy crude and bitumen into lighter, more valuable oil; and transform renewable oils into higher-value fuels or renewable chemicals. The Company’s Hydrochemolytic™ technology relies on water as a critical agent in a chemistry platform that operates at relatively low temperatures and cost, a game-changing approach that converts low-value feedstocks into resources for the 21\nst\ncentury.\nFor further information, please contact:\nAbe Dyck, Head of Business Development and Investor Relations\nir@adurocleantech.com\n+1 226 784 8889\nKCSA Strategic Communications\nJack Perkins, Senior Vice President\naduro@kcsa.com\nForward-Looking Statements\nThis news release contains forward-looking statements. All statements, other than statements of historical fact that address activities, events, or developments that the Company believes, expects, or anticipates will or may occur in the future, are forward-looking statements. The forward-looking statements reflect management’s current expectations based on information currently available and are subject to a number of risks and uncertainties that may cause outcomes to differ materially from those discussed in the forward-looking statements. The forward-looking statements in this release include, but are not limited to, the Company’s collaboration with Siemens to supply advanced control systems and engineering services for Aduro’s Hydrochemolytic™ Pilot Plant, scheduled for commissioning in Q3 2025; that Siemens will contribute technical input as Aduro begins preparing for the design of the Demonstration Plant,; that Aduro’s vision to deliver a modular, scalable chemical recycling solution with HCT will take another step forward with the collaboration; that the Pilot Plant will provide engineering data, system learnings, and process insights necessary to inform the design and deployment of future demonstration and commercial plants; that Siemens will provide valuable experience from its work with early-stage chemical recycling companies, supporting the scale-up of emerging processes through advanced automation, control, and digitalization technologies; that Siemens will also provide in-kind engineering services to support scale-up planning for the Demonstration Plant; that Siemens' PCS neo platform will enable real-time visibility, control, and flexibility—key factors in optimizing plant performance and supporting long-term growth. Although the Company believes that the assumptions inherent in the forward-looking statements are reasonable, forward-looking statements are not guarantees of future performance, and, accordingly, undue reliance should not be put on such statements due to their inherent uncertainty. Important factors that could cause actual results to differ materially from the Company’s expectations include, but are not limited to, the Company’s ability to successfully integrate Siemens’ advanced control systems and achieve the desired performance optimization; obtaining necessary regulatory approvals for the Pilot Plant and Demonstration Plant; changes in market demand for recycled plastics and other feedstocks; availability of sufficient financial resources to complete the Pilot Plant and Demonstration Plant, as applicable; potential operational issues during the commissioning and scaling up of the Pilot Plant and/or Demonstration Plant; the impact of any environmental regulations and sustainability requirements on the projects; the effectiveness of the collaboration between Aduro and Siemens, including any potential unforeseen technical issues, regulatory hurdles, adverse market conditions and/or other factors beyond the control of the parties. The Company expressly disclaims any intention or obligation to update or revise any forward-looking statements whether because of new information, future events, or otherwise, except as required by applicable law.\nA photo accompanying this announcement is available at\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/997aec9a-80d9-4822-9c3a-45b55ec8ab4e\nTags\nChemical Recycling\nSiemens Canada\nAduro Clean Technologies\nSiemens’ SIMATIC PCS neo\nHydrochemolytic\nRelated Links\nAduro Clean Technologies\nNasdaq: ADUR\nCSE: ACT\nFSE: 9D5\nSiemens Simatic PCS neo"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus to Report First Quarter 2025 Financial Results on Thursday, May 1, 2025",
    "link": "https://www.globenewswire.com/news-release/2025/04/24/3067979/0/en/Tarsus-to-Report-First-Quarter-2025-Financial-Results-on-Thursday-May-1-2025.html",
    "date": "April 24, 2025 17:00 ET",
    "text": "Tarsus to Report First Quarter 2025 Financial Results on Thursday, May 1, 2025\nApril 24, 2025 17:00 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., April  24, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS), today announced that it will host a live webcast at 1:30 p.m. PT / 4:30 p.m. ET on Thursday, May 1, 2025, to report its first quarter 2025 financial results and provide a corporate update.\nParticipants may access the webcast\nhere\n. A recorded version of the call will be available on the website shortly after the completion of the webcast and will be archived there for approximately 90 days.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY\n®\n(lotilaner ophthalmic solution) 0.25% is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nAKemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus to Present Several Scientific Abstracts Highlighting the Global Prevalence of Demodex Blepharitis and the Clinical Impact of XDEMVY at the American Society of Cataract and Refractive Surgery (ASCRS) 2025 Annual Meeting",
    "link": "https://www.globenewswire.com/news-release/2025/04/22/3065511/0/en/Tarsus-to-Present-Several-Scientific-Abstracts-Highlighting-the-Global-Prevalence-of-Demodex-Blepharitis-and-the-Clinical-Impact-of-XDEMVY-at-the-American-Society-of-Cataract-and-R.html",
    "date": "April 22, 2025 08:31 ET",
    "text": "Tarsus to Present Several Scientific Abstracts Highlighting the Global Prevalence of Demodex Blepharitis and the Clinical Impact of XDEMVY at the American Society of Cataract and Refractive Surgery (ASCRS) 2025 Annual Meeting\nApril 22, 2025 08:31 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., April 22, 2025 (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS) will present four distinct data sets highlighting the global prevalence and real-world patient burden of\nDemodex\nblepharitis, as well as the impact of XDEMVY\n®\n(lotilaner ophthalmic solution) 0.25% in addressing objective measures of disease at the American Society of Cataract and Refractive Surgery (ASCRS) 2025 Annual Meeting, taking place April 25-28, 2025, in Los Angeles, Calif.\n“From new prevalence data in Japan to real-world results in the US, the findings accepted for oral presentation at ASCRS reinforce the global burden of\nDemodex\nblepharitis and the potential of XDEMVY to deliver significant improvements in patient outcomes across multiple subtypes, including those with concomitant meibomian gland disease,” said Elizabeth Yeu, M.D., Chief Medical Officer of Tarsus. “We look forward to continuing to generate new evidence to advance the clinical understanding of XDEMVY and its potential impact on this highly prevalent eyelid disease and on the lives of patients.”\nAccepted abstracts include:\nLongitudinal Evaluation of Disease Burden and Treatment Efficacy in Patients with\nDemodex\nblepharitis: Orion Registry Interim Results\nDate: Sunday, April 27, 2025, 10:42 – 10:47 a.m. PT\nLocation: Los Angeles Convention Center (LACC) – Level 2, 512\nPresenter: Kendall E. Donaldson, M.D., M.S., ABO\nA real-world, multi-center study characterizing the burden of\nDemodex\nblepharitis, the current disease management landscape and key changes in patient outcomes after initiation of treatment with XDEMVY.\nAssessment of the\nDemodex\nBlepharitis Specific Symptoms: The Janus Study\nDate: Monday, April 28, 2025, 8:00 – 8:05 a.m. PT\nLocation: LACC – Level 2, 506\nPresenter: Nicole R. Fram, M.D., ABO\nA prospective, observational study that compared symptoms and clinical outcomes in patients with\nDemodex\nblepharitis to patients without\nDemodex\nblepharitis.\nLotilaner Ophthalmic Solution, 0.25% for the Treatment of\nDemodex\nblepharitis Patients with Meibomian Gland Dysfunction\nDate: Monday, April 28, 2025, 8:33 – 8:38 a.m. PT\nLocation: LACC – Level 2, 506\nPresenter: Mitchell C. Shultz, M.D., ABO\nTwo pooled studies that evaluated the safety and efficacy of XDEMVY in patients with\nDemodex\nblepharitis and Meibomian Gland Disease.\nPrevalence of\nDemodex\nblepharitis in Japan: The Elara Study\nDate: Monday, April 28, 2025, 10:30 – 10:35 a.m. PT\nLocation: LACC – Level 2, 504\nPresenter: Shizuka Koh, M.D., Ph.D.\nAn observational, multicenter study highlighting the prevalence and symptomatology of\nDemodex\nblepharitis in Japan.\nAbout\nDemodex\nBlepharitis\nBlepharitis is a common lid margin disease that is characterized by eyelid margin inflammation, redness and ocular irritation.\nDemodex\nblepharitis is caused by an infestation of\nDemodex\nmites, the most common ectoparasite found on humans, and accounts for over two-thirds of all blepharitis cases.\nDemodex\nblepharitis may affect as many as 25 million Americans based on an extrapolation from the Titan study indicating 58% of patients presenting to U.S. eye care clinics have collarettes, a pathognomonic sign of\nDemodex\nmite infestation, and that at least 45 million people annually visit an eye care clinic.\nDemodex\nblepharitis can have a significant clinical burden and negative impact on patients’ daily lives.\nAbout XDEMVY\n®\nXDEMVY (lotilaner ophthalmic solution) 0.25%, formerly known as TP-03, is a novel prescription eye drop designed to treat\nDemodex\nblepharitis by targeting and eradicating the root cause of the disease –\nDemodex\nmite infestation. XDEMVY was evaluated in two pivotal trials collectively involving more than 800 patients. Both trials met the primary endpoint and all secondary endpoints, with statistical significance and no serious treatment-related adverse events. Most patients found the XDEMVY eye drop to be neutral to very comfortable. The most common ocular adverse reactions observed in the studies were instillation site stinging and burning which was reported in 10% of patients. Other ocular adverse reactions reported by less than 2% of patients were chalazion/hordeolum (stye) and punctate keratitis.\nXDEMVY Indication and Important Safety Information\nIndications and Usage\nXDEMVY (lotilaner ophthalmic solution) 0.25% is indicated for the treatment of\nDemodex\nblepharitis.\nImportant Safety Information\nMost common side effects:\nThe most common side effect in clinical trials was stinging and burning in 10% of patients. Other side effects in less than 2% of patients were chalazion/hordeolum and punctate keratitis.\nHandling the Container:\nAvoid allowing the tip of the dispensing container to contact the eye, surrounding structures, fingers, or any other surface in order to minimize contamination of the solution. Serious damage to the eye and subsequent loss of vision may result from using contaminated solutions.\nWhen to Seek Physician Advice\n: Immediately seek a physician’s advice concerning the continued use of XDEMVY if you develop an intercurrent ocular condition (e.g., trauma or infection), have ocular surgery, or develop any ocular reactions, particularly conjunctivitis and eyelid reactions.\nUse with Contact Lenses:\nXDEMVY contains potassium sorbate, which may discolor soft contact lenses. Contact lenses should be removed prior to instillation of XDEMVY and may be reinserted 15 minutes following its administration.\nTo report SUSPECTED ADVERSE REACTIONS, contact Tarsus Pharmaceuticals at 1-888-421-4002 or FDA at 1-800-FDA-1088 or\nwww.fda.gov/medwatch\n.\nFor additional information please see\nFull Prescribing Information\navailable at:\nwww.xdemvy.com\n.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY™ (lotilaner ophthalmic solution) 0.25%, is FDA approved in the United States for the treatment of Demodex blepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nForward-Looking Statements\nStatements in this press release about future expectations, plans and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements.” These statements include statements regarding the timing, content, location, and presenters of scientific abstracts at an upcoming medical conference, our ability to continue to educate the market and generate data about\nDemodex\nblepharitis, the potential market size of\nDemodex\nblepharitis globally, and the quotations of Tarsus’ management. The words, without limitation, “believe,” “contemplate,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” or “would,” or the negative of these terms or other similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these or similar identifying words. Further, there are other risks and uncertainties that could cause actual results to differ from those set forth in the forward-looking statement and they are detailed from time to time in the reports Tarsus files with the Securities and Exchange Commission, including Tarsus’ Form 10-K for the year ended December 31, 2024, filed on February 25, 2025, with the SEC, copies of which are posted on its website and are available from Tarsus without charge. However, new risk factors and uncertainties may emerge from time to time, and it is not possible to predict all risk factors and uncertainties. Accordingly, readers are cautioned not to place undue reliance on these forward-looking statements. Any forward-looking statements contained in this press release are based on the current expectations of Tarsus’ management team and speak only as of the date hereof, and Tarsus specifically disclaims any obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nContacts:\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nakemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "374Water Awarded Aqueous Film-Forming Foam Destruction Contract by the State of North Carolina",
    "link": "https://www.globenewswire.com/news-release/2025/03/26/3050160/0/en/374Water-Awarded-Aqueous-Film-Forming-Foam-Destruction-Contract-by-the-State-of-North-Carolina.html",
    "date": "March 26, 2025 16:30 ET",
    "text": "374Water Awarded Aqueous Film-Forming Foam Destruction Contract by the State of North Carolina\nMarch 26, 2025 16:30 ET\n| Source:\n374Water\nFollow\n374Water\nShare\nUp to 29,000 Gallons Total of AFFF to be Treated by AirSCWO\nMajor Step Forward in the Removal of Harmful Per- and Polyfluoroalkyl Substances (PFAS) From Firefighting Foam\nDURHAM, N.C., March  26, 2025  (GLOBE NEWSWIRE) -- 374Water Inc. (NASDAQ: SCWO) (“374Water”) (the “Company”), a global leader in organic waste destruction technology for the municipal, federal, and industrial markets, is pleased to announce that it has been awarded a contract by the State of North Carolina for the destruction of Aqueous Film-Forming Foam (“AFFF”). We recently announced the launch of our Waste Destruction Services (“WDS”), and are thrilled to be providing WDS to the University of North Carolina at Chapel Hill Collaboratory.\nNorth Carolina’s 60,000-gallon AFFF destruction initiative stands as one of the most ambitious state-led per- and polyfluoroalkyl substances (“PFAS”) disposal efforts to date. AFFF has been a critical tool in combating flammable liquid and gas fires, including petroleum, greases, tars, oils, oil-based paints, solvents, and alcohols. 374Water intends to destroy AFFF, secured by the State of North Carolina as part of their State take-back program, per North Carolina’s Responsible Firefighting Foam Management Act (H370) of the 2023-2024 Session. 374Water’s first phase intends to treat 1,000 gallons of AFFF. If selected for the second phase, 374Water could treat up to an additional 28,000 gallons of AFFF. This initiative demonstrates a strong commitment to eliminating PFAS contamination at scale while setting a precedent for future large-scale environmental remediation projects.\n“We have a long history of working with a wide range of partners across the State to demonstrate organic waste destruction capabilities, including Duke University, various local utilities and water and wastewater municipalities, as well as industrial and federal partners,” said Sunny Viswanathan, VP of Sales for 374Water. “374Water specializes in the destruction of organic waste streams including concentrated PFAS waste streams, and our AirSCWO system has consistently shown PFAS >99.99% destruction and removal efficiency.”\nChris Gannon, CEO of 374Water, added, “This award marks a significant win for both 374Water and the State of North Carolina, and is a crucial step towards solving the PFAS problem that exists in North Carolina and across the United States. PFAS remains a headline issue for the State, and we are a leader in the field of PFAS destruction.   Our roots are deep in the State of North Carolina, and this award gives us the chance to do the right thing for the citizens and the State.\n“Through this partnership, we continue to solidify our role as a trusted leader in sustainable waste destruction, providing innovative solutions to address one of the most pressing environmental challenges of our time. By leveraging our cutting-edge AirSCWO technology, we are helping North Carolina take meaningful action against PFAS contamination and setting a new standard for responsible waste management nationwide. As the project progresses, we look forward to collaborating with stakeholders to expand the reach of our technology and contribute to a cleaner, safer future for communities across the country and beyond,” concluded Gannon.\n374Water Corporate Video\nFor more information about 374Water and its innovative solutions, the company has released a new corporate video that can be viewed at\n374water.com\nor\nYouTube\n.\nAbout 374Water\n374Water Inc. (NASDAQ: SCWO) is a global cleantech company providing innovative solutions addressing wastewater treatment and waste management issues within the municipal, federal and industrial markets. 374Water's AirSCWO technology is designed to efficiently destroy and mineralize a broad spectrum of organic non-hazardous and hazardous organic wastes producing safe dischargeable water streams, safe mineral effluent, safe vent gas, and recoverable heat energy. 374Water's AirSCWO technology has the potential to assist its customers to meet discharge requirements, reduce or eliminate disposal costs, remove bottlenecks, and reduce litigation and other risks. 374Water continues to be a leader in innovative waste treatment solutions, dedicated to creating a greener future and eradicating harmful pollutants. Learn more by visiting and follow us on\nLinkedIn\n.\nCautionary Language on Forward-Looking Statements\nCertain statements in this communication are \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995, as amended. These statements relate to future events or our future financial performance, including statements relating to the whether we will be awarded future large scale remediation projects, including from the State of North Carolina, and our ability to destroy AFFF and other waste streams at scale, and involve known and unknown risks, uncertainties, and other factors that may cause our actual results, levels of activity, performance, or our achievements or those of our industry to be materially different from those expressed or implied by any forward-looking statements. In some cases, forward-looking statements may be identified by the use of words like \"may,\" \"will,\" \"could,\" \"would,\" \"should,\" \"expect,\" \"plan,\" \"anticipate,\" \"intend,\" \"believe,\" \"estimate,\" \"project,\" \"consider,\" \"predict,\" \"potential,\" \"feel,\" or other comparable terminology. The Company has based these forward-looking statements on its current expectations, assumptions, estimates, beliefs, and projections. While the Company believes these expectations, assumptions, estimates, and projections are reasonable, such forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which involve factors or circumstances that are beyond the Company's control. These and other important factors, including those discussed under \"Risk Factors\" in our Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, as well as the Company's subsequent filings with the SEC, may cause actual results, performance, or achievements to differ materially from those expressed or implied by these forward-looking statements. The forward-looking statements herein are made only as of the date they were first issued, and unless otherwise required by applicable securities laws, the Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nInvestor Relations and Media Contact\nChris Tyson\nExecutive Vice President\nMZ North America\nDirect: 949-491-8235\nSCWO@mzgroup.us\nwww.mzgroup.us"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus Announces Pricing of Upsized $125.0 Million Public Offering",
    "link": "https://www.globenewswire.com/news-release/2025/03/13/3041850/0/en/Tarsus-Announces-Pricing-of-Upsized-125-0-Million-Public-Offering.html",
    "date": "March 12, 2025 21:49 ET",
    "text": "Tarsus Announces Pricing of Upsized $125.0 Million Public Offering\nMarch 12, 2025 21:49 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., March  12, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (Nasdaq: TARS) (the “Company” or “Tarsus”) today announced the pricing of an upsized underwritten public offering of 2,808,988 shares of its common stock at a public offering price of $44.50 per share. In addition, Tarsus has granted the underwriters a 30-day option to purchase up to an additional 421,348 shares of its common stock at the public offering price, less underwriting discounts and commissions. The gross proceeds from the offering, before deducting underwriting discounts and commissions and other estimated offering expenses payable by Tarsus, are expected to be approximately $125.0 million, excluding any exercise of the underwriters’ option to purchase additional shares. The offering is expected to close on March 14, 2025, subject to the satisfaction of customary closing conditions.\nGoldman Sachs & Co. LLC, BofA Securities, Barclays, and Oppenheimer & Co. are acting as joint book-running managers for the offering.\nA registration statement relating to the shares to be sold in the offering was filed with the U.S. Securities and Exchange Commission (the “SEC”) on February 29, 2024 and became automatically effective upon filing. Copies of the registration statement can be accessed through the SEC’s website at\nwww.sec.gov\n. The offering is being made only by means of a prospectus supplement and the accompanying prospectus which forms a part of the effective shelf registration statement.\nA preliminary prospectus supplement related to the offering (including the accompanying prospectus) has been filed with the SEC and is available on the SEC’s website located at www.sec.gov. Copies of the final prospectus supplement and the accompanying prospectus may also be obtained, when available, from: Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, New York 10282, by telephone at (866) 471-2526, or by email at prospectus-ny@ny.email.gs.com; BofA Securities, NC1-022-02-25, 201 North Tryon Street, Charlotte, North Carolina 28255-0001, Attention: Prospectus Department, or by email at dg.prospectus_requests@bofa.com; Barclays Capital Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, by telephone at (888) 603-5847, or by email at Barclaysprospectus@broadridge.com; or Oppenheimer & Co. Inc., Attention: Syndicate Prospectus Department, 85 Broad Street, 26th Floor, New York, New York 10004, by telephone at (212) 667-8055, or by email at EquityProspectus@opco.com.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these shares, nor shall there be any sale of these shares in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY (lotilaner ophthalmic solution, 0.25%) is FDA approved in the United States for the treatment of Demodex blepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nForward-Looking Statements\nStatements in this press release about future expectations, plans and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements.” The words, without limitation, “believe,” “contemplate,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” or “would,” or the negative of these terms or other similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these or similar identifying words. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including, but not limited to, risks and uncertainties related to market conditions and satisfaction of customary closing conditions related to the public offering. Further, there are other risks and uncertainties that could cause actual results to differ from those set forth in the forward-looking statement and they are detailed from time to time in the reports Tarsus files with the Securities and Exchange Commission, including Tarsus’ Form 10-K for the year ended December 31, 2024, filed on February 25, 2025, with the SEC, copies of which are posted on its website and are available from Tarsus without charge. However, new risk factors and uncertainties may emerge from time to time, and it is not possible to predict all risk factors and uncertainties. Accordingly, readers are cautioned not to place undue reliance on these forward-looking statements. Any forward-looking statements contained in this press release are based on the current expectations of Tarsus’ management team and speak only as of the date hereof, and Tarsus specifically disclaims any obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nContacts\n:\nMedia Contact\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nAKemp@tarsusrx.com\nInvestor Contact\n:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus Announces Proposed $100.0 Million Public Offering",
    "link": "https://www.globenewswire.com/news-release/2025/03/12/3041763/0/en/Tarsus-Announces-Proposed-100-0-Million-Public-Offering.html",
    "date": "March 12, 2025 16:12 ET",
    "text": "Tarsus Announces Proposed $100.0 Million Public Offering\nMarch 12, 2025 16:12 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., March  12, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (Nasdaq: TARS) (the “Company” or “Tarsus”) today announced the commencement of an underwritten public offering of $100.0 million of shares of its common stock. Tarsus also intends to grant the underwriters a 30-day option to purchase up to an additional $15.0 million of shares of its common stock offered in the proposed offering. All shares in the proposed offering are to be sold by Tarsus. The offering is subject to market and other conditions, and there can be no assurance as to whether or when the offering may be completed, or as to the actual size or terms of the offering.\nGoldman Sachs & Co. LLC, BofA Securities, Barclays, and Oppenheimer & Co. are acting as joint book-running managers for the offering.\nA registration statement relating to the shares to be sold in the proposed offering was filed with the U.S. Securities and Exchange Commission (“SEC”) on February 29, 2024 and became automatically effective upon filing. Copies of the registration statement can be accessed through the SEC’s website at\nwww.sec.gov\n. The offering will be made only by means of prospectus. A preliminary prospectus supplement related to the offering (including the accompanying prospectus) will be filed with the SEC and will be available on the SEC’s website located at\nwww.sec.gov\n. Copies of the preliminary prospectus supplement and the accompanying prospectus may also be obtained, when available, from: Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, New York 10282, by telephone at (866) 471-2526, or by email at prospectus-ny@ny.email.gs.com; BofA Securities, NC1-022-02-25, 201 North Tryon Street, Charlotte, North Carolina 28255-0001, Attention: Prospectus Department, or by email at dg.prospectus_requests@bofa.com; Barclays Capital Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, by telephone at (888) 603-5847, or by email at Barclaysprospectus@broadridge.com; or Oppenheimer & Co. Inc., Attention: Syndicate Prospectus Department, 85 Broad Street, 26th Floor, New York, New York 10004, by telephone at (212) 667-8055, or by email at EquityProspectus@opco.com.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these shares, nor shall there be any sale of these shares in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY (lotilaner ophthalmic solution, 0.25%) is FDA approved in the United States for the treatment of Demodex blepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nForward-Looking Statements\nStatements in this press release about future expectations, plans and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements.” The words, without limitation, “believe,” “contemplate,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” or “would,” or the negative of these terms or other similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these or similar identifying words. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors; including, but not limited to, risks and uncertainties related to market conditions, and satisfaction of customary closing conditions related to the proposed public offering and the grant to the underwriters of an option to purchase additional shares. Further, there are other risks and uncertainties that could cause actual results to differ from those set forth in the forward-looking statement and they are detailed from time to time in the reports Tarsus files with the Securities and Exchange Commission, including Tarsus’ Form 10-K for the year ended December 31, 2024 filed on February 25, 2025 with the SEC, copies of which are posted on its website and are available from Tarsus without charge. However, new risk factors and uncertainties may emerge from time to time, and it is not possible to predict all risk factors and uncertainties. Accordingly, readers are cautioned not to place undue reliance on these forward-looking statements. Any forward-looking statements contained in this press release are based on the current expectations of Tarsus’ management team and speak only as of the date hereof, and Tarsus specifically disclaims any obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nContacts:\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nakemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus to Participate in Upcoming Investor Conference",
    "link": "https://www.globenewswire.com/news-release/2025/03/06/3038668/0/en/Tarsus-to-Participate-in-Upcoming-Investor-Conference.html",
    "date": "March 06, 2025 17:00 ET",
    "text": "Tarsus to Participate in Upcoming Investor Conference\nMarch 06, 2025 17:00 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., March  06, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS), today announced that management will participate in a fireside chat at the Barclays 27\nth\nAnnual Global Healthcare Conference on Tuesday, March 11\nth\n, at 8:00 a.m. / 11:00 a.m. ET.\nA live webcast and additional information can be accessed on the events section of the Tarsus\nwebsite\n. The replay will be available on the Tarsus website within 48 hours and will be archived for a limited time.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY\n®\n(lotilaner ophthalmic solution, 0.25%) is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nAKemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "374Water Preliminary Data Shows 99.9999% AFFF PFAS Destruction with Arcadis & US Department of Defense",
    "link": "https://www.globenewswire.com/news-release/2025/03/05/3037407/0/en/374Water-Preliminary-Data-Shows-99-9999-AFFF-PFAS-Destruction-with-Arcadis-US-Department-of-Defense.html",
    "date": "March 05, 2025 08:31 ET",
    "text": "374Water Preliminary Data Shows 99.9999% AFFF PFAS Destruction with Arcadis & US Department of Defense\nMarch 05, 2025 08:31 ET\n| Source:\n374Water\nFollow\n374Water\nShare\nPeer Review Highlights 374Water’s AirSCWO as a Potential Solution at Scale\nDURHAM, N.C., March  05, 2025  (GLOBE NEWSWIRE) -- 374Water Inc. (NASDAQ: SCWO) (“374Water”) (the “Company”), a global leader in waste destruction technology for the municipal, federal, and industrial markets, today announced peer reviewed preliminary data demonstrating AirSCWO’s 99.9999% destruction of per- and polyfluoroalkyl substances (“PFAS”) in aqueous film-forming foam (“AFFF”).\nPublished\nin the National Ground Water Association (“NGWA”) Journals, the article by Craig Divine, et al. with Arcadis, titled “Solutions for Managing Aqueous Film-Forming-Foam- (AFFF-) Impacted Infrastructure” details the enormity of the AFFF problem, outlines the immense challenges of treating AFFF solutions and infrastructure, and highlights 374Water’s AirSCWO as a potential solution at scale.\nAFFF, a critical tool in combating flammable liquid and gas fires, including petroleum, greases, tars, oils, oil-based paints, solvents and alcohols, has long been utilized by sectors such as municipal firefighting, aviation, military and petrochemical industries. AFFF’s effectiveness stems from its unique composition, which includes per- and polyfluoroalkyl substances (“PFAS”). However, PFAS are highly persistent in the environment and pose significant risks to human health and ecosystems, necessitating urgent measures for their safe destruction. The U.S. Department of Defense (“DoD”) and the European Union (“EU”) have introduced stringent regulations, including the transition to fluorine-free firefighting foams in 2024. In addition, multiple states have implemented buyback programs to support this transition and safely dispose of AFFF stocks.\n“The enormity of the AFFF PFAS problem across the federal, municipal and industrial landscapes presents an opportunity for 374Water to scale rapidly,” said Chris Gannon, CEO of 374Water. “374Water’s AirSCWO system has consistently shown PFAS >99.9999% destruction and removal efficiency (DRE) operating at commercial scale. We are excited by the potential of AirSCWO to provide a permanent solution to dispose of this waste, and we are actively building our destruction services business to support growing demand.”\n“There is a significant need for efficient, cost-effective, sustainable, and adaptive options for the destruction of stockpiles of AFFF,” the authors explain. As SCWO technology continues to mature, solutions such as 374Water’s AirSCWO can “provide significant value across the US DoD portfolio, civil aviation, and other industrial sectors.”\nThe Arcadis article specifies four different waste types found at AFFF remediation sites: AFFF concentrate, rinsate solutions, cleaning agents, and contaminated solid wastes. With the exception of solid wastes, the “aqueous wastes may be managed on-site using…PFAS destruction technologies,” the authors note. Despite traditional disposal methods such as landfilling which are still in wide use, the authors acknowledge the residual “long-term liability for the waste,” persisting. They go on to say, SCWO “may alleviate any future liability of the waste…that the other options do not.”\n“We are elated to participate in this waste destruction demonstration showcasing the effectiveness of 374Water’s commercial-scale AirSCWO technology,” says Howard Teicher, 374Water’s VP of Government. “It is an honor to partner with the Federal government, state and local municipalities, and industrial customers to provide commercial-scale solutions to address PFAS and other waste destruction needs.”\nNGWA Journal article can be found here:\nhttps://ngwa.onlinelibrary.wiley.com/doi/10.1111/gwmr.12703?af=R\nArcadis published a brief podcast discussion of the article, which can be found here:\nhttps://podcasts.apple.com/us/podcast/gwmr-solutions-for-managing-afff-impacted-infrastructure/id1560891120?i=1000693686449\nAbout 374Water\n374Water Inc. (NASDAQ: SCWO) is a global cleantech company providing innovative solutions addressing wastewater treatment and waste management issues within the municipal, federal and industrial markets. 374Water's AirSCWO technology is designed to efficiently destroy and mineralize a broad spectrum of organic non-hazardous and hazardous organic wastes producing safe dischargeable water streams, safe mineral effluent, safe vent gas, and recoverable heat energy. 374Water's AirSCWO technology has the potential to assist its customers to meet discharge requirements, reduce or eliminate disposal costs, remove bottlenecks, and reduce litigation and other risks. 374Water continues to be a leader in innovative waste treatment solutions, dedicated to creating a greener future and eradicating harmful pollutants. Learn more by visiting\nwww.374water.com\nand follow us on\nLinkedIn\n.\nCautionary Language on Forward-Looking Statements\nCertain statements in this communication are \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995, as amended. These statements relate to future events or our future financial performance, including statements relating to our ability to process a range of waste and contaminants, including AFFF, at scale, the regulatory environment, and our future prospects and involve known and unknown risks, uncertainties, and other factors that may cause our actual results, levels of activity, performance, or our achievements or those of our industry to be materially different from those expressed or implied by any forward-looking statements. In some cases, forward-looking statements may be identified by the use of words like \"may,\" \"will,\" \"could,\" \"would,\" \"should,\" \"expect,\" \"plan,\" \"anticipate,\" \"intend,\" \"believe,\" \"estimate,\" \"project,\" \"consider,\" \"predict,\" \"potential,\" \"feel,\" or other comparable terminology. The Company has based these forward-looking statements on its current expectations, assumptions, estimates, beliefs, and projections. While the Company believes these expectations, assumptions, estimates, and projections are reasonable, such forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which involve factors or circumstances that are beyond the Company's control. These and other important factors, including those discussed under \"Risk Factors\" in our Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, as well as the Company's subsequent filings with the SEC, may cause actual results, performance, or achievements to differ materially from those expressed or implied by these forward-looking statements. The forward-looking statements herein are made only as of the date they were first issued, and unless otherwise required by applicable securities laws, the Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nInvestor Relations and Media Contact\nChris Tyson\nExecutive Vice President\nMZ North America\nDirect: 949-491-8235\nSCWO@mzgroup.us\nwww.mzgroup.us"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus Reports Strong Fourth Quarter and Full-Year 2024 Financial Results and Recent Business Achievements",
    "link": "https://www.globenewswire.com/news-release/2025/02/25/3031861/0/en/Tarsus-Reports-Strong-Fourth-Quarter-and-Full-Year-2024-Financial-Results-and-Recent-Business-Achievements.html",
    "date": "February 25, 2025 07:00 ET",
    "text": "Tarsus Reports Strong Fourth Quarter and Full-Year 2024 Financial Results and Recent Business Achievements\nFebruary 25, 2025 07:00 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nGenerated fourth quarter and full-year 2024 net product sales of XDEMVY\n®\nof\n$66.4 million\nand\n$180.1 million\n, respectively, during the first full year of launch\nPresented groundbreaking XDEMVY data; first pharmacologic treatment to demonstrate functional improvements in Meibomian Gland Disease and patient symptoms in Demodex blepharitis patients\nContinued advancing TP-04 (lotilaner ophthalmic gel) for the potential treatment of Ocular Rosacea, the next category-creating opportunity in eye care\nManagement to host conference call today,\nFebruary 25, 2025\n, at 5 a.m. PT / 8 a.m. ET\nIRVINE, Calif., Feb.  25, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS), today announced financial results for the fourth quarter and full-year ended December 31, 2024, and recent business achievements.\n“Tarsus’ demonstrated category-creating blueprint has established XDEMVY as one of the most successful eye care launches to date,” said Bobak Azamian, M.D., Ph.D., Chief Executive Officer and Chairman of Tarsus. “We believe we are only beginning to unlock our full potential as the next leader in eye care and have so much to look forward to, including, potentially serving the millions of patients impacted by\nDemodex\nblepharitis, continuing to uncover new therapeutic indications and deepening our impact across eye care.”\nRecent Business Highlights and Corporate Update\nXDEMVY continued to be one of the fastest growing therapeutics in eye care.\nGenerated $66.4 million and $180.1 million in XDEMVY net product sales for the fourth quarter and full-year 2024, respectively.\nDispensed more than 58,500 and 163,000 bottles to patients in the fourth quarter and full-year 2024, respectively.\nEstablished broad Eye Care Professional (ECP) utilization across more than 15,000 target ECPs.\nThe expanded sales force deployed in the third quarter started to deliver meaningfully to the increased ECP utilization and prescription volumes reported for the fourth quarter of 2024.\nBroad commercial, Medicare and Medicaid reimbursement of XDEMVY now extends to more than 90% of covered lives, as of February 25, 2025.\nRecognized a gross-to-net discount of approximately 45% in the fourth quarter and full-year 2024.\nActivated a memorable and action-oriented Direct-To-Consumer (DTC) campaign on streaming platforms in the fourth quarter of 2024, and initiated a trial-run on network television in January 2025, including spots on the Golden Globes, the GRAMMYs and the National Football League playoffs.\nThe initial patient response from this campaign has been positive across multiple leading indicators, including the downloading of materials, taking the\nDemodex\nblepharitis (DB) quiz and utilizing the “find an eye doctor” tool on the XDEMVY website.\nDTC to continue on streaming platforms and meaningfully expand into a network television campaign beginning in the first quarter of 2025.\nPresented seminal data from the Ersa and Rhea clinical trials in DB patients with Meibomian Gland Disease (MGD) that underscore the benefit of XDEMVY broadly across multiple patient types, including functional improvements in:\nObjective measures of MGD and the most common and impactful patient outcomes, including fluctuating vision.\nContinued to advance a robust pipeline.\nPursuing the next potentially transformative category in eye care – Ocular Rosacea a highly prevalent and underserved eye disease with no FDA-approved therapy.\nTP-04 is an investigational topical sterile ophthalmic gel formulation of lotilaner specifically designed for application across the eyelid and surrounding tissue.\nBased on positive FDA feedback, the Company established a clear regulatory path forward for TP-04 and plans to initiate a Phase 2 study in the second half of 2025.\nPlanning to advance TP-05 for the potential prevention of Lyme disease.\nTP-05 is an investigational oral tablet designed to kill ticks and potentially prevent Lyme disease transmission.\nBased on positive engagements with the FDA, the Company has confirmed the planned regulatory path forward, which currently includes a Phase 2 study in hundreds of patients and a Phase 3 prevention study in thousands of patients.\nExpanded and strengthened Tarsus’ eye care leadership with two key appointments to the executive team and Board of Directors, respectively.\nElizabeth Yeu, M.D., was appointed Chief Medical Officer. Dr. Yeu is a distinguished ophthalmologist with more than two decades of experience, who transitioned from her previous role as Chief Medical Advisor and Board Member of Tarsus.\nKatherine H. (Kate) Goodrich, M.D., MHS, joined the Company’s Board of Directors. Dr. Goodrich is currently the Chief Medical Officer for Humana Inc., and brings decades of experience driving innovative and value-based initiatives designed to improve patient outcomes.\nAdditional Potential Growth Drivers in 2025 and Beyond\nOn-track for potential European regulatory approval of a preservative-free formulation of XDEMVY in 2027.\nInitiated market development work, including Key Opinion Leader engagement, disease education and scientific presentations at major conferences.\nIn Japan, the Company expects to share results from a DB prevalence study in the first half of 2025, and meet with Japanese regulatory authorities to help determine a regulatory path forward.\nThe Chinese regulatory agency, National Medical Products Administration, accepted the New Drug Application (NDA) submitted by Tarsus’ partner, Grand Pharmaceutical Group Ltd., for TP-03 for DB.\nFourth Quarter 2024 Financial Results\nProduct sales, net:\nwere $66.4 million compared to $13.1 million for the same period in 2023, driven by approximately 58,500 bottles of XDEMVY dispensed to patients compared to approximately 15,700 bottles dispensed in the prior year period.\nCost of sales:\nwere $4.9 million compared to $1.2 million for the same period in 2023, due to manufacturing costs incurred after the approval of XDEMVY, the royalty we pay on net product sales and the amortization of the approval milestones we paid to our licensor and are amortizing over a remaining 8.7 years.\nResearch and development (R&D) expenses:\nwere $16.9 million in the fourth quarter compared to $13.3 million in the same period in 2023. The increase was primarily due to $2.5 million more in milestone expenses, $1.0 million of increased payroll and personnel-related costs (including non-cash stock-based compensation), and $1.0 million of increased program spend for TP-03, partially offset by $0.5 million less program spend on TP-05, $0.2 million less program spend on TP-04, and $0.2 million of decreased other indirect expenses. Total R&D non-cash stock-based compensation expense incurred was $1.8 million in the fourth quarter, compared with $1.5 million in the same period in 2023.\nSelling, general and administrative (SG&A) expenses:\nwere $69.0 million in the fourth quarter compared to $43.0 million in the same period in 2023. The increase was due primarily to $15.5 million of increased commercial and market research costs related to the commercial launch of XDEMVY, $7.8 million of increased payroll and personnel-related costs (including non-cash stock-based compensation), and $2.7 million of increased information technology, legal, professional and other corporate infrastructure. Total SG&A non-cash stock-based compensation expense incurred was $5.5 million in the fourth quarter, compared with $3.8 million in the same period in 2023.\nNet loss:\nwas $23.1 million, compared to $41.9 million for the same period in 2023. Basic and diluted net loss per share for the fourth quarter was $(0.60), compared with $(1.31) for the same period last year.\nCash position:\nAs of December 31, 2024, cash, cash equivalents and marketable securities were $291.4 million.\nFull-Year 2024 Financial Results\nProduct sales, net:\nwere $180.1 million compared to $14.7 million in the same period in 2023, driven by more than 163,000 bottles of XDEMVY dispensed to patients.\nCost of sales:\nwere $12.8 million compared to $1.6 million for the same period in 2023, due to manufacturing costs incurred after the approval of XDEMVY, the royalty we pay on net product sales and the amortization of the approval milestone we paid to our licensor and are amortizing over a remaining 8.7 years.\nR&D expenses:\nwere $53.4 million in 2024 compared to $50.3 million in the same period in 2023. The increase was due to $3.5 million of increased payroll and personnel-related costs (including non-cash stock-based compensation), $1.5 million more in milestone expenses, $1.2 million of increased program spend for TP-03, and $0.7 million of increased other indirect expenses, partially offset by $2.7 million less program spend on TP-05, and $1.2 million less program spend on TP-04. Total R&D non-cash stock-based compensation expense incurred was $6.8 million in 2024, compared with $5.8 million in the same period in 2023.\nSG&A expenses:\nwere $237.3 million in 2024 compared to $108.7 million in the same period in 2023. The increase was due primarily to $52.0 million of increased commercial and marketing costs related to the commercial launch of XDEMVY, $39.7 million of increased payroll and personnel-related costs (including non-cash stock-based compensation), and $36.8 million of increased information technology, legal, professional and other corporate expenses. Total SG&A non-cash stock-based compensation expense incurred was $20.4 million in 2024, compared with $13.8 million in the same period in 2023.\nNet loss:\nwas $115.6 million, compared to $135.9 million for the same period in 2023. Basic and diluted net loss per share for 2024 was $(3.07), compared with $(4.62) for 2023.\nConference Call and Webcast\nTarsus will host a conference call and webcast to discuss its fourth quarter and full-year 2024 financial results and business highlights today, February 25, 2025, at 5 a.m. PT / 8 a.m. ET. A live webcast will be available on the events section of the Tarsus\nwebsite\n. A recorded version of the call will be available on the website shortly after the completion of the call and will be archived there for at least 90 days.\nAbout XDEMVY\n®\nXDEMVY (lotilaner ophthalmic solution, 0.25%), formerly known as TP-03, is a novel prescription eye drop designed to treat\nDemodex\nblepharitis by targeting and eradicating the root cause of the disease –\nDemodex\nmite infestation. XDEMVY was evaluated in two pivotal trials collectively involving more than 800 patients. Both trials met the primary endpoint and all secondary endpoints, with statistical significance and no serious treatment-related adverse events. Most patients found the XDEMVY eye drop to be neutral to very comfortable. The most common ocular adverse reactions observed in the studies were instillation site stinging and burning which was reported in 10% of patients. Other ocular adverse reactions reported by less than 2% of patients were chalazion/hordeolum (stye) and punctate keratitis.\nXDEMVY Indication and Important Safety Information\nINDICATIONS AND USAGE\nXDEMVY is indicated for the treatment of\nDemodex\nblepharitis.\nMost common side effects\n: The most common side effect in clinical trials was stinging and burning in 10% of patients. Other side effects in less than 2% of patients were chalazion/hordeolum and punctate keratitis.\nFor additional information, please see full prescribing information available at:\nhttps://xdemvy.com/\n.\nAbout TP-04\nTP-04 is an investigational aqueous gel formulation of lotilaner, a well-characterized anti-parasitic agent that paralyzes and kills mites by selectively inhibiting parasite-specific GABA-Cl channels. Tarsus is studying TP-04 for the potential treatment of Ocular Rosacea.\nAbout TP-05\nTP-05 is an investigational oral systemic formulation of lotilaner, a well-characterized anti-parasitic agent that selectively inhibits parasite-specific GABA-Cl channels. TP-05 is believed to be the only non-vaccine, drug-based, preventative therapeutic in development designed to kill ticks to potentially prevent Lyme disease transmission.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY (lotilaner ophthalmic solution, 0.25%) is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nForward-Looking Statements\nStatements in this press release about future expectations, plans and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements.” These statements include statements regarding the potential commercial success and growth of XDEMVY in\nDemodex\nblepharitis, including market size, acceptance, demand, and adoption rate for XDEMVY; our ability to achieve and maintain distribution and patient access for XDEMVY and timing and breadth of payer coverage; our ability to successfully implement our sales force expansion and new direct-to-consumer campaign including network television; our ability to continue to educate the market about\nDemodex\nblepharitis, the timing, objectives, and results of the clinical trials including planned initiation of Phase 2 trials for the potential treatment of Ocular Rosacea and the prevention of Lyme disease, the potential market size, opportunity, and ECP education for Ocular Rosacea and our other pipeline indications, anticipated regulatory and development milestones including the clarity of the regulatory path forward for TP-04 and TP-05 in the U.S., and potential Europe, Japan, and China regulatory pathways and approval for XDEMVY, the potential benefits of the new executive and board member, our ability to continue investing in our business and become an eye care leader, and the quotations of Tarsus’ management. The words, without limitation, “believe,” “contemplate,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” or “would,” or the negative of these terms or other similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these or similar identifying words. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors. Important factors that could cause actual results to differ materially from those in the forward-looking statements include: Tarsus is heavily dependent on the successful commercialization of its lead product, XDEMVY for the treatment of\nDemodex\nblepharitis and the development and regulatory approval and commercialization of its current and future product candidates; Tarsus’ ability to obtain and maintain regulatory approval for and successfully commercialize its products, including XDEMVY for the treatment of\nDemodex\nblepharitis, and its product candidates to meet existing and future regulatory standards; Tarsus has incurred significant losses and negative cash flows from operations since inception and anticipates that it will continue to incur significant expenses and losses for the foreseeable future; Tarsus’ capital requirements are difficult to predict and may change; Tarsus may need to obtain additional funding to achieve its goals and a failure to obtain this necessary capital when needed on acceptable terms, or at all, could force Tarsus to delay, reduce or eliminate its product development programs, commercialization efforts or other operations; Tarsus may not be successful in educating healthcare professionals and the market about the need for treatments specifically for\nDemodex\nblepharitis and other diseases targeted by XDEMVY or our product candidates; the development and commercialization of Tarsus products is dependent on intellectual property it licenses from Elanco Tiergesundheit AG; Tarsus expects to expand its development, regulatory, operational and sales and marketing capabilities and Tarsus may encounter difficulties in managing its growth, which could disrupt its operations; the sizes of the market opportunity for XDEMVY and Tarsus’ product candidates, particularly TP-04 for the potential treatment of Ocular Rosacea, as well as TP-05 for the potential prevention of Lyme disease, have not been established with precision and may be smaller than estimated; the results of Tarsus’ earlier studies and trials may not be predictive of future results; any termination or suspension of, or delays in the commencement or completion of, Tarsus’ planned clinical trials could result in increased costs, delay or limit its ability to generate revenue and adversely affect its commercial prospects; if Tarsus is unable to obtain and maintain sufficient intellectual property protection for its product candidates, or if the scope of the intellectual property protection is not sufficiently broad, Tarsus’ competitors could develop and commercialize products similar or identical to Tarsus’ products; and if Tarsus is unable to access capital (including but not limited to cash, cash equivalents, and credit facilities) and/or loses capital, as a result of potential failure of any financial institutions that Tarsus does business with directly or indirectly. Further, there are other risks and uncertainties that could cause actual results to differ from those set forth in the forward-looking statements and they are detailed from time to time in the reports Tarsus files with the Securities and Exchange Commission, including Tarsus’ Form 10-K for the year ended December 31, 2024 planned to be filed on February 25, 2025, which Tarsus incorporates by reference into this press release, copies of which are or will be posted on its website and are available from Tarsus without charge. However, new risk factors and uncertainties may emerge from time to time, and it is not possible to predict all risk factors and uncertainties. Accordingly, readers are cautioned not to place undue reliance on these forward-looking statements. Any forward-looking statements contained in this press release are based on the current expectations of Tarsus’ management team and speak only as of the date hereof, and Tarsus specifically disclaims any obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nakemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com\nTARSUS PHARMACEUTICALS, INC.\nSTATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\n(In thousands, except share and per share amounts)\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n2024\n2023\n2024\n2023\nRevenues:\nProduct sales, net\n$\n66,408\n$\n13,076\n$\n180,059\n$\n14,729\nLicense fees and collaboration revenue\n—\n—\n2,894\n2,718\nTotal revenues\n66,408\n13,076\n182,953\n17,447\nOperating expenses:\nCost of sales\n4,926\n1,216\n12,826\n1,593\nCost of license fees and collaboration revenue\n—\n—\n—\n—\nResearch and development\n16,873\n13,305\n53,386\n50,312\nSelling, general and administrative\n69,030\n43,005\n237,310\n108,700\nTotal operating expenses\n90,829\n57,526\n303,522\n160,605\nLoss from operations\n(24,421\n)\n(44,450\n)\n(120,569\n)\n(143,158\n)\nOther income (expense):\nInterest income\n3,647\n2,978\n15,014\n10,337\nInterest expense\n(2,312\n)\n(989\n)\n(7,849\n)\n(3,346\n)\nLoss on debt extinguishment\n—\n—\n(1,944\n)\n—\nOther income (expense), net\n(27\n)\n(13\n)\n586\n(102\n)\nRealized/unrealized (loss) gain on equity investments\n—\n420\n(591\n)\n259\nChange in fair value of equity warrants issued by licensee\n—\n152\n(201\n)\n117\nTotal other income, net\n1,308\n2,548\n5,015\n7,265\nNet loss\n$\n(23,113\n)\n$\n(41,902\n)\n$\n(115,554\n)\n$\n(135,893\n)\nUnrealized gain (loss) on marketable securities and cash equivalents\n(167\n)\n6\n181\n72\nComprehensive loss\n$\n(23,280\n)\n$\n(41,896\n)\n$\n(115,373\n)\n$\n(135,821\n)\nNet loss per share, basic and diluted\n$\n(0.60\n)\n$\n(1.31\n)\n$\n(3.07\n)\n$\n(4.62\n)\nWeighted-average shares outstanding, basic and diluted\n38,560,907\n31,944,237\n37,604,538\n29,383,276\nTARSUS PHARMACEUTICALS, INC.\nBALANCE SHEETS\n(In thousands, except share and par value amounts)\nDecember 31,\n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n94,819\n$\n224,947\nMarketable securities\n196,557\n2,495\nAccounts receivable, net\n46,760\n16,621\nInventory\n2,620\n3,107\nOther receivables\n1,299\n1,093\nPrepaid expenses\n14,650\n7,868\nTotal current assets\n356,705\n256,131\nRestricted cash, non-current\n2,562\n—\nInventory, non-current\n2,533\n—\nProperty and equipment, net\n2,314\n1,468\nIntangible assets, net\n8,326\n3,867\nOperating lease right-of-use assets\n552\n1,880\nLong-term investments\n3,000\n631\nOther assets\n999\n1,514\nTotal assets\n$\n376,991\n$\n265,491\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable and other accrued liabilities\n$\n64,789\n$\n23,691\nAccrued payroll and benefits\n15,823\n13,245\nTotal current liabilities\n80,612\n36,936\nLong-term debt, net\n71,845\n29,819\nOther long-term liabilities\n—\n1,748\nTotal liabilities\n152,457\n68,503\nCommitments and contingencies\nStockholders’ equity:\nPreferred stock, $0.0001 par value; 10,000,000 shares authorized; no shares issued and outstanding\n—\n—\nCommon stock, $0.0001 par value; 200,000,000 shares authorized; 38,349,826 shares issued and outstanding at December 31, 2024; 34,211,190 shares issued and outstanding at December 31, 2023\n6\n5\nAdditional paid-in capital\n584,559\n441,641\nAccumulated other comprehensive income (loss)\n179\n(2\n)\nAccumulated deficit\n(360,210\n)\n(244,656\n)\nTotal stockholders’ equity\n224,534\n196,988\nTotal liabilities and stockholders’ equity\n$\n376,991\n$\n265,491"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus to Report Fourth Quarter and Full-Year 2024 Financial Results on Tuesday, February 25, 2025",
    "link": "https://www.globenewswire.com/news-release/2025/02/20/3030136/0/en/Tarsus-to-Report-Fourth-Quarter-and-Full-Year-2024-Financial-Results-on-Tuesday-February-25-2025.html",
    "date": "February 20, 2025 17:00 ET",
    "text": "Tarsus to Report Fourth Quarter and Full-Year 2024 Financial Results on Tuesday, February 25, 2025\nFebruary 20, 2025 17:00 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., Feb.  20, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS), today announced that it will host a live webcast at 5:00 a.m. PT / 8:00 a.m. ET on Tuesday, February 25, 2025, to report its fourth quarter and full-year 2024 financial results and provide a corporate update.\nParticipants may access the webcast\nhere\n. A recorded version of the call will be available on the website shortly after the completion of the webcast and will be archived there for approximately 90 days.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY\n®\n(lotilaner ophthalmic solution, 0.25%) is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nAKemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus to Participate in Upcoming Investor Conferences",
    "link": "https://www.globenewswire.com/news-release/2025/01/30/3018474/0/en/Tarsus-to-Participate-in-Upcoming-Investor-Conferences.html",
    "date": "January 30, 2025 17:00 ET",
    "text": "Tarsus to Participate in Upcoming Investor Conferences\nJanuary 30, 2025 17:00 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nIRVINE, Calif., Jan.  30, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS), today announced that management will participate in fireside chats at two upcoming investor conferences:\nThe Guggenheim SMID Cap Biotech Conference on Thursday, February 6\nth\n, at 6:00 a.m. PT / 9:00 a.m. ET\nThe Oppenheimer 35\nth\nAnnual Healthcare Life Sciences Conference on Wednesday, February 12\nth\n, at 7:00 a.m. PT / 10:00 a.m. ET\nA live webcast and additional information can be accessed on the events section of the Tarsus\nwebsite\n. The replay will be available on the Tarsus website within 48 hours and will be archived for a limited time.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY\n®\n(lotilaner ophthalmic solution, 0.25%) is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nAKemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  },
  {
    "ticker": "TARS",
    "title": "Tarsus Provides 2025 Update: Accelerating the Launch of XDEMVY® and Establishing Ocular Rosacea as the Next Category-Creating Opportunity in Eye Care",
    "link": "https://www.globenewswire.com/news-release/2025/01/13/3008523/0/en/Tarsus-Provides-2025-Update-Accelerating-the-Launch-of-XDEMVY-and-Establishing-Ocular-Rosacea-as-the-Next-Category-Creating-Opportunity-in-Eye-Care.html",
    "date": "January 13, 2025 08:30 ET",
    "text": "Tarsus Provides 2025 Update: Accelerating the Launch of XDEMVY® and Establishing Ocular Rosacea as the Next Category-Creating Opportunity in Eye Care\nJanuary 13, 2025 08:30 ET\n| Source:\nTarsus Pharmaceuticals, Inc\nFollow\nTarsus Pharmaceuticals, Inc\nShare\nAdvancing TP-04 (lotilaner ophthalmic gel) for the potential treatment of Ocular Rosacea, another large, underserved eye disease with no FDA-approved therapy; Initiation of Phase 2 study planned for 2H 2025\nManagement to host webcast on Tuesday, January\n14, 2025\n, at 8:00 a.m. P.T. / 11:00 a.m. E.T.\nIRVINE, Calif., Jan.  13, 2025  (GLOBE NEWSWIRE) -- Tarsus Pharmaceuticals, Inc. (NASDAQ: TARS) today provided an update on the Company’s key priorities for 2025, including plans to advance TP-04 for the potential treatment of Ocular Rosacea, another category-creating opportunity in eye care.\n“2024 was a groundbreaking year for Tarsus as we established XDEMVY as one of the most successful eye care launches to date. With consistent quarter-over-quarter revenue growth, rapid physician adoption, broad payer coverage to date, and continued acceleration in the number of bottles delivered to patients in the fourth quarter of 2024, our path to eye care leadership is clear,” said Bobak Azamian, M.D., Ph.D., Chief Executive Officer and Chairman of Tarsus. “I expect 2025 to be even more transformational as we turn up the dial on key strategic launch initiatives, plan to generate more new evidence highlighting the impact of XDEMVY and our pipeline candidates, and pursue Ocular Rosacea as the next potentially revolutionary opportunity in eye care.”\nXDEMVY (lotilaner ophthalmic solution, 0.25%) – Driving One of the Fastest Growing Categories in Eye Care\nDuring the first nine months of 2024, the Company delivered more than 104,000 bottles of XDEMVY to patients and generated more than $113 million in XDEMVY net product sales.\nBy the end of Q3 2024, more than 13,000 Eye Care Professionals (ECPs) were prescribing XDEMVY with over 70% writing for multiple patients.\nBroad commercial and Medicare reimbursement now extends to more than 80% of lives covered and a gross-to-net discount percentage in the low 40s as of the end of Q3 2024.\nThe deployment of approximately 50 new sales representatives and leaders in Q3 2024 started to deliver meaningful impact in Q4 2024.\nThe Company initiated a trial run of its first direct-to-consumer advertising campaign on network TV in January 2025, including spots during the Golden Globes and National Football League (NFL) playoffs.\nGroundbreaking data from the Ersa and Rhea clinical trials for the treatment of\nDemodex\nblepharitis (DB) in patients with Meibomian Gland Disease (MGD) further underscore the utility of XDEMVY broadly across DB patient types.\nOcular Rosacea – Pursuing The Next Potentially Transformative Category in Eye Care\nOcular Rosacea (OR) is a highly prevalent, undertreated eye disease with no FDA-approved therapy. It affects ~15-18 million Americans, and more than half of all cases are caused by an infestation of\nDemodex\nmites. This inflammatory condition affects the eyes and surrounding tissue and is often accompanied by the presence of prominent blood vessels, and redness across the eyes and eyelids.\nTP-04 is an investigational topical sterile ophthalmic gel formulation of lotilaner designed for application across the eyelid and surrounding tissue that represents a potentially category-creating therapy in an area of high unmet need.\nPrevious clinical trials of lotilaner in DB, MGD, and papulopustular rosacea demonstrated statistically significant improvements in key objective endpoint measures of disease.\nPatent exclusivity expected to extend through 2038.\nBased on FDA feedback, the Company has established a clear regulatory path forward for TP-04 and plans to initiate a Phase 2 study in the second half of 2025. Results are anticipated in 2026.\nAdditional Potential Growth Drivers in 2025 and Beyond\nOn-track for potential European regulatory approval of a preservative-free formulation of XDEMVY in 2027.\nIn Japan, the Company expects to share results from an ongoing DB prevalence study in 2025 and meet with Japanese regulatory authorities to help determine a regulatory path forward.\nThe Chinese regulatory agency, National Medical Products Administration, accepted the New Drug Application (NDA) submitted by Tarsus’s partner, Grand Pharmaceutical Group Ltd., for TP-03 for DB. A decision is anticipated in 2027.\nThe Company remains on-track to provide an update on TP-05 for the potential prevention of Lyme Disease by the FY 2024 earnings call.\nConference Call and Webcast\nTarsus will host a conference call and webcast on Tuesday, January 14, 2025, at 8:00 a.m. P.T. / 11:00 a.m. E.T. A live webcast will be available on the\nevents\nsection of the Tarsus website. A recorded version of the call will be available on the website shortly after the completion of the call and will be archived there for at least 90 days.\nAbout XDEMVY\n®\nXDEMVY (lotilaner ophthalmic solution, 0.25%), formerly known as TP-03, is a novel prescription eye drop designed to treat\nDemodex\nblepharitis by targeting and eradicating the root cause of the disease –\nDemodex\nmite infestation. XDEMVY was evaluated in two pivotal trials collectively involving more than 800 patients. Both trials met the primary endpoint and all secondary endpoints, with statistical significance and no serious treatment-related adverse events. Most patients found the XDEMVY eye drop to be neutral to very comfortable. The most common ocular adverse reactions observed in the studies were instillation site stinging and burning which was reported in 10% of patients. Other ocular adverse reactions reported by less than 2% of patients were chalazion/hordeolum (stye) and punctate keratitis.\nXDEMVY Indication and Important Safety Information\nINDICATIONS AND USAGE\nXDEMVY is indicated for the treatment of\nDemodex\nblepharitis.\nMost common side effects\n: The most common side effect in clinical trials was stinging and burning in 10% of patients. Other side effects in less than 2% of patients were chalazion/hordeolum and punctate keratitis.\nFor additional information, please see full prescribing information available at:\nhttps://xdemvy.com/\n.\nAbout TP-04\nTP-04 is an investigational aqueous gel formulation of lotilaner, a well-characterized anti-parasitic agent that paralyzes and kills mites by selectively inhibiting parasite-specific GABA-Cl channels. Tarsus is studying TP-04 for the potential treatment of Ocular Rosacea (OR).\nAbout TP-05\nTP-05 is an investigational oral systemic formulation of lotilaner, a well-characterized anti-parasitic agent that selectively inhibits parasite-specific GABA-Cl channels. TP-05 is believed to be the only non-vaccine, drug-based, preventative therapeutic in development designed to kill ticks to potentially prevent Lyme disease transmission.\nAbout Tarsus Pharmaceuticals, Inc.\nTarsus Pharmaceuticals, Inc. applies proven science and new technology to revolutionize treatment for patients, starting with eye care. Tarsus is advancing its pipeline to address several diseases with high unmet need across a range of therapeutic categories, including eye care and infectious disease prevention. XDEMVY (lotilaner ophthalmic solution, 0.25%) is FDA approved in the United States for the treatment of\nDemodex\nblepharitis. Tarsus is also developing TP-04 for the potential treatment of Ocular Rosacea and TP-05 as an oral tablet for the potential prevention of Lyme disease.\nForward-Looking Statements\nStatements in this press release about future expectations, plans and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements.” These include statements regarding the potential commercial success and growth of XDEMVY in\nDemodex\nblepharitis, including market size, acceptance, demand, prescription fill rate and adoption rate for XDEMVY; our ability to successfully implement our sales force expansion and new direct-to-consumer campaign including network TV; our ability to achieve distribution and patient access for XDEMVY; our ability to continue to drive a successful launch of XDEMVY and become an eye care leader; our ability to continue to educate the market about\nDemodex\nblepharitis; anticipated regulatory and development milestones including potential regulatory pathways for approval of XDEMVY in Europe, China, and Japan; the market size and opportunity for our pipeline products including TP-04 for the potential treatment of Ocular Rosacea; the timing of initiation and results of our clinical studies including additional studies on the impact of XDEMVY, a Japan DB prevalence study, TP-04, and TP-05; the potential regulatory pathways and timing of discussions with regulators including the FDA; the impact of our new sales force representatives on our XDEMVY sales; our ability to continue investing in our business, and the quotations of Tarsus’ management. The words, without limitation, “believe,” “contemplate,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” or “would,” or the negative of these terms or other similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these or similar identifying words. Further, there are other risks and uncertainties that could cause actual results to differ from those set forth in the forward-looking statements and they are detailed from time to time in the reports Tarsus files with the Securities and Exchange Commission, including Tarsus’ Form 10-K for the year ended December 31, 2023 filed on February 27, 2024 and the most recent Form 10-Q quarterly filing filed with the SEC filed on November 13, 2024, which Tarsus incorporates by reference into this press release, copies of which are posted on its website and are available from Tarsus without charge. However, new risk factors and uncertainties may emerge from time to time, and it is not possible to predict all risk factors and uncertainties. Accordingly, readers are cautioned not to place undue reliance on these forward-looking statements. Any forward-looking statements contained in this press release are based on the current expectations of Tarsus’ management team and speak only as of the date hereof, and Tarsus specifically disclaims any obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nMedia Contact:\nAdrienne Kemp\nSr. Director, Corporate Communications\n(949) 922-0801\nakemp@tarsusrx.com\nInvestor Contact:\nDavid Nakasone\nHead of Investor Relations\n(949) 620-3223\nDNakasone@tarsusrx.com"
  }
]